Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Packages specified to not be reversioned cannot contain versions:
de: Packages, für die keine Reversionierung ausgeführt werden soll, dürfen keine Versionen enthalten:
es: Los paquetes especificados para no reversionarse no pueden contener versiones:
fr: Des packages dont le versionnage n'est pas à modifier ne peuvent pas contenir les versions :
ja: 復元されないように指定されたパッケージにはバージョンを含めることができません:

source: The specified packages were not found in the repository:
de: Die angegebenen Packages wurden nicht im Repository gefunden:
es: Los paquetes especificados no se encontraron en el repositorio:
fr: Les packages spécifiés sont introuvables dans le référentiel :
ja: 指定されたパッケージがリポジトリに見つかりませんでした:

source: Can not open manifest file {file}: {err} Please run 'pkgrepo verify -s {rroot}' to check the integrity of the repository.
de: Manifestdatei {file} kann nicht geöffnet werden: {err} Führen Sie 'pkgrepo verify -s {rroot}' aus, um die Integrität des Repositorys zu prüfen.
es: No se puede abrir el archivo de manifiesto {file}: {err} Ejecute 'pkgrepo verify -s {rroot}' para verificar la integridad del repositorio.
fr: Impossible d'ouvrir le fichier manifeste {file} : {err} Exécutez 'pkgrepo verify -s {rroot}' pour contrôler l'intégrité du référentiel.
ja: マニフェストファイル {file} を開けません: {err} 'pkgrepo verify -s {rroot}' を実行して、リポジトリの整合性をチェックしてください。

source: Analyzing Manifests
de: Manifeste werden analysiert
es: Analizando manifiestos
fr: Analyse des manifestes
ja: マニフェストを分析しています

source: Dependency chain depth of >{md:d} detected for {p}.
de: Tiefe der Abhängigkeitskette von >{md:d} bei {p} ermittelt.
es: Profundidad de cadena de dependencia >{md:d} detectada para {p}.
fr: Profondeur de chaîne de dépendance >{md:d} détectée pour {p}.
ja: {md:d} よりも深い依存関係チェーンが {p} で検出されました。

source: WARNING: Signature changes in file content ignored in resurfacing
de: WARNUNG: Signaturänderungen in Dateiinhalt bei Resurfacing ignoriert
es: ADVERTENCIA: Se ignoraron los cambios de firma del contenido del archivo en la actualización de la versión del paquete
fr: AVERTISSEMENT : les modifications de signature dans le contenu du fichier sont ignorées lors d'un resurfaçage
ja: 警告: ファイルの内容の署名の変更は再サーフェスで無視されます

source: Packages to process:
de: Zu verarbeitende Packages:
es: Paquetes que procesar:
fr: Packages à traiter :
ja: 処理するパッケージ:

source: New packages:
de: Neue Packages:
es: Paquetes nuevos:
fr: Nouveaux packages :
ja: 新しいパッケージ:

source: Unmodified packages:
de: Nicht geänderte Packages:
es: Paquetes no modificados:
fr: Packages non modifiés :
ja: 変更されていないパッケージ:

source: Packages with successors in reference repo:
de: Packages mit Nachfolgern im Referenz-Repository:
es: Paquetes con sucesores en repositorio de referencia:
fr: Packages disposant de successeurs dans le référentiel de référence :
ja: 参照リポジトリに後継版が含まれているパッケージ:

source: Packages not to be reversioned by user request:
de: Packages, für die gemäß Benutzeranforderung keine Reversionierung ausgeführt werden soll:
es: Paquetes que no se reversionarán por solicitud de usuario:
fr: Packages dont le versionnage n'est pas à modifier sur demande de l'utilisateur :
ja: ユーザーのリクエストによって復元されないパッケージ:

source: Packages with no content change:
de: Packages ohne Inhaltsänderung:
es: Paquetes sin cambio de contenido:
fr: Packages dont le contenu n'a pas changé :
ja: 内容の変更がないパッケージ:

source: Packages which only have dependency change:
de: Packages mit nur Abhängigkeitsänderung:
es: Paquetes que sólo tienen cambio de dependencia:
fr: Packages présentant uniquement un changement de dépendance :
ja: 依存関係の変更のみが含まれるパッケージ:

source: Packages with unchanged dependency chain:
de: Packages mit unveränderter Abhängigkeitskette:
es: Paquetes con cadena de dependencia sin cambios:
fr: Packages dont la chaîne de dépendance n'a pas changé :
ja: 変更されてない依存関係チェーンが含まれるパッケージ:

source: Packages to be reversioned:
de: Zu reversionierende Packages:
es: Paquetes para reversionar:
fr: Packages dont modifier le versionnage :
ja: 復元されるパッケージ:

source: No packages to reversion.
de: Keine zu reversionierenden Packages vorhanden.
es: No hay paquetes para reversionar.
fr: Pas de package dont le versionnage est à modifier.
ja: 復元するパッケージはありません。

source: Reversioning packages (dry-run).
de: Packages werden reversioniert (Probelauf).
es: Reversionando paquetes (ejecución simulada).
fr: Modification du versionnage des packages (test).
ja: パッケージを復元しています (予行演習)。

source: Reversioning packages.
de: Packages werden reversioniert.
es: Reversionando paquetes
fr: Modification du versionnage des packages.
ja: パッケージを復元しています。

source: Could not reversion manifest {path}: {err}
de: Reversionierung von Manifest {path} nicht möglich: {err}
es: No se pudo reversionar el manifiesto {path}: {err}
fr: Impossible de modifier le versionnage du manifeste {path} : {err}
ja: マニフェスト {path} を復元できませんでした: {err}

source: Unexpected argument(s): {0}
de: Unerwartete Argumente: {0}
es: Argumento(s) inesperado(s): {0}
fr: Argument(s) inattendu(s) : {0}
ja: 予期しない引数: {0}

source: A target repository must be provided.
de: Es muss ein Ziel-Repository angegeben werden.
es: Se debe proporcionar un repositorio de destino.
fr: Un référentiel cible doit être indiqué.
ja: ターゲットリポジトリを指定する必要があります。

source: A reference repository must be provided.
de: Es muss ein Referenz-Repository angegeben werden.
es: Se debe proporcionar un repositorio de referencia.
fr: Un référentiel de référence doit être indiqué
ja: 参照リポジトリを指定する必要があります。

source: Target repository must be filesystem-based.
de: Ziel-Repository muss auf einem Dateisystem basieren.
es: El repositorio de destino debe estar basado en sistema de archivos.
fr: Le référentiel cible doit être basé sur un système de fichiers.
ja: ターゲットリポジトリは、ファイルシステムベースである必要があります。

source: Publisher {0} not found in reference repository.
de: Herausgeber {0} wurde nicht im Referenz-Repository gefunden.
es: El editor {0} no se encontró en el repositorio de referencia.
fr: L'éditeur {0} est introuvable dans le référentiel de référence.
ja: パブリッシャー {0} が参照リポジトリに見つかりません。

source: Skipping.
de: Wird übersprungen.
es: Omitiendo.
fr: Etape ignorée.
ja: スキップしています。

source: Rebuilding repository catalog.
de: Repository-Katalog wird neu erstellt.
es: Regenerando catálogo de repositorio.
fr: Reconstruction du catalogue du référentiel.
ja: リポジトリカタログを再構築しています。

source: No matching publishers could be found.
de: Es konnten keine passenden Herausgeber gefunden werden.
es: No se encontraron editores coincidentes.
fr: Aucun éditeur correspondant n'a pu être trouvé.
ja: 一致するパブリッシャーが見つかりませんでした。

source: MEDIATOR
fr: MEDIATEUR

source: BE
de: BU
fr: Env. d'initialisation

source: BE UUID
de: BU-UUID
fr: UUID de l'env. d'initialisation

source: true
es: verdadero
fr: vrai
ru: истина

source: false
es: falso
fr: faux
ru: ложь

source: The file to be installed at {ip} appears to be a python file but contains a syntax error that prevents it from being analyzed. The text of the file can be found at {lp}. The error happened on line {line} at offset {col}. The problem was: {txt}
es: El archivo que se instalará en {ip} parece ser un archivo python, pero contiene un error de sintaxis que impide analizarlo. El texto del archivo se puede encontrar en {lp}. El error se produjo en la línea {line}, en el desplazamiento {col}. El problema fue: {txt}
fr: Le fichier à installer sous {ip} semble être un fichier python mais contient une erreur de syntaxe empêchant son analyse. Le texte du fichier est accessible sous {lp}. L'erreur s'est produite sur la ligne {line} à la colonne {col}. Le problème était : {txt}

source: kB
fr: Ko
ru: кБ

source: MB
fr: Mo
ru: МБ

source: GB
fr: Go
ru: ГБ

source: TB
fr: To
ru: ТБ

source: PB
fr: Po
ru: ПБ

source: EB
fr: Eo
ru: ЭБ

source: Despite the error while indexing, the operation has completed successfully.
es: A pesar del error durante la indización, la operación se completó correctamente.

source: The following URIs use unsupported schemes. Supported schemes are file://, http://, and https://.
es: Los siguientes URI usan esquemas no admitidos. Los esquemas admitidos son file://, http://, and https://.

source: cpu dependency error: '{0}' does not meet the minimum requirement for {1} {2}
es: Error de dependencia de CPU: '{0}' no cumple con los requisitos mínimos para {1} {2}

source: Cannot create or mount a copy of current be. Reporting unpackaged content against current live image.
es: No se puede crear ni montar una copia del entorno de inicio actual. Se informa el contenido sin empaquetar en función de la imagen activa actual.

source: B
es: X
ru: Б

source: publisher ...
ru: издатель ...

source: Try `pkg --help or -?' for more information.
ca: Proveu amb `pkg --help o -?' per a més informació.
ru: Для получения дополнительной информации попытайтесь выполнить `pkg --help or -?'.

source: Options: -R dir --help or -? Environment: PKG_IMAGE
ru: Параметры: -R dir --help or -? Среда: PKG_IMAGE

source: -f may only be used in combination with -a
ca: -f únicament pot utilitzar-se en combinació amb -a
ru: Параметр -f можно использовать только в комбинации с параметром -a.

source: %(opts)s may not be used with %(opt)s
ca: %(opts)s no pot utilitzar-se amb %(opt)s
ru: %(opts)s запрещается использовать вместе с %(opt)s

source: -s and -v may not be combined
ca: -s i -v no poden combinar-se
ru: параметры -s и -v нельзя использовать совместно

source: installed
ca: instal·lat
ru: установлено

source: unsupported
ru: не поддерживается

source: known
ca: conegut
ru: известно

source: no packages are installed or are installed and have newer versions available
ru: отсутствуют установленные пакеты или установленные пакеты с доступной новой версией

source: no packages matching '%s' known
ru: отсутствуют пакеты, соответствующие '%s'

source: no packages matching '%s' allowed by installed incorporations or image variants that are known or installed
ru: отсутствуют пакеты, соответствующие '%s', которые разрешены в установленных компонентах, либо известныеили известные варианты образов

source: no packages matching '%s' are installed and have newer versions available
ru: отсутствуют установленные пакеты или пакеты с доступной новой версией, соответствующие '%s'

source: no packages matching '%s' installed
ru: отсутствуют установленные пакеты, соответствующие '%s'

source: Verifying: %(pkg_name)-50s %(result)7s
ru: Проверка: %(pkg_name)-50s %(result)7s

source: Created ZFS snapshot: %s
ca: Creada instantània ZFS: %s
ru: Создан снимок ZFS: %s

source: The following packages require their licenses to be accepted before they can be repaired:
ca: Els següents paquets necessiten que s'acceptin les seves llicències abans que puguin ser reparats:
ru: Перед исправлением следующих пакетов необходимо принять условия соответствующих лицензий:

source: Requested "fix" operation would affect files that cannot be modified in live image. Please retry this operation on an alternate boot environment.
ca: L'operació "fix" sol·licitada podria afectar a fitxers que no poden ser modificats de l'imatge autònoma. Torneu a intentar aquesta operació en un altre entorn d'arranc.
ru: Запрошенная операция "fix" повлияет на файлы, которые нельзя изменять в используемом образе. Повторите эту операцию в альтернативной загрузочной среде.

source: -v and -q may not be combined
ca: -v i -q no poden combinar-se
ru: параметры -v и -q нельзя использовать совместно

source: All other patterns matched installed packages. %s
ca: Tot els altres patrons coincideixen amb paquets instal·lats. %s
ru: Для всех остальных шаблонов подобраны установленные пакеты. %s

source: Packages to remove: %5d
ru: Удаляемые пакеты: %5d

source: Packages to install: %5d
ru: Устанавливаемые пакеты: %5d

source: Packages to update: %5d
ru: Обновляемые пакеты: %5d

source: Variants/facets to change: %5d
ru: Изменяемые варианты/грани: %5d

source: Create boot environment: %5s
ru: Создать загрузочную среду: %5s

source: Services to restart: %5d
ru: Перезагружаемые службы: %5d

source: Changed fmris:
ru: Измененные FMRI:

source: Affected fmris:
ru: Поврежденные FMRI:

source: None
ru: Нет

source: Package: %s
ca: Paquet: %s
ru: Пакет: %s

source: License: %s
ca: Llicència: %s
ru: Лицензия: %s

source: An unexpected error happened while preparing for %s:
ca: S'ha produït un error inesperat mentre s'estava preparant %s:
ru: Во время подготовки к выполнению %s произошла неожиданная ошибка:

source: %s failed: %s
ca: %s error: %s
ru: %s сбой выполнения: %s

source: %s cannot be done on live image
ca: %s no pot fer-se en l'imatge autònoma
ru: %s нельзя выполнять на используемом образе

source: Requested "%s" operation would affect files that cannot be modified in live image. Please retry this operation on an alternate boot environment.
ca: L'operació "%s" sol·licitada podria afectar a fitxers que no poden ser modificats en l'imatge autònoma. Re-intenteu aquesta operació en un entorn d'arranc alternatiu.
ru: Запрошенная операция "%s" повлияет на файлы, которые нельзя изменять в используемом образе. Повторите эту операцию в альтернативной загрузочной среде.

source: An unexpected error happened during %s: %s
ca: S'ha produït un error durant %s: %s
ru: Произошла неожиданная ошибка во время %s: %s

source: No image rooted at '%s'
ca: Cap imatge arrelada a '%s'
ru: Нет ни одного образа в корневой папке '%s'

source: %s failed (inventory exception): %s
ca: %s error (excepció d'inventari): %s
ru: %s сбой выполнения (исключение учета): %s

source: WARNING: pkg(7) appears to be out of date, and should be updated before running %(op)s. Please update pkg(7) using 'pfexec pkg install pkg:/package/pkg' and then retry the %(op)s.
ru: ПРЕДУПРЕЖДЕНИЕ: pkg(7) является устаревшим и должен быть обновлен до выполнения %(op)s. Обновите pkg(7) при помощи команды 'pfexec pkg install pkg:/package/pkg', а затем снова выполните %(op)s.

source: Cannot remove '%s' due to the following packages that depend on it:
ca: No es pot eliminar '%s' degut a que els següents paquets en depenen:
ru: Невозможно удалить '%s', так как от него зависят следующие пакеты:

source: %s: -v and -q may not be combined
ca: %s: -s i -v no poden combinar-se
ru: %s: параметры -v и -q нельзя использовать совместно

source: %s: no variants specified
ca: %s: variants no especificades
ru: %s: варианты не указаны

source: %s: variants must to be of the form '<name>=<value>'.
ca: %s: les variants han de ser de la forma '<nom>=<valor>'.
ru: %s: варианты должны иметь форму '<name>=<value>'.

source: %s: duplicate variant specified: %s
ca: %s: especificada variant duplicada: %s
ru: %s: указан вариант дубликата: %s

source: %s: no facets specified
ca: %s: cap faceta especificada
ru: %s: грани не указаны

source: %s: facets must to be of the form 'facet....=[True|False|None]'
ca: %s: les facetes han de ser de la forma 'facet....=[True|False|None]'
ru: %s: грани следует указывать в форме 'facet....=[True|False|None]'

source: %s: facets must to be of the form 'facet....=[True|False|None]'.
ca: %s: les facetes han de ser de la forma 'facet....=[True|False|None]'.
ru: %s: грани следует указывать в форме 'facet....=[True|False|None]'

source: Facet change has no effect on image
ca: El canvi de faceta no té efectes en l'imatge
ru: Изменение грани не оказывает воздействия на образ.

source: command does not take operands ('%s')
ca: la comanda no pren operands ('%s')
ru: команда не принимает операнды ('%s')

source: NOTE: Please review release notes posted at:
ca: NOTA: Si us plau reviseu les notes de la versió publicades a:
ru: ПРИМЕЧАНИЕ. Ознакомьтесь с информацией о выпуске по адресу:

source: The repository returned a malformed result. The problematic structure:%r
ru: Хранилище вернуло недопустимый результат. Структура, вызвавшая проблему:%r

source: The repository returned an invalid or unsupported action. %s
ru: Хранилище вернуло недействительное или неподдерживаемое действие. %s

source: %s is not a valid repository URL.
ru: %s не является действительным URL-адресом хранилища.

source: action level options ('%s') to -o cannot be used with the -p option
ca: les opcions a nivell d'acció ('%s') -o no poden ser utilitzades amb l'opció -p
ru: параметры уровня действия ('%s') для -o нельзя использовать с параметром -p

source: The repository returned a malformed result:%r
ru: Хранилище вернуло недопустимый результат:%r

source: -l and -r may not be combined
ca: -l i -r no poden combinar-se
ru: параметры -l и -r нельзя использовать совместно

source: Name:
ca: Nom:
ru: Имя:

source: Summary:
ca: Resum:
ru: Заключение:

source: Description:
ca: Descripció:
ru: Описание:

source: Category:
ca: Categoria:
ru: Категория:

source: State:
ca: Estat:
ru: Состояние:

source: Renamed to:
ca: Reanomenat a:
ru: Переименовано на:

source: Publisher:
ca: Publicador:
ru: Издатель:

source: Version:
ca: Versió:
ru: Версия:

source: Build Release:
ca: Versió construcció:
ru: Версия сборки:

source: Branch:
ca: Branca:
ru: Ветвь:

source: Packaging Date:
ca: Data empaquetament:
ru: Дата упаковки:

source: Size:
ca: Mida:
ru: Размер:

source: pkg: info: no packages matching the following patterns you specified are installed on the system. Try specifying -r to query remotely:
ca: pkg: info: sense paquets que coincideixin amb els següents patrons que heu especificat estan instal·lats al sistema. Intenteu especificant -r a la consulta remota:
ru: pkg: info: в системе не установлен ни один пакет, соответствующий указанным шаблонам. Попробуйте указать параметр -r для удаленного запроса:

source: pkg: info: no packages matching the following patterns you specified were found in the catalog. Try relaxing the patterns, refreshing, and/or examining the catalogs:
ca: pkg: info: sense paquets que coincideixin amb els següents patrons que heu especificat varen ser trobats en el catàleg. Intenteu relaxant els patrons, refrescant i/o examinant els catàlegs:
ru: pkg: info: в каталоге не найден ни один пакет, соответствующий указанным шаблонам. Попробуйте сократить шаблоны, обновить и/или осмотреть каталоги:

source: no license information could be found for the following packages:
ca: Cap informació de llicència pot ser trobada pels següents paquets:
ru: для следующих пакетов не обнаружена информация о лицензии:

source: Invalid attribute '%s'
ca: Atribut no vàlid '%s'
ru: Недопустимый атрибут '%s'

source: -m and %s may not be specified at the same time
ca: -m i %s no poden especificar-se al mateix temps
ru: параметры -m и %s нельзя указывать одновременно

source: pkg: %s/%s catalogs successfully updated:
ca: pkg: %s/%s catàlegs han estat actualitzats:
ru: pkg: каталоги %s/%s успешно обновлены:

source: Could not refresh the catalog for %s
ru: Не удалось обновить каталог для %s

source: The origin URIs for '%(pubname)s' do not appear to point to a valid pkg repository. Please verify the repository's location and the client's network configuration. Additional details: %(details)s
ru: Исходные идентификаторы URI для '%(pubname)s' не указывают на допустимое хранилище pkg. Проверьте местоположение хранилища и настройки сети клиента. Дополнительные сведения: %(details)s

source: The specified URI does not appear to point to a valid pkg repository. Please check the URI and the client's network configuration. Additional details: %s
ru: Указанный идентификатор URI не указывает на действительное хранилище pkg. Проверьте идентификатор URI и настройки сети клиента. Дополнительные сведения: %s

source: properties to be set must be of the form '<name>=<value>'. This is what was given: %s
ru: устанавливаемые свойства должны иметь форму '<name>=<value>'. Указано: %s

source: a property may only be set once in a command. %s was set twice
ru: свойство может быть установлено в команде только один раз. %s было установлено дважды

source: property values to be added must be of the form '<name>=<value>'. This is what was given: %s
ru: добавляемые значения свойств должны иметь форму '<name>=<value>'. Указано: %s

source: property values to be removed must be of the form '<name>=<value>'. This is what was given: %s
ru: удаляемые значения свойств должны иметь форму '<name>=<value>'. Указано: %s

source: the -P and -d options may not be combined
ru: параметры -P и -d нельзя сочетать

source: the -O and -g, --add-origin, -G, or --remove-origin options may not be combined
ca: les opcions -O i -g, --add-origin, -G, o --remove-origin no poden combinar-se
ru: Не допускается комбинирование параметров -O и -g, --add-origin, -G, или --remove-origin.

source: search_before and search_after may not be combined
ca: search_before i search_after no poden combinar-se
ru: Не допускается комбинирование параметров search_before и search_after.

source: the -p option may not be combined with the -g, --add-origin, -G, --remove-origin, -m, --add-mirror, -M, --remove-mirror, --enable, --disable, --no-refresh, --reset-uuid options, or --system-repo
ru: параметр -p нельзя сочетать с параметрами -g, --add-origin, -G, --remove-origin, -m, --add-mirror, -M, --remove-mirror, --enable, --disable, --no-refresh, --reset-uuid или --system-repo

source: The --system-repo and --clear-system-repo options may not be combined.
ru: Нельзя сочетать параметры --system-repo и --clear-system-repo.

source: The --socket-path argument must be used with --system-repo.
ru: Аргумент --socket-path необходимо использовать вместе с аргументом --system-repo.

source: To add a publisher using this repository, execute the following command as a privileged user: pkg set-publisher -g %s <publisher>
ru: Для добавления издателя с использованием этого хранилища выполните следующую команду в качестве привилегированного пользователя: pkg set-publisher -g %s <publisher>

source: The specified repository location is not a known source of publisher configuration updates for '%s'. This new repository location must be added as an origin to the publisher to accept configuration updates from this repository.
ru: Указанное местоположение хранилище не является известным источником обновлений настроек издателя для '%s'. Новое местоположение хранилища следует добавить в качестве источника для принятия обновлений настроек из этого хранилища для издателя.

source: Added publisher(s): %s
ru: Добавленные серверы публикаций: %s

source: Updated publisher(s): %s
ru: Обновленные серверы публикаций: %s

source: publisher does not exist. Use -g to define origin URI for new publisher.
ca: el publicador no existeix, Utilitzeu -g per definir la URI origen pel nou publicador.
ru: издатель не существует. Определите URI источника для нового издателя параметром -g.

source: Removal failed for '%(pub)s': %(msg)s
ca: Error d'eliminació per a '%(pub)s': %(msg)s
ru: Неудачное удаление для '%(pub)s': %(msg)s

source: PREFERRED
ru: ТРЕБУЕТСЯ

source: Unrecognized format %(format)s. Supported formats: %(valid)s
ru: Неизвестный формат %(format)s. Поддерживаемые форматы: %(valid)s

source: preferred
ca: preferit
ru: предпочтительно

source: system
ru: система

source: System URI:
ru: Идентификатор URI системы:

source: Socket Path:
ru: Путь к сокету:

source: set-publisher must be used to change the preferred publisher
ca: set-publisher ha de ser utilitzat per caviar el publicador preferit
ru: для изменения предпочтительного издателя следует использовать свойство set-publisher

source: no such property: %s
ca: no hi ha tal propietat: %s
ru: нет такого свойства: %s

source: property: no such property: %s
ca: propietat: no existeix la propietat: %s
ru: property: нет такого свойства: %s

source: no such variant: %s
ca: no hi ha tal variant: %s
ru: такой вариант отсутствует: %s

source: Facet arguments must beform 'facet..=[True|False]'
ca: Els arguments de faceta han de ser de la forma 'facet..=[True|False]'
ru: Аргументы грани должны указываться в форме "facet..=[True|False]".
