Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: unusual mode mode={mode} delivered in action for {path} in {pkg}
de: Ungewöhnlicher Modus mode={mode} in Aktion für {path} in {pkg} bereitgestellt
es: modo no habitual mode={mode} entregado en acción para {path} en {pkg}
fr: mode exceptionnel mode={mode} fourni dans l'action pour {path} dans {pkg}
ja: 異常なモード mode={mode} が、{pkg} の {path} のアクションでもたらされました

source: Paths should not have unusual permissions.
de: Pfade sollten keine ungewöhnlichen Berechtigungen haben.
es: Las rutas no deben tener permisos inusuales.
fr: Les chemins ne doivent pas avoir d'autorisations inhabituelles.
ja: パスに異常なアクセス権を指定しないでください。

source: {attr} missing from legacy action in {pkg}
de: {attr} fehlt in Legacy-Aktion in {pkg}
es: falta {attr} en la acción antigua de {pkg}
fr: {attr} manquant dans l'action héritée dans {pkg}
ja: {pkg} のレガシーアクションに {attr} がありません

source: legacy action in {0} does not contain a REV= string
de: Legacy-Aktion in {0} enthält keine Zeichenfolge des Typs REV=
es: la acción heredada de {0} no contiene ninguna cadena de caracteres REV=
fr: l'action héritée dans {0} ne contient pas d'attribut REV= chaîne
ja: {0} のレガシーアクションに REV= という文字列が含まれていません

source: legacy renaming: {0}
de: Legacy-Umbenennung: {0}
es: cambio de nombre de elementos antiguos: {0}
fr: changement du nom de l'action héritée : {0}
ja: 旧バージョンの名前変更: {0}

source: legacy package {legacy} did not result in a dependency on {pkg} when following package renames
de: Legacy-Package {legacy} hat keine Abhängigkeit von {pkg} verursacht, als folgendes Package umbenannt wurde
es: el paquete antiguo {legacy} no generó una dependencia de {pkg} al seguir los cambios de nombre de paquete
fr: le package hérité {legacy} n'a pas entraîné de dépendance sur {pkg} lors des changements de nom du package suivant
ja: 次のパッケージの名前を変更しても、旧バージョンのパッケージ {legacy} は {pkg} に依存しません

source: legacy package {legacy} did not result in a dependency on {pkg}
de: Legacy-Package {legacy} hat keine Abhängigkeit in {pkg} verursacht
es: el paquete antiguo {legacy} no generó una dependencia de {pkg}
fr: le package hérité {legacy} n'a pas entraîné de dépendance sur {pkg}
ja: 旧バージョンのパッケージ {legacy} は {pkg} に依存していません

source: 'legacy' actions should have valid attributes.
de: 'legacy'-Aktionen müssen gültige Attribute aufweisen.
es: Las acciones 'legacy' deben tener atributos válidos.
fr: les actions 'legacy' doivent avoir des attributs valides.
ja: 'legacy' アクションには有効な属性がある必要があるべきです。

source: unknown action found in {0}
de: Unbekannte Aktion in {0}
es: se ha encontrado una acción desconocida en {0}
fr: action inconnue trouvée dans {0}
ja: {0} に不明なアクションが見つかりました

source: 'unknown' actions should never occur.
de: 'unknown'-Aktionen dürfen nie auftreten.
es: Las acciones 'unknown' nunca deben ocurrir.
fr: les actions 'unknown' ne doivent jamais se produire.
ja: 'unknown' アクションは発生させないようにしてください。

source: dependency on obsolete package in {0}:
de: Abhängigkeit von veraltetem Paket in {0}:
es: dependencia de paquete obsoleto en {0}:
fr: dépendance sur le package obsolète dans {0} :
ja: {0} の廃止されたパッケージに依存しています:

source: obsolete dependency check skipped: unable to find dependency {dep} for {pkg}
de: Veraltete Abhängigkeitsprüfung übersprungen: Abhängigkeit {dep} für {pkg} kann nicht gefunden werden
es: comprobación de dependencia obsoleta omitida: no se puede encontrar la dependencia {dep} para {pkg}
fr: vérification de dépendance obsolète ignorée : impossible de trouver la dépendance {dep} pour {pkg}
ja: 廃止依存関係チェックがスキップされました: {pkg} に依存関係 {dep} が見つかりません

source: Packages should not have dependencies on obsolete packages.
de: Pakete dürfen keine Abhängigkeiten von veralteten Paketen aufweisen.
es: Los paquetes no deben tener dependencias de paquetes obsoletos.
fr: Les packages ne doivent pas contenir de dépendances sur des packages obsolètes.
ja: パッケージは廃止されたパッケージに依存しているべきではありません。

source: pkg(7) FMRIs should be valid.
de: pkg(7) FMRIs müssen gültig sein.
es: Los FMRI de pkg(7) deben ser válidos.
fr: Les FMRI pkg(7) doivent être valides.
ja: pkg(7) FMRI は有効であるべきです。

source: license action in {pkg} has a path attribute, {path}
de: Lizenzaktion in {pkg} verfügt über ein Pfadattribut, {path}
es: la acción de licencia de {pkg} tiene un atributo de ruta, {path}
fr: l'action de licence dans {pkg} contient un attribut de chemin, {path}
ja: {pkg} のライセンスアクションにはパス属性 {path} があります

source: 'license' actions should not have paths.
de: 'license'-Aktionen dürfen keine Pfade haben.
es: Las acciones 'license' no deben tener rutas.
fr: Les actions 'license' ne doivent pas avoir de chemin.
ja: 'license' アクションにパスは指定しないでください。

source: pkg.linted attributes detected for {pkg} {action}: {linted}
de: pkg.linted-Attribute für {pkg} {action} ermittelt: {linted}
es: atributos pkg.linted detectados para {pkg} {action}: {linted}
fr: attributs pkg.linted détectés pour {pkg} {action} : {linted}
ja: {pkg} の {action} に pkg.linted 属性が検出されました: {linted}

source: Show actions with pkg.linted attributes.
de: Aktionen mit pkg.linted-Attributen anzeigen.
es: Mostrar acciones con atributos pkg.linted.
fr: Afficher les actions avec attributs pkg.linted.
ja: pkg.linted 属性が指定されているアクションを表示します。

source: Publication error with action in {pkg}: {details}
de: Veröffentlichungsfehler bei Aktion in {pkg}: {details}
es: Error de publicación en acción en {pkg}: {details}
fr: Erreur de publication concernant une action dans {pkg} : {details}
ja: {pkg} のアクションで発行エラーが発生しました: {details}

source: Publication checks for actions.
de: Veröffentlichungsüberprüfungen für Aktionen
es: Comprobaciones de publicación de acciones.
fr: Vérifications de publication pour les actions
ja: アクションに対する発行チェック。

source: username attribute value must be set in {pkg}
de: Wert für Benutzernameattribut muss in {pkg} festgelegt werden
es: el valor del atributo de nombre de usuario se debe configurar en {pkg}
fr: la valeur de l'attribut du nom d'utilisateur doit être définie dans {pkg}
ja: {pkg} にユーザー名属性値を設定する必要があります

source: Username {name} in {pkg} > 32 chars
de: Benutzername {name} in {pkg} > 32 Zeichen
es: El nombre de usuario {name} en {pkg} > 32 caracteres
fr: Nom d'utilisateur {name} dans {pkg} > 32 caractères
ja: {pkg} のユーザー名 {name} が 32 文字を超えています

source: Username {name} in {pkg} does not have an initial lower-case alphabetical character
de: Benutzername {name} in {pkg} beginnt nicht mit einem Kleinbuchstaben
es: El nombre de usuario {name} en {pkg} no contiene un carácter alfabético inicial en minúscula
fr: Le caractère initial du nom d'utilisateur {name} dans {pkg} n'est pas un caractère alphabétique minuscule
ja: {pkg} のユーザー名 {name} が小文字の英字で始まっていません

source: Username {name} in {pkg} is discouraged - see passwd(4)
de: Von Benutzername {name} in {pkg} wird abgeraten - siehe passwd(4)
es: El nombre de usuario {name} en {pkg} no se recomienda. Consulte passwd(4)
fr: Le nom d'utilisateur {name} dans {pkg} est déconseillé ; voir passwd(4)
ja: {pkg} のユーザー名 {name} は推奨しません - passwd(4) を参照してください

source: User names should be valid.
de: Benutzernamen müssen gültig sein.
es: Los nombres de usuario deben ser válidos.
fr: Les noms d'utilisateur doivent être valides.
ja: ユーザー名は有効であるべきです。

source: 'incorporate' depend action on {fmri} in {pkg} does not have a version.
de: 'incorporate'-Abhängigkeitsaktion für {fmri} in {pkg} verfügt über keine Version.
es: la acción dependiente 'incorporar' de {fmri} en {pkg} no tiene una versión.
fr: L'action de dépendance 'incorporate' sur {fmri} dans {pkg} ne présente pas de version.
ja: {pkg} の {fmri} に対する 'incorporate' 依存アクションにバージョンが含まれていません。

source: 'incorporate' dependencies should have a version.
de: 'incorporate'-Abhängigkeiten müssen eine Version aufweisen.
es: Las dependencias 'incorporar' deben tener una versión.
fr: Les dépendances de type 'incorporate' requièrent une version.
ja: 'incorporate' 依存関係にはバージョンを含めるようにしてください。

source: facet value should be set to 'true', 'false' or 'all' in attribute name {key} in {fmri}
de: Für Attributname {key} in {fmri} muss der Facettenwert auf 'True', 'False' oder 'All' gesetzt werden
es: el valor de faceta debe establecerse en 'true', 'false' o 'all' en el nombre de atributo {key} en {fmri}
fr: la valeur de facette doit être définie sur 'true', 'false' ou 'all' dans le nom d'attribut {key} dans {fmri}
ja: {fmri} の属性名 {key} のファセット値を 'true'、'false'、または 'all' に設定してください

source: facet value should be set to a valid value in an action attribute
de: Der Facet-Wert sollte bei Aktionsattributen auf einen gültigen Wert gesetzt werden
es: el valor de faceta debe establecerse en un valor válido en un atributo de acción
fr: la valeur de facette doit être définie sur une valeur valide dans un attribut d'action
ja: アクション属性のファセット値を有効な値に設定するようにしてください

source: invalid package actuator name {attr} in {fmri} supported values: {sact}
de: Ungültiger Packageaktuatorname {attr} in {fmri} Unterstützte Werte: {sact}
es: nombre de activador de paquete no válido {attr} en {fmri} valores admitidos: {sact}
fr: nom de l'actionneur du package non valide {attr} dans {fmri} valeurs prises en charge : {sact}
ja: {fmri} 内の無効なパッケージアクチュエータ名 {attr} サポートされる値: {sact}

source: package actuator should be set to a valid value
de: Packageaktuator muss auf einen gültigen Wert gesetzt werden
es: el activador de paquete debe configurarse con un valor válido
fr: l'actionneur du package doit être défini sur une valeur valide
ja: パッケージアクチュエータを有効な値に設定するようにしてください

source: {elfbits}-bit object delivered for {path} in {fmri}.
de: {elfbits}-Bit-Objekt für {path} in {fmri} zugestellt.
es: Objeto de {elfbits} bits entregado para {path} en {fmri}.
fr: objet de {elfbits} bits fourni pour {path} dans {fmri}.
ja: {fmri} の {path} に {elfbits} ビットオブジェクトがもたらされました。

source: non-library ELF files should be 64-bit
de: Nicht-Bibliothek-ELF-Dateien müssen 64-Bit sein
es: los archivos ELF que no son de biblioteca deben tener 64 bits
fr: les fichiers ELF autres que les fichiers de bibliothèque doivent être des fichiers 64 bits
ja: ライブラリでない ELF ファイルは 64 ビットであるべきです

source: Checks for errors within the scope of a single manifest.
de: Überprüft Fehler innerhalb des Geltungsbereichs eines einzelnen Manifests.
es: Comprobar si hay errores en el ámbito de un solo manifiesto.
fr: Recherche des erreurs dans un seul fichier manifeste.
ja: 単一のマニフェストの範囲内でエラーがないかどうかをチェックしています
ru: Проверки на ошибки в рамках одного манифеста.

source: Seeding reference manifest dictionaries.
de: Seeding von Referenzmanifest-Wörterbüchern.
es: Preparación de diccionarios de manifiestos de referencia.
fr: Création de dictionnaires de fichier manifeste de référence.
ja: 参照マニフェスト辞書を準備します。

source: Seeding lint manifest dictionaries.
de: Seeding von Lint-Manifestwörterbüchern.
es: Preparación de diccionarios de manifiestos lint.
fr: Création de dictionnaires de fichier manifeste Lint.
ja: lint マニフェスト辞書を準備します。

source: obsolete package {pkg} has {key} attribute
de: Veraltetes Package {pkg} enthält {key}-Attribut
es: el paquete obsoleto {pkg} contiene el atributo {key}
fr: le package obsolète {pkg} contient l'attribut {key}
ja: 廃止されたパッケージ {pkg} に {key} 属性があります

source: obsolete package {0} contains actions other than set or signature actions
de: Veraltetes Paket {0} enthält andere Aktionen als 'set' oder Signaturaktionen
es: el paquete obsoleto {0} contiene acciones que no son de configuración ni de firma
fr: le package obsolète {0} contient des actions autres que des actions définies ou de signature
ja: 廃止されたパッケージ {0} に、設定アクションまたは署名アクション以外のアクションが含まれています

source: Obsolete packages should have valid contents.
de: Veraltete Pakete müssen gültige Inhalte haben.
es: Los paquetes obsoletos deben tener contenido válido.
fr: Les packages obsolètes doivent inclure des contenus valides.
ja: 廃止されたパッケージには有効なコンテンツがあるべきです。

source: renamed package {0} contains actions other than set, depend or signature actions
de: Veraltetes Paket {0} enthält andere Aktionen als 'set', 'depend' oder Signaturaktionen
es: el paquete renombrado {0} contiene acciones que no son de configuración, dependencia ni firma
fr: le package renommé {0} contient des actions autres que des actions définies, de dépendance ou de signature
ja: 名前を変更したパッケージ {0} に、設定、依存、または署名アクション以外のアクションが含まれています

source: renamed package {0} does not declare a 'require' dependency indicating what it was renamed to
de: Umbenanntes Paket {0} deklariert keine 'require'-Abhängigkeit, die angibt, wie umbenannt wurde
es: el paquete renombrado {0} no declara una dependencia 'require' que indica que se renombró a
fr: le package renommé {0} ne déclare pas de dépendance 'require' indiquant en quoi il a été renommé.
ja: 名前変更されたパッケージ {0} は、名前変更後の名前を示す 'require' 依存関係を宣言していません

source: unable to follow renames for {0}: possible missing package
de: Umbenennungen können für {0} nicht verfolgt werden: möglicherweise fehlendes Paket
es: no se pueden seguir los cambios de nombre para {0}: es posible que falte el paquete
fr: impossible de suivre les nouveaux noms attribués pour {0} : des packages sont probablement manquants
ja: {0} の名前変更履歴を追跡できません: パッケージがない可能性があります

source: package {pkg} was renamed to an obsolete package {obs}
de: Package {pkg} wurde in ein veraltetes Package {obs} umbenannt
es: se renombró el paquete {pkg} con un paquete obsoleto {obs}
fr: le package {pkg} a été renommé en {obs} (package obsolète)
ja: パッケージ {pkg} の名前が廃止されたパッケージ {obs} に変更されました

source: package renaming: {0}
de: Packageumbenennung: {0}
es: cambio de nombre de paquete: {0}
fr: attribution de nouveaux noms aux packages : {0}
ja: パッケージの名前変更: {0}

source: Renamed packages should have valid contents.
de: Umbenannte Pakete müssen gültige Inhalte haben.
es: Los paquetes renombrados deben tener contenido válido.
fr: Le contenu des packages renommés doit être valide.
ja: 名前変更されたパッケージには有効なコンテンツがあるべきです。

source: variant(s) {vars} not defined by {pkg}
de: Varianten {vars} von {pkg} nicht definiert
es: variante(s) {vars} no definida(s) mediante {pkg}
fr: variante(s) {vars} non définie(s) par {pkg}
ja: バリアント {vars} は {pkg} で定義されていません

source: variant(s) {vars} not in list of known values for variants in {pkg}
de: Varianten {vars} nicht in Liste der bekannten Werte für Varianten in {pkg} enthalten
es: la(s) variante(s) {vars} no se encuentra(n) en la lista de valores conocidos para variantes en {pkg}
fr: variante(s) {vars} ne figurant pas dans la liste des valeurs connues des variantes de {pkg}
ja: バリアント {vars} は、{pkg} のバリアントに対する既知の値のリストに含まれていません

source: variant.arch not declared in {0}
de: variant.arch nicht deklariert in {0}
es: el valor variant.arch no está declarado en {0}
fr: variant.arch non déclarée dans {0}
ja: variant.arch は {0} で宣言されていません

source: Variants used by packages should be valid.
de: Von Paketen verwendete Varianten müssen gültig sein.
es: Las variantes utilizadas por los paquetes deben ser válidas.
fr: Les variantes utilisées par les packages doivent être valides.
ja: パッケージによって使用されるバリアントは、有効であるべきです。

source: last name component {name} in package name clashes across {pkgs}
de: Nachnamenkomponente {name} in Packagename ist in {pkgs} nicht kompatibel
es: el último componente de nombre {name} en el nombre del paquete causa conflicto en {pkgs}
fr: le composant {name} du nom de package présente un conflit avec {pkgs}
ja: パッケージ名の最後のコンポーネント {name} が {pkgs} にわたって衝突しています

source: Packages are encouraged to use unique leaf names.
de: Es wird empfohlen, in Verbindung mit Paketen eindeutige Blattnamen zu verwenden.
es: Se recomienda que los paquetes utilicen nombres de hoja únicos.
fr: Il est conseillé de nommer les packages à l'aide de noms de noeud terminal uniques.
ja: パッケージでは一意のリーフ名を使用することをお勧めします。

source: duplicate depend actions in {pkg} {actions}
de: Doppelte depend-Aktionen in {pkg} {actions}
es: acciones de dependencia duplicadas en {pkg} {actions}
fr: actions de dépendance de doublon dans {pkg} {actions}
ja: {pkg} の {actions} で依存アクションが重複しています

source: no fmri attribute in depend action in {0}
de: depend-Aktion in {0} enthält kein FMRI-Attribut
es: no hay ningún atributo de fmri en la acción de dependencia de {0}
fr: aucun attribut fmri dans l'action de dépendance dans {0}
ja: {0} の依存アクションに fmri 属性がありません

source: Packages should not have duplicate 'depend' actions.
de: Pakete dürfen keine duplizierten 'depend'-Aktionen aufweisen.
es: Los paquetes no deben tener acciones 'depend' duplicadas.
fr: Les packages ne doivent pas contenir d'actions 'depend' en doublon.
ja: パッケージには重複する 'depend' アクションは指定できません。

source: duplicate set actions on {names} in {pkg}
de: Doppelte set-Aktionen bei {names} in {pkg}
es: acciones de configuración duplicadas en {names} de {pkg}
fr: actions définies de doublon sur {names} dans {pkg}
ja: {pkg} の {names} の設定アクションが重複しています

source: Packages should not have duplicate 'set' actions.
de: Pakete dürfen keine duplizierten 'set'-Aktionen aufweisen.
es: Los paquetes no deben tener acciones 'set' duplicadas.
fr: Les packages ne doivent pas contenir d'actions 'set' en doublon.
ja: パッケージには重複する 'set' アクションは指定できません。

source: pkg.linted attributes detected for {pkg}: {linted}
de: pkg.linted-Attribute für {pkg} ermittelt: {linted}
es: atributos pkg.linted detectados para {pkg}: {linted}
fr: attributs pkg.linted détectés pour {pkg} : {linted}
ja: {pkg} に pkg.linted 属性が検出されました: {linted}

source: Show manifests with pkg.linted attributes.
de: Manifeste mit pkg.linted-Attributen anzeigen.
es: Mostrar manifiestos con atributos pkg.linted.
fr: Afficher les manifestes avec attributs pkg.linted.
ja: pkg.linted 属性を持つマニフェストを表示します。

source: Unable to perform manifest checks for info.classification attribute: {0}
de: Manifestprüfungen für info.classification-Attribute können nicht ausgeführt werden: {0}
es: No se pueden realizar comprobaciones de manifiesto para el atributo info.classification: {0}
fr: Impossible d'effectuer des vérifications de manifeste dans l'attribut info.classification : {0}
ja: info.classification 属性にマニフェストチェックを実行できません: {0}

source: info.classification attribute should be valid.
de: info.classification-Attribut muss gültig sein.
es: El atributo info.classification debe ser válido.
fr: L'attribut info.classification doit être valide.
ja: info.classification 属性は有効であるべきです。

source: info.classification attribute does not contain '{prefix}' for {fmri}
de: info.classification-Attribut enthält '{prefix}' für {fmri} nicht
es: El atributo info.classification no contiene '{prefix}' para {fmri}
fr: L'attribut info.classification ne contient pas'{prefix}' pour {fmri}
ja: info.classification 属性に {fmri} の '{prefix}' が含まれていません

source: info.classification value {value} does not match {prefix}<Section>/<Category> for {fmri}
de: info.classification-Wert {value} stimmt nicht mit {prefix}<Abschnitt>/<Kategorie> bei {fmri} überein
es: El valor de info.classification {value} no coincide con {prefix}<Sección>/<Categoría> para {fmri}
fr: La valeur info.classification {value} ne correspond pas à {prefix}<Section>/<Category> pour {fmri}
ja: info.classification 値 {value} は、{fmri} の {prefix}<セクション>/<カテゴリ> と一致しません

source: info.classification value {value} does not contain one of the valid sections {ref_sections} for {fmri}.
de: info.classification-Wert {value} enthält einen der gültigen Abschnitte {ref_sections} bei {fmri} nicht.
es: El valor de info.classification {value} no contiene una de las secciones válidas {ref_sections} para {fmri}.
fr: La valeur info.classification {value} ne contient pas l'une des sections valides {ref_sections} pour {fmri}.
ja: {fmri} の有効なセクション {ref_sections} のいずれかが info.classification 値 {value} に含まれていません。

source: Invalid info.classification value for {fmri}: data file {file} does not have a 'category' key for section {section}.
de: Ungültiger info.classification-Wert für {fmri}: Datendatei {file} enthält keinen 'category'-Schlüssel für Abschnitt {section}.
es: Valor de info.classification no válido para {fmri}: el archivo de datos {file} no tiene una clave 'category' para la sección {section}.
fr: Valeur de info.classification incorrecte pour {fmri} : le fichier de données {file} ne contient pas de clé 'category' pour la section {section}.
ja: {fmri} の無効な info.classification 値: データファイル {file} にセクション {section} の 'category' キーがありません。

source: info.classification attribute in {fmri} does not contain one of the values defined for the section {section}: {ref_cats} from {path}
de: info.classification-Attribut in {fmri} enthält einen der Werte nicht, die für den Abschnitt {section}: {ref_cats} aus {path} angegeben sind
es: El atributo info.classification en {fmri} no contiene uno de los valores definidos para la sección {section}: {ref_cats} de {path}
fr: L'attribut info.classification de {fmri} ne contient pas l'une des valeurs définies pour la section {section} : {ref_cats} à partir de {path}
ja: セクション {section} に定義されているいずれかの値が、{fmri} の info.classification 属性に含まれていません: {path} の {ref_cats}

source: Empty pkg.description in {0}
de: Leere pkg.description in {0}
es: pkg.description vacía en {0}
fr: pkg.description vide dans {0}
ja: {0} の pkg.description が空です

source: Empty pkg.summary in {0}
de: Leere pkg.summary in {0}
es: pkg.summary vacío en {0}
fr: pkg.summary vide dans {0}
ja: {0} の pkg.summary が空です

source: pkg.description matches pkg.summary in {0}
de: pkg.description entspricht pkg.summary in {0}
es: pkg.description coincide con pkg.summary en {0}
fr: pkg.description correspond à pkg.summary dans {0}
ja: {0} の pkg.description と pkg.summary が同じ内容です

source: A package's description should not match its summary.
de: Die Beschreibung eines Pakets darf nicht mit der Zusammenfassung übereinstimmen.
es: La descripción de un paquete no debe coincidir con su resumen.
fr: La description d'un package ne doit pas être identique à son résumé.
ja: パッケージの説明はサマリーと同じ内容にしないでください。

source: Missing attribute 'pkg.summary' in {0}
de: Fehlendes Attribut 'pkg.summary' in {0}
es: Falta el atributo 'pkg.summary' en {0}
fr: Attribut 'pkg.summary' manquant dans {0}
ja: {0} に属性 'pkg.summary' がありません

source: SMF manifests were delivered by {pkg}, but no org.opensolaris.smf.fmri attribute was found. Manifests found were: {manifests}
de: SMF-Manifeste wurden von {pkg} bereitgestellt, aber es wurde kein org.opensolaris.smf.fmri-Attribut gefunden. Gefundene Manifeste: {manifests}
es: Los manifiestos SMF fueron entregados por {pkg}, pero no se encontró ningún atributo org.opensolaris.smf.fmri. Manifiestos encontrados: {manifests}
fr: {pkg} a fourni des manifestes SMF, mais aucun attribut org.opensolaris.smf.fmri n'a été trouvé. Manifestes trouvés : {manifests}
ja: SMF マニフェストが {pkg} によってもたらされましたが、org.opensolaris.smf.fmri 属性が見つかりませんでした。見つかったマニフェストは {manifests} でした

source: Packages delivering SMF services should have org.opensolaris.smf.fmri attributes.
de: Packages, die SMF-Services bereitstellen, müssen org.opensolaris.smf.fmri-Attribute aufweisen.
es: Los paquetes que entregan servicios SMF deben tener atributos org.opensolaris.smf.fmri.
fr: Des packages fournissant des services SMF doivent posséder des attributs org.opensolaris.smf.fmri.
ja: SMF サービスをもたらすパッケージには org.opensolaris.smf.fmri 属性を含めるようにしてください。

source: {fp} contains an action which is missing the expected attribute: {at}. The action is:{act}
de: {fp} enthält eine Aktion, in der das erwartete Attribut {at} fehlt. Die Aktion ist: {act}
es: {fp} contiene una acción que carece del atributo esperado: {at}. La acción es:{act}
fr: {fp} contient une action à laquelle manque l'attribut attendu : {at}. L'action est :{act}
ja: {fp} は、必要な属性 {at} が不足しているアクションを含んでいます。 アクションは {act} です

source: Attribute value '{0}' not 'true' or 'false'
de: Attributwert '{0}' nicht 'true' oder 'false'
es: El valor del atributo '{0}' no es ni 'true' ni 'false'
fr: La valeur de l'attribut '{0}' n'est pas 'true' ou 'false'
ja: 属性の値 '{0}' は 'true' または 'false' ではありません
