Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Some repository content for publisher '{0}' or paths leading to the repository were not world-readable or were not readable by 'pkg5srv:pkg5srv', which can cause access errors if the repository contents are served by the following services: svc:/application/pkg/server svc:/application/pkg/system-repository. Only the first path found with restrictive permissions is shown.
de: Einige Repository-Inhalte für Herausgeber '{0}' oder Pfade zum Repository waren nicht global lesbar oder konnten nicht von 'pkg5srv:pkg5srv' gelesen werden. Dies kann zu Zugriffsfehlern führen, wenn die Repository-Inhalte von den folgenden Services bearbeitet werden: svc:/application/pkg/server svc:/application/pkg/system-repository. Nur der erste gefundene Pfad mit restriktiven Berechtigungen wird angezeigt.
es: Una parte del contenido del repositorio para el editor '{0}' o de las rutas del repositorio no contaban con permisos de lectura para todos o para 'pkg5srv:pkg5srv', lo que puede ocasionar errores de acceso si los contenidos del repositorio se proporcionan mediante los siguientes servicios: svc:/application/pkg/server svc:/application/pkg/system-repository. Sólo se muestra la primera ruta encontrada con el permiso restrictivo.
fr: Une partie du contenu du référentiel de l'éditeur '{0}' ou des chemins d'accès au référentiel n'étaient pas lisibles par tous ou n'étaient pas lisibles par 'pkg5srv:pkg5srv'. Des erreurs d'accès peuvent en résulter si le contenu du référentiel est fourni par les services suivants : svc:/application/pkg/server svc:/application/pkg/system-repository. N'est affiché que le premier chemin trouvé présentant des autorisations restrictives.
ja: パブリッシャー '{0}' の一部のリポジトリ内容またはそのリポジトリにつながるパスは、だれでも読み取り可能でなかったり、'pkg5srv:pkg5srv' によって読み取り可能でなかったりしました。このため、それらのリポジトリ内容が次のサービスによって処理されると、アクセスエラーが発生する可能性があります: svc:/application/pkg/server svc:/application/pkg/system-repository。 制限されたアクセス権で最初に見つかったパスのみが表示されます。

source: Permission denied.
de: Zugriff abgelehnt.
es: Permiso denegado.
fr: Autorisation refusée.
ja: アクセス権は拒否されました。

source: Missing file {0} must be fixed by republishing the package.
de: Die fehlende Datei {0} muss durch eine erneute Veröffentlichung des Packages korrigiert werden.
es: Debe volver a publicarse el paquete para corregir el archivo faltante {0}.
fr: Il faut corriger l'absence du fichier {0} en procédant à une nouvelle publication du package.
ja: パッケージを再発行することによって、欠落しているファイル {0} を修正する必要があります。

source: Moving {src} to {dest}
de: {src} wird in {dest} verschoben
es: Moviendo {src} a {dest}
fr: Déplacement de {src} vers {dest}
ja: {src} を {dest} に移動しています

source: Unable to quarantine {path}: {err}
de: {path} kann nicht unter Quarantäne gestellt werden: {err}
es: No se pudo poner en cuarentena {path}: {err}
fr: Impossible de mettre en quarantaine {path} : {err}
ja: {path} を隔離できません: {err}

source: Illegal dependency FMRI.
de: Unzulässige Abhängigkeits-FMRI.
es: FMRI de dependencia no permitida.
fr: FMRI de dépendance non autorisé.
ja: 不正な依存関係の FMRI。

source: Missing dependency.
de: Fehlende Abhängigkeit.
es: Falta la dependencia.
fr: Dépendance manquante.
ja: 見つからない依存関係。

source: Unrecognized or malformed data in operation payload: '{0}'.
de: Nicht erkannte oder fehlerhafte Daten in Vorgang: '{0}'.
es: Datos no reconocidos o incorrectos en la carga de operaciones: '{0}'.
fr: Données non reconnues ou erronées dans la charge utile d'opération : '{0}'.
ja: オペレーションのペイロードに認識できないデータ、または不正な形式のデータ '{0}' があります。

source: The specified client_release is invalid: '{0}'
de: Die angegebene client_release ist ungültig: '{0}'
es: El valor client_release no es válido: '{0}'
fr: L'option client_release spécifiée n'est pas valide : '{0}'
ja: 指定された client_release は無効です: '{0}'

source: 'The specified FMRI, '{0}', has an invalid version.
de: 'Der angegebene FMRI, '{0}', weist eine ungültige Version auf.
es: La versión del FMRI especificado, '{0}', no es válida.
fr: Le FMRI spécifié, '{0}', dispose d'une version non valide.
ja: 指定された FMRI '{0}' は無効なバージョンです。

source: The specified FMRI, '{0}', already exists or has been restricted.
de: Der angegebene FMRI, '{0}', ist bereits vorhanden oder wurde eingeschränkt.
es: El FMRI especificado, '{0}', ya existe o se ha restringido.
fr: Le FMRI spécifié, '{0}', existe déjà ou est sous le coup de restrictions.
ja: 指定された FMRI '{0}' はすでに存在するか、制限されています。

source: The specified FMRI, '{0}', must include the publisher prefix as the repository contains package data for more than one publisher or a default publisher has not been defined.
de: Der angegebene FMRI, '{0}', muss das Herausgeberpräfix enthalten, da das Repository Paketdaten für mehr als einen Herausgeber enthält oder kein Standardherausgeber definiert wurde.
es: El FMRI especificado, '{0}', debe incluir el prefijo del editor dado que el repositorio contiene datos de paquete de varios editores o no se ha definido un editor predeterminado.
fr: Le FMRI spécifié, '{0}', doit inclure le préfixe de l'éditeur puisque le référentiel contient les données de package pour plusieurs éditeurs ou aucun éditeur par défaut n'a été défini.
ja: そのリポジトリには複数のパブリッシャーのパッケージデータがあるか、デフォルトのパブリッシャーを定義していないため、指定された FMRI '{0}' にはパブリッシャーの接頭辞を含む必要があります。

source: Need an existing instance of {0} to exist to append to it
de: Zum Anhängen muss eine Instanz von {0} vorhanden sein
es: Debe existir una instancia de {0} para anexar a ella
fr: Une instance de {0} doit déjà exister pour effectuer l'ajout
ja: 付加するための {0} の既存インスタンスが必要です

source: Only a signature can be appended to an existing package
de: Nur eine Signatur kann an ein vorhandenes Paket angehängt werden
es: Sólo se puede anexar una firma a un paquete existente
fr: Seule une signature peut être ajoutée à un package existant
ja: 既存のパッケージに付加できるのは署名だけです
ru: В существующий пакет можно добавить только подпись

source: The specified FMRI, '{0}', is invalid.
de: Der angegebene FMRI, '{0}', ist ungültig.
es: El FMRI especificado, '{0}', no es válido.
fr: Le FMRI spécifié, '{0}', n'est pas valide.
ja: 指定された FMRI '{0}' は無効です。

source: No Transaction matching ID '{0}' could be found.
de: Es konnte keine Transaktion mit ID '{0}' gefunden werden.
es: No se ha podido encontrar ningún ID de transacción que coincida con '{0}'.
fr: Aucune transaction correspondant à l'ID '{0}' n'a pu être trouvée.
ja: ID '{0}' と一致するトランザクションが見つかりませんでした。

source: Transaction ID '{0}' is already open.
de: Transaktions-ID '{0}' ist bereits geöffnet.
es: ID Transacción '{0}' ya está abierto.
fr: L'ID de transaction '{0}' est déjà ouvert.
ja: トランザクション ID '{0}' はすでに開いています。

source: An obsolete package cannot contain actions other than 'set' and 'signature'.
de: Ein veraltetes Paket kann keine anderen Aktionen als 'set' und 'signature' enthalten.
es: Un paquete obsoleto no puede contener acciones distintas de 'set' y 'signature'.
fr: Un package obsolète ne peut pas contenir d'actions autres que 'set' et 'signature".
ja: 廃止されたパッケージには 'set' と 'signature' 以外のアクションを含めることができません。

source: A renamed package cannot contain actions other than 'set', 'depend', and 'signature'.
de: Ein umbenanntes Paket kann keine anderen Aktionen als 'set', 'depend' und 'signature' enthalten.
es: Un paquete renombrado no puede contener acciones distintas de 'set', 'depend' y 'signature'.
fr: Un package renommé ne peut pas contenir d'actions autres que 'set', 'depend' et 'signature'.
ja: 名前が変更されたパッケージには、'set'、'depend'、および 'signature' 以外のアクションを含めることができません。

source: A package may not be marked for both obsoletion and renaming.
ca: Un paquet no pot ser marcat tant per eliminació com per a reanomenament.
de: Ein Paket darf nicht gleichzeitig für eine Ausweisung als veraltet und eine Umbenennung markiert werden.
es: Un paquete no se puede marcar al mismo tiempo como obsoleto y renombrado.
fr: Un package ne peut pas être marqué pour obsolescence et modification du nom.
ja: パッケージは、廃止と名前変更の両方をマークすることはできない場合があります。
ru: Пакет не может быть одновременно помечен как устаревший и переименованный.

source: A '{type}' action cannot be present in an obsolete package: {action}
de: Eine {type}-Aktion darf in einem veralteten Package nicht vorhanden sein: {action}
es: Una acción '{type}' no puede estar presente en un paquete obsoleto: {action}
fr: Une action '{type}' ne peut pas se trouver dans un package obsolète : {action}
ja: '{type}' アクションは廃止パッケージには使用できません: {action}

source: A '{type}' action cannot be present in a renamed package: {action}
de: Eine '{type}'-Aktion darf in einem umbenannten Package nicht vorhanden sein: {action}
es: Una acción '{type}' no puede estar presente en un paquete renombrado: {action}
fr: Une action '{type}' ne peut pas se trouver dans un package renommé : {action}
ja: '{type}' アクションは名前を変更したパッケージには使用できません: {action}

source: A renamed package must contain at least one 'depend' action.
ca: Un paquet reanomenat ha de contenir com a mínim una acció 'depend'.
de: Ein umbenanntes Paket muss mindestens eine 'depend'-Aktion enthalten.
es: Un paquete renombrado debe contener al menos una acción 'depend'.
fr: Un package renommé doit contenir au moins une action 'depend'.
ja: 名前を変更したパッケージには、'depend' アクションを 1 つ以上含む必要があります。
ru: Переименованный пакет должен включать в себя минимум одно действие 'depend'.

source: At least one certificate has not been delivered for the signature action.
de: Mindestens ein Zertifikat wurde nicht von der Signaturaktion bereitgestellt.
es: Por lo menos un certificado no se ha entregado para la acción de firma.
fr: Au moins un certificat n'a pas été distribué pour l'action de signature.
ja: 少なくとも 1 つの証明書が署名アクションにもたらされていません。
ru: Для действия подписи не предоставлен по крайней мере один сертификат.

source: FMRI pattern might implicitly match more than one service instance.
de: FMRI-Muster entspricht eventuell implizit mehreren Serviceinstanzen.
es: El patrón FMRI puede coincidir de forma implícita con más de una instancia de servicio.
fr: La forme du FMRI risque de correspondre implicitement à plusieurs instances de service.
ja: FMRI パターンは暗黙的に複数のサービスインスタンスに一致する場合があります。
ru: Шаблон FMRI может косвенно соответствовать нескольким экземплярам службы.

source: Actuators for {attr} will not be run for {fmri}.
de: Aktuatoren für {attr} werden für {fmri} nicht ausgeführt.
es: Los activadores de {attr} no se ejecutarán para {fmri}.
fr: Les actionneurs de {attr}s ne sont pas exécutés pour {fmri}.
ja: {attr} のアクチュエータは {fmri} に対しては実行されません。

source: To continue, the target image must be upgraded before it can be used. See pkg(1) update-format for more information.
de: Das Zielabbild muss aktualisiert werden, um es verwenden zu können und fortzufahren. Weitere Informationen finden Sie unter pkg(1) update-format.
es: Para continuar, debe actualizar la imagen de destino antes de utilizarla. Consulte pkg(1) update-format para obtener más información.
fr: Pour continuer, l'image cible doit être mise à niveau avant de pouvoir être utilisée. Voir format de mise à jour pkg(1) pour plus d'informations.
ja: 続行するには、ターゲットイメージを使用する前にアップグレードする必要があります。詳細は、pkg(1) update-format を参照してください。

source: Usage: pkgdepend [options] command [cmd_options] [operands] Subcommands: pkgdepend generate [-IMm] -d dir [-d dir] [-D name=value] [-k path] manifest_file pkgdepend resolve [-EmoSv] [-d output_dir] [-e external_package_file]... [-s suffix] manifest_file ... Options: -R dir --help or -? Environment: PKG_IMAGE
de: Verwendung: pkgdepend [options] command [cmd_options] [operands] Unterbefehle: pkgdepend generate [-IMm] -d dir [-d dir] [-D name=value] [-k path] manifest_file pkgdepend resolve [-EmoSv] [-d output_dir] [-e external_package_file]... [-s suffix] manifest_file ... Optionen: -R dir --help oder -? Umgebung: PKG_IMAGE
es: Sintaxis: pkgdepend [options] command [cmd_options] [operands] Subcommands: pkgdepend generate [-IMm] -d dir [-d dir] [-D name=value] [-k path] manifest_file pkgdepend resolve [-EmoSv] [-d output_dir] [-e external_package_file]... [-s suffix] manifest_file ... Opciones: -R dir --help or -? Entorno: PKG_IMAGE
fr: Syntaxe : pkgdepend [options] command [cmd_options] [operands] Sous-commandes : pkgdepend generate [-IMm] -d dir [-d dir] [-D name=value] [-k path] manifest_file pkgdepend resolve [-EmoSv] [-d output_dir] [-e external_package_file]... [-s suffix] manifest_file ... Options : -R dir --help ou -? Environnement : PKG_IMAGE
ja: 使用方法: pkgdepend [options] command [cmd_options] [operands] サブコマンド: pkgdepend generate [-IMm] -d dir [-d dir] [-D name=value] [-k path] manifest_file pkgdepend resolve [-EmoSv] [-d output_dir] [-e external_package_file]... [-s suffix] manifest_file ... オプション: -R dir --help または -? 環境: PKG_IMAGE

source: The proto directory {0} could not be found.
de: Proto-Verzeichnis {0} nicht gefunden.
es: No se pudo encontrar el directorio proto {0}.
fr: Répertoire de protocole '{0}' introuvable.
ja: プロトディレクトリ {0} が見つかりませんでした。

source: -D arguments must be of the form 'name=value'.
ca: -D arguments ha de ser de la forma 'nom=valor'.
de: -D-Argumente müssen die Form 'Name=Wert' haben.
es: los argumentos -D deben tener el formato '<nombre>=<valor>'.
fr: Les arguments -D doivent adopter le format 'name=value'.
ja: 引数 -D は 'name=value' の形式になっている必要があります。
ru: Аргументы параметра -D должны иметь форму 'имя=значение'.

source: Generate only accepts one or two arguments.
de: 'Generate' akzeptiert nur ein oder zwei Argumente.
es: Generate sólo acepta uno o dos argumentos.
fr: N'accepte qu'un ou deux arguments.
ja: generate は 1 つまたは 2 つの引数だけを受け入れます。
ru: Команда создания принимает только один или два аргумента.

source: ORIGIN may not be specified using -D. It will be inferred from the install paths of the files.
ca: L'ORIGEN no pot estar especificat mitjançant -D. Entrarà amb conflicte amb les rutes d'instal·lació dels fitxers.
de: ORIGIN kann nicht mit -D angegeben werden. Er wird durch die Installationspfade der Dateien definiert.
es: No se puede especificar ORIGIN mediante -D. Se debe inferir desde las rutas de instalación de los archivos.
fr: L'option ORIGIN n'est peut-être pas indiquée par la commande -D. Elle est déduite des chemins d'installation des fichiers.
ja: ORIGIN は -D を使用して指定しなくても構いません。 それはファイルのインストールパスから推測されます。
ru: При использовании параметра -D значение ORIGIN можно не указывать. Оно будет получено на основе установочных путей файлов.

source: The manifest file {0} could not be found.
de: Manifest-Datei {0} nicht gefunden.
es: No se pudo encontrar el archivo de manifiesto {0}.
fr: Fichier manifeste '{0}' introuvable.
ja: マニフェストファイル {0} が見つかりませんでした。

source: At least one proto directory must be provided.
de: Mindestens ein Proto-Verzeichnis muss angegeben werden.
es: Por lo menos debe proporcionarse un directorio proto.
fr: Au moins un répertoire proto doit être fourni.
ja: 少なくとも 1 つのプロトディレクトリを指定する必要があります。
ru: Необходимо предоставить минимум один каталог proto.

source: Could not parse manifest {manifest} because of the following line: {line}
de: Manifest {manifest} konnte wegen der folgenden Zeile nicht geparst werden: {line}
es: No se pudo analizar el manifiesto {manifest} debido a la siguiente línea: {line}
fr: Impossible d'analyser le manifeste {manifest} en raison de la ligne suivante : {line}
ja: 次の行が原因で、マニフェスト {manifest} の構文解析ができませんでした: {line}

source: -o cannot be used with -d or -s
ca: -o no pot utilitzar-se amb -d o -s
de: -o kann nicht in Verbindung mit -d oder -s verwendet werden
es: -o no se puede utilizar con -d o -s
fr: -o ne peut être utilisé avec -d ou -s
ja: -o は -d または -s と同時に使用できません
ru: -o невозможно использовать с параметрами -d или -s

source: The output directory {0} is not a directory.
de: Das Ausgabeverzeichnis {0} ist kein Verzeichnis.
es: El directorio de salida {0} no es un directorio.
fr: Le répertoire de sortie {0} n'est pas un répertoire.
ja: 出力先ディレクトリ {0} はディレクトリではありません。

source: External package list files were provided but did not contain any fmri patterns.
de: Externe Paketlistendateien wurden zur Verfügung gestellt, aber enthielten keine FMRI-Muster.
es: Se proporcionaron los archivos de lista de paquete externo, pero éstos no contienen patrones FMRI.
fr: Des fichiers de listes de packages externes ont été fournis mais ne contenaient aucun modèle FMRI.
ja: 外部パッケージリストファイルが提供されましたが、これらのファイルには FMRI パターンが 1 つも含まれていませんでした。

source: Could not parse one or more manifests because of the following line: {0}
de: Analyse mindestens eines Manifests aufgrund folgender Zeile nicht möglich: {0}
es: No se pudieron analizar uno o varios manifiestos debido a la siguiente línea: {0}
fr: Impossible d'analyser un ou plusieurs manifestes en raison de la ligne suivante : {0}
ja: 次の行が原因で、1 つ以上のマニフェストの構文解析ができませんでした: {0}

source: The following fmris matched a pattern in a constraint file but were not used in dependency resolution:
de: Die folgenden FMRI passten zu dem Muster einer Constraint-Datei, aber wurden nicht bei der Abhängigkeitsauflösung verwendet:
es: Los siguientes FMRI coincidieron con un patrón en un archivo de restricción, pero no se utilizaron en la resolución de dependencias:
fr: Les FMRI suivants correspondaient à un modèle dans un fichier de contrainte mais n'ont pas été utilisés pour la résolution des dépendances :
ja: 次の FMRI は制約ファイル内のパターンに一致しましたが、依存関係を解決するときに 使用されませんでした:

source: The following fmris had dependencies resolve to them:
de: Für die folgenden FMRI wurden Abhängigkeiten aufgelöst:
es: Los siguientes FMRI tenían dependencias resueltas para ellos:
fr: Les FMRI suivants avaient des dépendances renvoyant à eux-mêmes :
ja: 次の FMRI は、自分自身に解決される依存性を持っていました:

source: Could not open {0} to echo manifest
de: {0} konnte für Echo von Manifest nicht geöffnet werden
es: No se pudo abrir {0} para el manifiesto de eco
fr: Impossible d'ouvrir {0} pour faire écho au manifeste
ja: マニフェストを表示するために {0} を開けませんでした

source: Could not open output file {0} for writing
de: Ausgabedatei {0} konnte für Schreibvorgang nicht geöffnet werden
es: No se pudo abrir el archivo de salida {0} para escritura
fr: Impossible d'ouvrir le fichier de sortie {0} pour écrire
ja: 出力ファイル {0} を書き込みのために開くことができませんでした

source: Out dir {out_dir} does not exist and could not be created. Error is: {err}
de: Ausgabeverzeichnis {out_dir} ist nicht vorhanden und konnte nicht erstellt werden. Fehler: {err}
es: El directorio de salida {out_dir} no existe y no se pudo crear. Error: {err}
fr: Le répertoire de sortie {out_dir} n'existe pas et n'a pas pu être créé. Erreur : {err}
ja: 出力先のディレクトリ {out_dir} が存在せず、作成もできませんでした。エラーは次のとおりです: {err}

source: generate subcommand doesn't use -R
ca: la sub-comanda generate no utilitza -R
de: Generierung von Unterbefehl verwendet nicht -R
es: el subcomando generate no utiliza -R
fr: la sous-commande generate n'utilise pas -R
ja: generate サブコマンドは -R を使用しません
ru: при создании субкоманды не используется параметр -R

source: The {cmd} command appears out of sync with the libraries provided by pkg:/package/pkg. The client version is {client} while the library API version is {api}
de: Der {cmd}-Befehl stimmt nicht mit den von pkg:/package/pkg angegebenen Bibliotheken überein. Die Clientversion ist {client} und die Bibliotheks- API-Version ist {api}
es: El comando {cmd} aparece desincronizado con las bibliotecas proporcionadas por pkg:/package/pkg. La versión de cliente es {client} y la versión de la API de biblioteca es {api}
fr: La commande {cmd} n'est pas synchronisée avec les bibliothèques fournies par pkg :/package/pkg. La version client est {client}, tandis que la version de l'API de la bibliothèque est {api}.
ja: {cmd} コマンドは、pkg:/package/pkg で提供されているライブラリと同期が取れていない ようです。クライアントのバージョンが {client} であるのに対して、ライブラリ API のバージョンは {api} です

source: Try `pkgrepo --help or -?' for more information.
de: Geben Sie 'pkgrepo --help' bzw. '-?' ein, um weitere Informationen zu erhalten.
es: Utilice 'pkgrepo --help or -?' para más información.
fr: Pour obtenir de plus amples informations, essayez `pkgrepo --help ou -?'.
ja: 詳細は、pkgrepo --help または -? を参照してください。
ru: Для получения дополнительных сведений выполните команду `pkgrepo --help or -?'.
