Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: {0}: facets must to be of the form 'facet....=[True|False|None]'.
de: {0}: Facetten müssen das folgende Format aufweisen: 'facet....=[True|False|None]'
es: {0}: las facetas deben tener el formato 'faceta....=[True|False|None]'.
fr: {0} : les facettes doivent adopter le format 'facet....=[True|False|None]'.
ja: {0}: ファセットは 'facet....=[True|False|None]' の形式になっている必要があります。

source: To indicate that you agree to and accept the terms of the licenses of the packages listed above, use the --accept option. To display all of the related licenses, use the --licenses option.
de: Um anzugeben, dass Sie die Lizenzbedingungen der oben aufgeführten Pakete anerkennen, verwenden Sie die Option --accept. Verwenden Sie zum Anzeigen aller zugehörigen Lizenzen die Option --licenses.
es: Para indicar que acepta las condiciones de las licencias de los paquetes anteriormente indicados, utilice la opción --accept. Para mostrar todas las licencias relacionadas, utilice la opción --licenses.
fr: Pour indiquer votre acceptation des conditions des licences des packages répertoriés ci-dessus, utilisez l'option --accept. Pour afficher l'ensemble des licences liées, utilisez l'option --licenses.
ja: 上に表示されているパッケージのライセンス契約書の条項に同意し受諾することを示すには、「--accept」オプションを使用します。全ての関連ライセンスを表示するには、「--licenses」オプションを使用します。

source: To add a publisher using this repository, execute the following command as a privileged user: pkg set-publisher -g {0} <publisher>
de: Um einen Herausgeber mit diesem Repository hinzuzufügen, führen Sie folgenden Befehl als privilegierter Benutzer aus: pkg set-publisher -g {0} <publisher>
es: Para agregar un editor mediante este repositorio, ejecute el comando siguiente como usuario con privilegios: pkg set-publisher -g {0} <publisher>
fr: Pour ajouter un éditeur à l'aide de ce référentiel, exécutez la commande suivante en tant qu' utilisateur privilégié : pkg set-publisher -g {0} <publisher>
ja: このリポジトリを使用してパブリッシャーを追加するには、 特権ユーザーとして次のコマンドを実行します: pkg set-publisher -g {0} <publisher>

source: at least one file path or tag name required
de: Mindestens ein Dateipfad oder Tagname erforderlich
es: se necesita al menos una ruta de archivo o un nombre de etiqueta
fr: au moins un chemin de fichier ou un nom de balise est requis
ja: ファイルパスまたはタグ名を少なくとも 1 つ指定する必要があります

source: WARNING: pkg mediators may not be accurately shown when one or more publishers have been dehydrated. The correct mediation will be applied when the publishers are rehydrated.
de: WARNUNG: Packagevermittler werden möglicherweise nicht akkurat dargestellt, wenn einer oder mehrere der Publisher dehydriert wurden. Die korrekte Vermittlung wird angewendet, wenn die Publisher erneut hydriert werden.
es: ADVERTENCIA: Los mediadores pkg pueden no mostrarse con exactitud cuando uno o varios editores se han deshidratado. La mediación correcta se aplicará cuando los editores se hayan rehidratado.
fr: AVERTISSEMENT : les médiateurs pkg risquent de ne pas s'afficher correctement lorsqu'un ou plusieurs éditeurs ont été mis en attente. La médiation appropriée sera appliquée une fois les éditeurs réactivés.
ja: 警告: 1 つ以上のパブリッシャーがデハイドレートされた場合は、pkg メディエータが正確に示されない可能性があります。パブリッシャーがリハイドレートされると、正しいメディエーションが適用されます。

source: no matching mediators found
de: Keine entsprechenden Vermittler gefunden
es: no se encontró ningún mediador que coincida
fr: aucun médiateur correspondant n'a été trouvé
ja: 一致するメディエータが見つかりません

source: at least one mediator must be specified
de: Es muss mindestens ein Vermittler angegeben werden
es: se debe especificar al menos un mediador
fr: au moins un médiateur doit être spécifié
ja: メディエータが少なくとも 1 つ指定されている必要があります

source: a mediator version and/or implementation must be specified using -V and -I
de: Eine Vermittlerversion und/oder Implementierung muss mit-V und -I angegeben werden
es: se debe especificar una versión y/o implementación de mediador utilizando -V y -I
fr: une version et/ou implémentation de médiateur doit être spécifié à l'aide de -V et -I
ja: メディエータのバージョンまたは実装、あるいはその両方を -V と -I を使用して指定する必要があります。

source: No changes required.
de: Keine Änderungen erforderlich.
es: No se requieren cambios.
fr: Aucune modification requise.
ja: 変更は必要ありません。

source: {avoid_pkg} (group dependency of '{tracking_pkg}')
de: {avoid_pkg} (Gruppenabhängigkeit von '{tracking_pkg}')
es: {avoid_pkg} (dependencia de grupos de '{tracking_pkg}')
fr: {avoid_pkg} (dépendance de groupe de '{tracking_pkg}')
ja: {avoid_pkg} ('{tracking_pkg}' のグループ依存関係)

source: At least one package to freeze must be given when -c is used.
de: Für den Freeze muss mindestens ein Paket angegeben werden, wenn -c verwendet wird.
es: Cuando se utiliza -c, se debe proporcionar al menos un paquete para bloquear.
fr: Au moins un package à figer doit être spécifié lorsque -c est utilisé.
ja: -c を使用した場合は、凍結するパッケージを少なくとも 1 つ指定する必要があります。

source: -H may only be specified when listing the currently frozen packages.
de: -H darf nur bei Auflistung der derzeit eingefrorenen Pakete angegeben werden.
es: Sólo se puede especificar -H cuando se muestran los paquetes bloqueados actualmente.
fr: -H peut uniquement être spécifié lors de la création de la liste des packages actuellement figés.
ja: -H は、現在凍結されているパッケージを一覧表示する場合にのみ指定できます。

source: {name} was frozen at {ver}
de: {name} wurde bei {ver} eingefroren
es: {name} se congeló en {ver}
fr: {name} a été figé à la version {ver}
ja: {name} は {ver} で凍結されました

source: {0} was unfrozen.
de: {0} wurde freigegeben.
es: {0} se descongeló.
fr: {0} a été libéré.
ja: {0} は凍結解除されました。

source: NAME
fr: NOM
ja: 名前

source: DATE
ja: 日付

source: COMMENT
fr: COMMENTAIRE
ja: コメント

source: The repository returned a malformed result. The problematic structure:{0!r}
de: Das Repository hat ein fehlerhaftes Ergebnis zurückgegeben. Fehlerhafte Struktur:{0!r}
es: El repositorio ha devuelto un resultado incorrecto. Estructura problemática:{0!r}
fr: Le référentiel a renvoyé un résultat non conforme. Structure problématique :{0!r}
ja: リポジトリが不正な形式の結果を返しました。 問題のある構造:{0!r}

source: The repository returned an invalid or unsupported action. {0}
de: Das Repository hat eine ungültige oder nicht unterstützte Aktion zurückgegeben. {0}
es: El repositorio ha devuelto una acción no válida o no admitida. {0}
fr: Le référentiel a renvoyé une action non valide ou non prise en charge. {0}
ja: リポジトリが無効なアクションまたはサポートされていないアクションを返しました。 {0}

source: at least one search term must be provided
ca: com a mínim s'ha de proporcionar un tema de cerca
de: Mindestens ein Suchbegriff muss angegeben werden
es: se debe proporcionar al menos un término de búsqueda
fr: au moins un terme de recherche doit être spécifié
ja: 検索語句が少なくとも 1 つ指定されている必要があります
ru: необходимо ввести минимум одно искомое понятие

source: action level options ('{0}') to -o cannot be used with the -p option
de: Aktionsebenenoptionen ('{0}') mit -o können nicht in Verbindung mit der Option -p verwendet werden
es: las opciones de nivel de acción ('{0}') para -o no se pueden utilizar con la opción -p
fr: les options de niveau d'action ('{0}') jusqu'à -o ne peuvent être utilisées avec l'option -p
ja: -o のアクションレベルのオプション ('{0}') と -p オプションは同時に使用できません

source: The repository returned a malformed result:{0!r}
de: Das Repository hat ein fehlerhaftes Ergebnis zurückgegeben: {0!r}
es: El repositorio ha devuelto un resultado incorrecto:{0!r}
fr: Le référentiel a renvoyé un résultat non conforme :{0!r}
ja: リポジトリが不正な形式の結果を返しました:{0!r}

source: action level options to -o cannot be used with the queries that return packages
ca: les opcions a nivell d'acció -o no poden ser utilitzades amb consultes que retornin paquets
de: Aktionsebenenoptionen mit -o können nicht in Verbindung mit Abfragen, die Pakete zurückgeben,verwendet werden
es: las opciones de nivel de acción para -o no se pueden utilizar con las consultas que devuelven paquetes
fr: les options de niveau d'action jusqu'à -o ne peuvent être utilisées avec des requêtes qui renvoient des packages
ja: -o のアクションレベルのオプションとパッケージを返すクエリーは同時に使用できません
ru: параметры уровня действия для -o нельзя использовать с запросами, возвращающими пакеты

source: The search index appears corrupted. Please rebuild the index with 'pkg rebuild-index'.
ca: L'índex de cerca està corrupte. Si us plau torneu a construir l'índex amb 'pkg rebuild-index'.
de: Der Suchindex ist beschädigt. Erstellen Sie den Index mit dem Befehl 'pkg rebuild-index' neu.
es: El índice de búsqueda parece dañado. Vuelva a generar el índice con 'pkg rebuild-index'.
fr: L'index de recherche semble corrompu. Reconstruisez l'index à l'aide de la commande 'pkg rebuild-index'.
ja: 検索インデックスが壊れているようです。'pkg rebuild-index' でインデックスを再構築してください。
ru: Индекс поиска представляется поврежденным. Выполните перестроение индекса с помощью команды 'pkg rebuild-index'.

source: Invalid attribute '{0}'
de: Ungültiges Attribut '{0}'
es: Atributo no válido '{0}'
fr: Attribut non valide '{0}'
ja: 無効な属性 '{0}'

source: -a takes an argument of the form <attribute>=<pattern>
de: -a erfordert ein Argument in der Form <Attribut>=<Muster>
es: -a acepta un argumento con el formato <attribute>=<pattern>
fr: -a utilise un argument au format <attribut>=<forme>
ja: -a は <attribute>=<pattern> という形式の引数を取ります
ru: -a принимает аргумент формы <attribute>=<pattern>

source: contents: must request remote contents for specific packages
ca: continguts: heu de sol·licitar continguts remots per a un paquet específic
de: contents: Remote-Inhalte müssen für spezifische Pakete angefordert werden
es: contents: debe solicitar contenido remoto para paquetes específicos
fr: contents : doit demander du contenu distant pour des packages spécifiques
ja: contents: 特定のパッケージではリモートの内容を要求する必要があります
ru: contents: для определенных пакетов необходимо запрашивать содержание удаленно

source: -m and {0} may not be specified at the same time
de: -m und {0} dürfen nicht gleichzeitig angegeben werden
es: Es posible que -m y {0} no se puedan especificar al mismo tiempo
fr: Il est impossible de spécifier à la fois -m et {0}
ja: -m と {0} を同時に指定することはできません

source: no valid action types specified
de: keine gültigen Aktionstypen angegeben
es: no hay tipos de acciones válidos especificados
fr: aucun type d'action valide spécifié
ja: 有効なアクションタイプが指定されていません

source: WARNING: invalid action types specified: {0}
de: WARNUNG: Ungültige Aktionstypen angegeben: {0}
es: ADVERTENCIA: Se especificaron tipos de acciones no válidos: {0}
fr: AVERTISSEMENT : types d'action non valides spécifiés : {0}
ja: 警告: 無効なアクションタイプが指定されました: {0}

source: no packages installed
ca: sense paquets instal·lats
de: Keine Packages installiert
es: no hay paquetes instalados
fr: aucun package n'est installé
ja: インストール済みのパッケージが存在しません
ru: ни одного пакета не установлено

source: pkg: contents: no matching actions found in the listed packages
ca: pkg: continguts: no 'han trobat accions que coincideixin en els paquets llistats
de: pkg: contents: Keine entsprechenden Aktionen in den aufgelisteten Paketen gefunden.
es: pkg: contenido: no se encontraron acciones que coincidieran en los paquetes mostrados
fr: pkg : contenu : aucune action correspondante trouvée dans les packages répertoriés
ja: pkg: contents: 一覧にあるパッケージの中には一致するアクションは見つかりませんでした
ru: pkg: содержимое: в перечисленных пакетах не обнаружены подходящие действия.

source: This package contains no actions with the fields specified using the -o option. Please specify other fields, or use the -m option to show the raw package manifests.
de: Dieses Paket enthält keine Aktionen für die Felder, die mit der Option -o angegeben wurden. Geben Sie andere Felder an oder verwenden Sie die Option -m, um die Manifeste zum Raw-Paket anzuzeigen.
es: Este paquete no contiene acciones con los campos especificados mediante la opción -o . Especifique otros campos o utilice la opción -m para mostrar los manifiestos sin procesar del paquete.
fr: Ce package ne contient aucune action relative aux champs spécifiés à l'aide de l'option -o .Veuillez spécifier d'autres champs ou utiliser l'option -m pour afficher les manifestes de packages bruts.
ja: このパッケージには、-o オプションで指定されたフィールドを持つアクションは 含まれていません。ほかのフィールドを指定するか、-m オプションを使用してパッケージの生のマニフェストを 表示してください。
ru: Этот пакет не содержит действий с полями, указанными при помощи параметра -o . Укажите другие поля или используйте параметр -m для отображения необработанных манифестов пакета.

source: This package delivers no filesystem content, but may contain metadata. Use the -o option to specify fields other than 'path', or use the -m option to show the raw package manifests.
de: Dieses Paket enthält keinen Dateisystem-Inhalt, möglicherweise jedoch Metadaten. Verwenden Sie die Option -o, um andere Felder als 'path' anzugeben, oder die Option -m, um die Raw-Paket-Manifeste anzuzeigen.
es: Este paquete no ofrece contenido del sistema de archivos, pero puede contener metadatos. Utilice la opción -o para especificar campos distintos a 'path', o bien utilice la opción -m para mostrar los manifiestos sin procesar del paquete.
fr: Ce package ne fournit aucun contenu de système de fichiers mais contient peut-être des métadonnées. Utilisez l'option -o pour spécifier des champs autres que 'path' ou utilisez l'option -m pour afficher les manifestes de packages bruts.
ja: このパッケージにファイルシステムの内容はありませんが、メタデータが含まれている可能性があります。 -o オプションを使用して 'path' 以外のフィールドを指定するか、-m オプションを使用してパッケージの生のマニフェストを表示 してください。
ru: Данный пакет не включает в себя содержимое файловой системы, но может содержать метаданные. Используйте параметр -o для указания полей, отличных от 'path', или параметр -m для отображения манифестов необработанных пакетов.

source: pkg: contents: no packages matching the following patterns you specified are installed on the system. Try specifying -r to query remotely:
ca: pkg: contents: sense paquets que coincideixin amb els següents patrons que heu especificat estan instal·lats al sistema. Intenteu especificant -r a la consulta remota:
de: pkg: contents: Keine der Pakete, die den folgenden angegebenen Mustern entsprechen, sind auf dem System installiert. Versuchen Sie eine Remote-Abfrage mit -r:
es: pkg: contenido: no hay paquetes que coincidan con los siguientes modelos especificados instalados en el sistema. Intente especificar -r para consultar de manera remota:
fr: pkg : contenu : aucun package correspondant aux modèles spécifiés indiqués ci-dessous n'est installé sur le système. Essayez de spécifier -r pour envoyer une requête à distance :
ja: pkg: contents: 指定された次のパターンに一致するパッケージの中で、 システムにインストール済みのものが存在しません。-r を指定して、リモートで照会を行なってください:
ru: pkg: contents: в системе не установлен ни один пакет, соответствующий указанным шаблонам. Попробуйте указать параметр -r для удаленного запроса:

source: pkg: contents: no packages matching the following patterns you specified were found in the catalog. Try relaxing the patterns, refreshing, and/or examining the catalogs:
ca: pkg: contents: sense paquets que coincideixin amb els següents patrons que heu especificat estan instal·lats al sistema. Intenteu especificant -r a la consulta remota:
de: pkg: contents: Keine der Pakete, die den folgenden angegebenen Mustern entsprechen, sind auf dem System installiert. Versuchen Sie die Muster zu erweitern, zu aktualisieren und/oder die Kataloge zu durchsuchen:
es: pkg: contenido: no hay paquetes que coincidan con los siguientes modelos especificados en el catálogo. Intente relajar los modelos, refrescar o examinar los catálogos:
fr: pkg : contenu : aucun package correspondant aux modèles spécifiés indiqués ci-dessous ne se trouve dans le catalogue. Essayez d'assouplir les modèles, d'actualiser et/ou d'examiner les catalogues :
ja: pkg: contents: 指定された次のパターンに一致するパッケージが、カタログ内に見つ かりませんでした。パターンの条件緩和、リフレッシュ、カタログの検査の いずれか、あるいはそのすべてを試してください:
ru: pkg: contents: в каталоге не найден ни один пакет, соответствующий указанным шаблонам. Попробуйте сократить шаблоны, обновить и/или осмотреть каталоги:

source: {0}/{1} repositories for publisher '{2}' could not be reached for catalog refresh.
de: {0}/Auf {1} Repositorys für Herausgeber '{2}' konnte zur Katalogaktualisierung nicht zugegriffen werden.
es: No fue posible establecer la comunicación con {0}/{1} repositorios para el editor '{2}'.
fr: {0}/{1} référentiels pour l'éditeur '{2}' n'ont pas pu être atteints pour l'actualisation du catalogue.
ja: カタログリフレッシュのためにパブリッシャー '{2}' のリポジトリ {0}/{1} 個に到達できませんでした。

source: ({0} partial):
de: ({0} teilweise):
es: ({0} parcial):
fr: ({0} partiel) :
ja: ({0} 一部):

source: pkg: {succeeded}/{total} catalogs successfully updated{partial}
de: pkg: Kataloge {succeeded}/{total} erfolgreich aktualisiert{partial}
es: pkg: {succeeded}/{total} catálogos actualizados correctamente{partial}
fr: pkg : les catalogues {succeeded}/{total} ont été mis à jour {partial}
ja: pkg: {succeeded}/{total} カタログの更新に成功しました{partial}

source: repository
es: repositorio
fr: référentiel
ja: リポジトリ

source: {0} of {1} repositories
de: {0} von {1} Repositorys
es: {0} de {1} repositorios
fr: {0} sur {1} référentiels
ja: {0}/{1} 個のリポジトリ

source: Errors were encountered when attempting to contact {0} for publisher '{1}'.
de: Beim Versuch, Verbindung zu {0} für Herausgeber '{1}' aufzunehmen, sind Fehler aufgetreten.
es: Se detectaron errores al intentar establecer el contacto con {0} para el editor '{1}'.
fr: Des erreurs se sont produites lors de la tentative de contact de {0} pour l'éditeur '{1}'.
ja: パブリッシャー '{1}' の {0} に接続しようとしてエラーが発生しました。

source: 'pkg publisher' will show a list of publishers.
ca: 'pkg publisher' mostrarà el llistat de tots els publicadors.
de: 'pkg publisher' zeigt eine Liste der Herausgeber an.
es: 'pkg publisher' mostrará una lista de editores.
fr: 'pkg publisher' affiche la liste des éditeurs.
ja: 'pkg publisher' はパブリッシャーのリストを表示します。
ru: Команда 'pkg publisher' выводит список издателей.

source: Could not refresh the catalog for {0}
de: Katalog für {0} konnte nicht aktualisiert werden
es: No se pudo refrescar el catálogo para {0}
fr: Impossible d'actualiser le catalogue de {0}
ja: {0} のカタログをリフレッシュできませんでした

source: The origin URIs for '{pubname}' do not appear to point to a valid pkg repository. Please verify the repository's location and the client's network configuration. Additional details: {details}
de: Die ursprünglichen URIs für '{pubname}' zeigen nicht auf ein gültiges pkg-Repository. Überprüfen Sie das Verzeichnis des Repositorys und die Netzwerkkonfiguration des Clients. Zusätzliche Details: {details}
es: Los URI de origen de '{pubname}' no parece que apunten a un repositorio de paquetes válido. Compruebe la ubicación del repositorio y la configuración de red del cliente. Detalles adicionales: {details}
fr: Les URI d'origine de '{pubname}' ne semblent pas pointer vers un référentiel pkg valide. Vérifiez l'emplacement du référentiel et la configuration réseau du client. Informations supplémentaires : {details}
ja: '{pubname}' の起点 URI は有効な pkg リポジトリを指していないようです。 リポジトリの場所とクライアントのネットワーク構成を確認してください。 追加詳細: {details}

source: The specified URI does not appear to point to a valid pkg repository. Please check the URI and the client's network configuration. Additional details: {0}
de: Der angegebene URI zeigt nicht auf ein gültiges pkg-Repository. Prüfen Sie den URI und die Netzwerkkonfiguration des Clients. Zusätzliche Details: {0}
es: El URI especificado no parece que apunte a un repositorio de paquetes válido. Compruebe el URI y la configuración de red del cliente. Detalles adicionales: {0}
fr: L'URI spécifié ne semble pas pointer vers un référentiel pkg valide. Vérifiez l'URI et la configuration réseau du client. Informations supplémentaires : {0}
ja: 指定された URI は有効な pkg リポジトリを指していないようです。 URI とクライアントのネットワーク構成を確認してください。 追加詳細: {0}

source: Added publisher(s): {0}
de: Hinzugefügte(r) Herausgeber: {0}
es: Editores agregados: {0}
fr: Editeurs ajoutés : {0}
ja: 追加されたパブリッシャー: {0}

source: Updated publisher(s): {0}
de: Aktualisierte(r) Herausgeber: {0}
es: Editores actualizados: {0}
fr: Editeurs mis à jour : {0}
ja: 更新されたパブリッシャー: {0}

source: Approved CAs:
de: Genehmigte CAs:
es: CA aprobadas:
fr: CA approuvés :
ja: 承認された CA:
ru: Утвержденные CA:

source: Revoked CAs:
de: Widerrufene CAs:
es: CA revocadas:
fr: CA refusés :
ja: 失効した CA:
ru: Аннулированные CA:

source: SSL Key:
ca: Clau SSL:
de: SSL-Schlüssel:
es: Clave SSL:
fr: Clé SSL :
ja: SSL 鍵:
ru: Ключ SSL:

source: SSL Cert:
ca: Cert SSL:
de: SSL-Zert.:
es: Certificado SSL:
fr: Certificat SSL :
ja: SSL 証明書:
ru: Сертификат SSL:

source: Cert. Effective Date:
ca: Cert. Data d'expiració:
de: Gültigkeitsdatum Zertifikat:
es: Fecha de entrada en vigor del certificado:
fr: Date de début de validité du certificat :
ja: 証明書の発効日:
ru: Дата вступления в силу сертификата:

source: Cert. Expiration Date:
ca: Cert. Data d'expiració:
de: Ablaufdatum Zertifikat:
es: Fecha de caducidad del certificado:
fr: Date d'expiration du certificat :
ja: 証明書の有効期限:
ru: Дата истечения действия сертификата:

source: Publisher:
ca: Publicador:
de: Herausgeber:
es: Editor:
fr: Editeur :
ja: パブリッシャー:
ru: Издатель:

source: Alias:
ca: Àlies:
ja: 別名:
ru: Псевдоним:

source: Origin URI:
ca: URI Origen:
de: Ursprüngliche URI:
es: URI de origen:
fr: URI d'origine :
ja: 起点 URI:
ru: URI источника:

source: Proxy:
ja: プロキシ:

source: Mirror URI:
ca: URI Rèplica:
de: Gespiegelte URI:
es: URI de reflejo:
fr: URI miroir :
ja: ミラー URI:
ru: URI зеркала:

source: Client UUID:
ca: UUOD Client:
es: UUID de cliente:
fr: UUID client :
ja: クライアント UUID:
ru: UUID клиента:

source: Catalog Updated:
ca: Catàleg actualitzat:
de: Aktualisierter Katalog:
es: Catálogo actualizado:
fr: Mise à jour du catalogue :
ja: カタログの更新:
ru: Каталог обновлен:

source: Enabled:
ca: Habilitat:
de: Aktiviert:
es: Activado:
fr: Activation :
ja: 有効:
ru: Включен:

source: Properties:
de: Eigenschaften:
es: Propiedades:
fr: Propriétés :
ja: プロパティー:

source: requires a property name and value
ca: necessita un nom i valor de propietat
de: Eigenschaftsname und -wert erforderlich
es: requiere un nombre de propiedad y un valor
fr: requiert un nom et une valeur de propriété
ja: プロパティー名と値が必要です
ru: необходимо название и значение свойства

source: requires a property name and at least one value
de: Erfordert einen Eigenschaftsnamen und mindestens einen Wert
es: requiere un nombre de propiedad y como mínimo un valor
fr: nécessite un nom de propriété et au moins une valeur
ja: プロパティー名と少なくとも 1 つの値が必要です
ru: требуется имя свойства и минимум одно значение

source: Signature-policy {0} doesn't allow additional parameters.
de: Signaturrichtlinie {0} lässt keine zusätzlichen Parameter zu.
es: La directiva de firmas {0} no permite parámetros adicionales.
fr: La politique des signatures {0} n'autorise pas les paramètres supplémentaires.
ja: 署名ポリシー {0} には追加のパラメータは許可されません。

source: requires at least one property name
ca: necessita com a mínim el nom d'una propietat
de: Erfordert mindestens einen Eigenschaftsnamen
es: necesita al menos un nombre de propiedad
fr: requiert au moins un nom de propriété
ja: プロパティー名を少なくとも 1 つ指定する必要があります
ru: для команды необходимо хотя бы одно название свойства

source: no such property: {0}
de: Keine derartige Eigenschaft: {0}
es: esta propiedad no existe: {0}
fr: cette propriété n'existe pas : {0}
ja: そのようなプロパティーは存在しません: {0}

source: VARIANT
fr: VARIANTE
ja: バリアント

source: VALUE
fr: VALEUR
ja: 値
ru: ЗНАЧЕНИЕ

source: no matching variants found
de: keine übereinstimmenden Varianten gefunden
es: no se ha encontrado ninguna variante que coincida
fr: aucune variante correspondante n'a été trouvée
ja: 一致するバリアントが見つかりません

source: FACET
fr: FACETTE
ja: ファセット

source: SRC
ja: ソース

source: MASKED
fr: MASQUE
ja: マスク済み

source: no matching facets found
de: keine übereinstimmenden Facetten gefunden
es: no se ha encontrado ninguna faceta que coincida
fr: aucune facette correspondante n'a été trouvée
ja: 一致するファセットが見つかりません

source: RELATIONSHIP
fr: RELATION
ja: 関係

source: PATH
fr: CHEMIN
ja: パス
