Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Invalid repository URL: '{url}': {msg}
de: Ungültige Repository-URL: '{url}': {msg}
es: URL de repositorio no válida: '{url}': {msg}
fr: URL du référentiel incorrect : '{url}': {msg}
ja: 無効なリポジトリ URL: '{url}': {msg}

source: '{op}' failed for transaction ID '{trans_id}'; status '{status}': {msg}
de: '{op}' nicht erfolgreich für Transaktions-ID '{trans_id}'; Status '{status}': {msg}
es: Error de '{op}' para el ID de transacción '{trans_id}'; estado '{status}': {msg}
fr: Echec de '{op}' pour l'ID de transaction '{trans_id}' ; statut '{status}' : {msg}
ja: '{op}' はトランザクション ID '{trans_id}' に失敗しました; ステータス '{status}': {msg}

source: '{op}' failed for transaction ID '{trans_id}': {msg}
de: '{op}' nicht erfolgreich für Transaktions-ID '{trans_id}'; {msg}
es: Error de '{op}' para el ID de transacción '{trans_id}': {msg}
fr: Echec de '{op}' pour l'ID de transaction '{trans_id}' : {msg}
ja: '{op}' はトランザクション ID '{trans_id}' に失敗しました: {msg}

source: '{op}' failed; unable to initiate transaction: {msg}
de: '{op}' nicht erfolgreich; Transaktion kann nicht gestartet werden: {msg}
es: Error de '{op}'; no se puede iniciar la transacción: {msg}
fr: Echec de '{op}' ; impossible d'initier une transaction : {msg}
ja: '{op}' は失敗しました; トランザクションを初期化できません: {msg}

source: Unable to initiate transaction: {0}
de: Initiieren der Transaktion nicht möglich: {0}
es: No se puede iniciar la transacción: {0}
fr: Impossible d'initier une transaction : {0}
ja: トランザクションを初期化できません: {0}

source: Unsupported operation '{op}' for the specified repository type '{type}'.
de: Nicht unterstützter Vorgang '{op}' für den angegebenen Repository-Typ '{type}'.
es: Operación no admitida '{op}' para el tipo de repositorio especificado '{type}'.
fr: Opération '{op}' non prise en charge pour le type de référentiel '{type}' spécifié.
ja: 指定されたリポジトリタイプ '{type}' に対してサポートされていない操作 '{op}'。

source: The file to be added is not a file. The path given was {0}.
de: Das hinzuzufügende Element ist keine Datei. Der angegebene Pfad lautet {0}.
es: El archivo para agregar no es un archivo. La ruta proporcionada es {0}.
fr: Le fichier à ajouter n'est pas un fichier. Le chemin spécifié était {0}.
ja: 追加するファイルがファイルではありません。指定されたパスは {0} でした。

source: An error occurred while trying to initialize the repository directory structures: {0}
de: Beim Versuch, die Repository-Verzeichnisstrukturen zu initialisieren, trat ein Fehler auf: {0}
es: Error al intentar inicializar las estructuras de directorio del repositorio: {0}
fr: Une erreur s'est produite lors de la tentative d'initialisation des structures de répertoire du référentiel : {0}
ja: リポジトリのディレクトリ構成を初期化しようとしているときにエラーが発生しました: {0}

source: Unknown failure; no transaction ID provided in response.
de: Unbekannter Fehler; keine Transaktions-ID in Antwort angegeben.
es: Error desconocido; no se ha proporcionado un ID de transacción en la respuesta.
fr: Panne inconnue ; aucun ID de transaction fourni dans la réponse.
ja: 不明なエラー; 応答にトランザクション ID が指定されていません.
ru: Неизвестная ошибка; в ответе не указан идентификатор транзакции.

source: An unparseable character in query at position : {0:d}
de: Nicht Parsing-fähiges Zeichen in Abfrage an Position : {0:d}
es: Carácter no analizable en la consulta en la posición: {0:d}
fr: Caractère non analysable dans la requête à la position : {0:d}
ja: クエリーの次のポジションに解析できない文字があります: {0:d}

source: The number of terms in the query is {len:d}, which exceeds the maximum supported value of {maxt:d} terms.
de: Die Anzahl der Begriffe in der Abfrage beträgt {len:d} und übersteigt damit die unterstützte maximale Anzahl von {maxt:d} Begriffen.
es: El número de términos en la consulta es de {len:d}, lo que excede el valor máximo admitido de {maxt:d} términos.
fr: Le nombre de termes de la requête {len:d} dépasse le nombre de termes maximal pris en charge {maxt:d}.
ja: クエリー内の用語の数は {len:d} です。これは、サポートされる最大値 ({maxt:d} 用語) を超えています。

source: In query {query}, {name} had a bad value of '{bv}'.
de: In Abfrage {query} enthielt {name} einen ungültigen Wert von '{bv}'.
es: En la consulta {query}, {name} tenía un valor no válido de '{bv}'.
fr: Dans la requête {query}, {name} a une valeur erronée de '{bv}'.
ja: クエリー {query} の {name} に誤った値 '{bv}' があります。

source: A query is expected to have five fields: case sensitivity, return type, number of results to return, the number at which to start returning results, and the text of the query. The query provided lacked at least one of those fields: {0}
de: Bei einer Abfrage werden fünf Felder erwartet: Unterscheidung zwischen Groß- und Kleinschreibung, Rückgabetyp, Anzahl der zurückzugebenden Ergebnisse, Anzahl, ab der mit der Rückgabe von Ergebnissen begonnen werden soll, und Text der Abfrage. Bei der bereitgestellten Abfrage fehlte mindestens eines dieser Felder: {0}
es: Se esperaba una consulta con cinco campos: distinción entre mayúsculas y minúsculas, tipo de devolución, número de resultados que devolver, el número en que iniciar los resultados devueltos y el texto de la consulta. La consulta proporcionada carece de al menos uno de esos campos: {0}
fr: Une requête doit comporter cinq champs : sensibilité de la casse, type de retour, nombre de résultats à renvoyer, nombre à partir duquel commencer à renvoyer des résultats et texte de la requête. La requête fournie ne comprend pas au moins un de ces champs : {0}
ja: クエリーには、大文字小文字を区別するかどうか、戻り値のタイプ、戻り値の数、どの結果から返し始めるかを示す番号、クエリーのテキストの 5 つのフィールドが必要です。このクエリーには、これらのフィールドが 1 つ以上不足しています: {0}

source: Could not parse query.
ca: No es pot analitzar la consulta.
de: Parsing der Abfrage nicht möglich.
es: No se pudo analizar la consulta.
fr: Impossible d'analyser la requête.
ja: クエリーを構文解析できません。
ru: Не удалось проанализировать запрос.

source: Problem occurred with: {0}
de: Ein Problem trat auf bei: {0}
es: Ocurrió un problema con: {0}
fr: Un problème s'est produit avec : {0}
ja: 次の箇所で問題が発生しました: {0}

source: This expression produces action results:
ca: Aquesta expressió produeix els resultats d'acció:
de: Dieser Ausdruck führt zu Aktionsergebnissen:
es: Esta expresión produce resultados en la acción:
fr: Cette expression produit des résultats d'action :
ja: この式で生成される結果はアクションです:
ru: Это выражение производит результаты действия:

source: This expression produces package results:
ca: Aquesta expressió produeix els resultats de paquets:
de: Dieser Ausdruck führt zu Paketergebnissen:
es: Esta expresión produce resultados en el paquete:
fr: Cette expression produit des résultats de package :
ja: この式で生成される結果はパッケージです:
ru: Это выражение производит результаты пакетов:

source: 'AND' and 'OR' require those expressions to produce the same type of results.
ca: 'AND' o 'OR' requereix aquestes expressions per a produir el mateix tipus de resultats.
de: 'AND' und 'OR' erfordern, dass diese Ausdrücke zum selben Ergebnistyp führen.
es: 'AND' y 'OR' precisan estas expresiones para producir el mismo tipo de resultados.
fr: 'AND' et 'OR' requièrent que ces expressions produisent le même type de résultats.
ja: 'AND' と 'OR' では、これらの式から 同じタイプの結果が生成される必要があります。
ru: Для работы 'AND' и 'OR' эти выражения должны возвращать результаты одинакового типа.

source: The search index cannot be modified as it is currently in use by another process: pid {pid} on {host}.
de: Der Suchindex kann nicht geändert werden, da er derzeit von einem anderen Vorgang verwendet wird: pid {pid} auf {host}.
es: El índice de búsqueda no se puede modificar porque está siendo utilizado por otro proceso: pid {pid} en {host}.
fr: L'index de recherche ne peut pas être modifié car il est actuellement utilisé par un autre processus : pid {pid} sur {host}.
ja: 検索インデックスは、次に示す別のプロセスで現在使用されているため変更できません: {host} 上の pid {pid}。

source: The search index cannot be modified as it is currently in use by another process.
de: Der Suchindex kann nicht geändert werden, da er derzeit von einem anderen Vorgang verwendet wird.
es: El índice de búsqueda no se puede modificar porque está siendo utilizado por otro proceso.
fr: L'index de recherche ne peut pas être modifié car il est actuellement utilisé par un autre processus.
ja: 検索インデックスは、別のプロセスで現在使用されているため変更できません。
ru: Невозможно изменить индекс поиска, поскольку в настоящее время он используется другим процессом.

source: Info does not recognize the following options: {0}
de: Info erkennt die folgenden Optionen nicht: {0}
es: La información no reconoce las opciones siguientes: {0}
fr: L'option Info ne reconnaît pas les options suivantes : {0}
ja: Info は次のオプションを認識しません: {0}

source: Directory listing not allowed.
ca: El llistat de directori no està permès.
de: Verzeichnisliste nicht zulässig.
es: No se permite el listado de directorios.
fr: Liste des répertoires non autorisée.
ja: ディレクトリの表示はできません。
ru: Содержимое каталога не разрешено.

source: A valid package FMRI must be specified.
de: Es muss ein gültiger Paket-FMRI angegeben werden.
es: Debe especificarse un FMRI de paquete válido.
fr: Spécifiez un FMRI de package valide.
ja: 有効なパッケージ FMRI を指定する必要があります。
ru: Необходимо указать действительный FMRI пакета.

source: The specified Action Type, '{0}', is not valid.
de: Der angegebene Aktionstyp, '{0}', ist nicht gültig.
es: El tipo de acción especificado, '{0}', no es válido.
fr: Le type d'action spécifié, '{0}', n'est pas valide.
ja: 指定されたアクションタイプ、'{0}' は無効です。

source: The specified Action attribute value, '{0}', is not valid.
de: Der angegebene Aktionsattributwert '{0}' ist nicht gültig.
es: El valor del atributo de acción especificado, '{0}', no es válido.
fr: La valeur de l'attribut d'action, '{0}', n'est pas valide.
ja: 指定されたアクション属性値 '{0}' は無効です。

source: file/1 must be sent a file.
de: Datei/1 muss eine Datei gesendet werden.
es: A file/1 se le debe enviar un archivo.
fr: Un fichier doit être envoyé à file/1.
ja: file/1 にファイルを送る必要があります。

source: manifest/1 must be sent a file.
de: Manifest/1 muss eine Datei gesendet werden.
es: A manifest/1 se le debe enviar un archivo.
fr: Un fichier doit être envoyé à manifest/1.
ja: manifest/1 にファイルを送る必要があります。

source: No matching package found in repository.
de: Kein übereinstimmendes Paket in Repository gefunden.
es: No se ha encontrado ningún paquete coincidente en el repositorio.
fr: Aucun package correspondant dans le référentiel.
ja: 一致するパッケージがリポジトリに見つかりません。
ru: В хранилище не найден соответствующий пакет.

source: Unable to generate statistics.
de: Statistik kann nicht generiert werden.
es: No se pueden generar estadísticas.
fr: Impossible de générer les statistiques.
ja: 統計を生成できません。
ru: Не удалось создать статистику.

source: A package repository (or a directory with content) already exists at '{0}'.
de: Ein Paket-Repository (oder ein Verzeichnis mit Inhalt) ist bereits unter '{0}' vorhanden.
es: Ya existe un repositorio de paquetes (o un directorio con contenido) en '{0}'.
fr: Un référentiel de package (ou un répertoire avec contenu) existe déjà dans '{0}'.
ja: パッケージリポジトリ (または内容のあるディレクトリ) がすでに '{0}' に存在します。

source: No file could be found for the specified hash name: '{0}'.
de: Für den angegebenen Hash-Namen konnte keine Datei gefunden werden: '{0}'.
es: No se ha encontrado ningún archivo para el nombre del hash especificado: '{0}'.
fr: Aucun fichier trouvé pour le nom de hachage spécifié : '{0}'.
ja: 指定されたハッシュ名 '{0}' に対するファイルは見つかりませんでした。

source: The specified path does not contain a valid package repository.
de: Der angegebene Pfad enthält kein gültiges Paket-Repository.
es: La ruta especificada no contiene un repositorio de paquetes válido.
fr: Le chemin spécifié ne contient pas de référentiel de package valide.
ja: 指定されたパスには、有効なパッケージリポジトリが含まれていません。
ru: Указанный путь не содержит действительное хранилище пакета.

source: The path '{0}' does not contain a valid package repository.
de: Der Pfad '{0}' enthält kein gültiges Paket-Repository.
es: La ruta '{0}' no contiene un repositorio de paquetes válido.
fr: Le chemin '{0}' ne contient pas de référentiel de package valide.
ja: パス '{0}' には、有効なパッケージリポジトリが含まれていません。

source: The FMRI in ignored-dependency file: {fn} is invalid. '{fmri}'.
de: Die FMRI in der Datei mit ignorierten Abhängigkeiten {fn} ist ungültig. '{fmri}'.
es: El FMRI del archivo cuya dependencia se omitió: {fn} no es válido. '{fmri}'.
fr: FMRI du fichier ignorant les dépendances : {fn} non valide. '{fmri}'.
ja: ignored-dependency ファイル内の FMRI: {fn} は無効です。 '{fmri}'。

source: The entry in ignored-dependency file: {fn} is invalid. '{entry}'.
de: Der Eintrag in der Datei mit ignorierten Abhängigkeiten {fn} ist ungültig. '{entry}'.
es: La entrada del archivo cuya dependencia se omitió: {fn} no es válida. '{entry}'.
fr: Entrée du fichier ignorant les dépendances : {fn} non valide. '{entry}'.
ja: ignored-dependency ファイル内のエントリ: {fn} は無効です。 '{entry}'。

source: Missing attribute(s) in ignored-dependency entry: '{entry}'. {attrs}.
de: Fehlende Attribute in dem Eintrag mit ignorierten Abhängigkeiten: '{entry}'. {attrs}.
es: Faltan atributos en la entrada cuya dependencia se omitió: '{entry}'. {attrs}.
fr: Attribut(s) manquant(s) dans l'entrée ignorant les dépendances : '{entry}'. {attrs}.
ja: ignored-dependency エントリ内で欠落している属性: '{entry}'。 {attrs}。

source: Unknown attribute(s) found in ignored-dependency entry: '{entry}'. {attrs}.
de: Unbekannte Attribute in dem Eintrag mit ignorierten Abhängigkeiten ermittelt: '{entry}'. {attrs}.
es: Se encontraron atributos desconocidos en la entrada cuya dependencia se omitió: '{entry}'. {attrs}.
fr: Attribut(s) inconnu(s) trouvé(s) dans l'entrée ignorant les dépendances : '{entry}'. {attrs}.
ja: ignored-dependency エントリで不明な属性が見つかりました: '{entry}'。 {attrs}。

source: This operation requires that a default publisher has been set or that a publisher be specified in the FMRI '{0}'.
de: Dieser Vorgang erfordert einen festgelegten Standard-Herausgeber oder einen Herausgeber, der in FMRI '{0}' festgelegt wurde.
es: Esta operación requiere que haya definido un editor predeterminado o que se haya especificado un editor en el FMRI '{0}'.
fr: Pour cette opération, vous devez définir un éditeur par défaut ou spécifier un éditeur dans le FMRI '{0}'.
ja: この操作では、デフォルトのパブリッシャーが設定されているか、FMRI '{0}' でパブリッシャーが指定されていることが必要です。

source: No transaction matching '{0}' could be found.
de: Es konnte keine Transaktion gefunden werden, die '{0}' entspricht.
es: No se ha podido encontrar ninguna transacción que coincida con '{0}'.
fr: Aucune transaction correspondant à '{0}' n'a pu être trouvée.
ja: '{0}' と一致するトランザクションが見つかりませんでした。

source: The repository cannot be modified as it is currently in use by another process: pid {pid} on {host}.
de: Das Repository kann nicht geändert werden, da es derzeit von einem anderen Vorgang verwendet wird: pid {pid} auf {host}.
es: El repositorio no se puede modificar porque está siendo utilizado por otro proceso: pid {pid} en {host}.
fr: Le référentiel ne peut pas être modifié car il est actuellement utilisé par un autre processus : pid {pid} sur {host}.
ja: リポジトリは、次に示す別のプロセスで現在使用されているため変更できません: {host} 上の pid {pid}。

source: The repository cannot be modified as it is currently in use by another process.
de: Das Repository kann nicht geändert werden, da es derzeit von einem anderen Vorgang verwendet wird.
es: El repositorio no se puede modificar porque está siendo utilizado por otro proceso.
fr: Le référentiel ne peut pas être modifié car il est actuellement utilisé par un autre processus.
ja: リポジトリは、別のプロセスで現在使用されているため変更できません。
ru: Невозможно изменить хранилище, поскольку в настоящее время оно используется другим процессом.

source: No manifest could be found for the FMRI: '{0}'.
de: Für den FMRI konnte kein Manifest gefunden werden: '{0}'.
es: No se encontró ningún manifiesto para el FMRI: '{0}'.
fr: Aucun manifeste trouvé pour le FMRI : '{0}'.
ja: FMRI '{0}' に対するマニフェストが見つかりません。

source: The requested operation cannot be performed when the repository is used in mirror mode.
ca: L'operació sol·licitada no pot realitzar-se quant el repositori està utilitzat en mode de rèplica.
de: Der angeforderte Vorgang kann nicht durchgeführt werden, wenn das Repository im Spiegelmodus verwendet wird.
es: La operación solicitada no se puede realizar cuando el repositorio se usa en modo reflejo.
fr: L'opération requise ne peut être exécutée lorsque le référentiel utilisé est en mode miroir.
ja: リポジトリをミラーモードで使用する場合、要求された操作は実行できません。
ru: Невозможно выполнить запрошенную операцию, если хранилище используется в зеркальном режиме.

source: The requested operation could not be completed as a default publisher has not been configured.
de: Der angeforderte Vorgang konnte nicht abgeschlossen werden, da kein Standard-Herausgeberkonfiguriert wurde.
es: La operación solicitada no se ha podido completar porque no se había configurado el editor predeterminado.
fr: L'opération demandée n'a pas pu être effectuée car aucun éditeur par défaut n'a été configuré.
ja: デフォルトのパブリッシャーが構成されていないため、要求された操作を完了できませんでした。
ru: Не удалось завершить запрошенную операцию, поскольку не выполнена настройка издателя по умолчанию.

source: No such file '{0}'.
de: Datei '{0}' nicht vorhanden.
es: No existe tal archivo '{0}'.
fr: Pas de fichier '{0}'.
ja: そのようなファイル '{0}' は存在しません。

source: The repository is read-only and cannot be modified.
ca: Es repositori és de nomes-lectura i no pot ser modificat.
de: Das Repository ist schreibgeschützt und kann nicht geändert werden.
es: El repositorio es de sólo lectura y no se puede modificar.
fr: Le référentiel est en lecture seule et ne peut être modifié.
ja: リポジトリは読み取り専用で、修正はできません。
ru: Хранилище доступно только для чтения и не может быть изменено.

source: No token was provided to search.
ca: No es va proporcionar cap senyal de cerca.
de: Für die Suche wurde kein Token bereitgestellt.
es: No se ha proporcionado ningún token de búsqueda.
fr: Aucun jeton fourni pour la recherche.
ja: 検索にトークンが指定されていませんでした。
ru: Не указан маркер для поиска

source: The specified search token '{0}' is invalid.
de: Das angegebene Such-Token '{0}' ist ungültig.
es: El token de búsqueda especificado '{0}' no es válido.
fr: Le jeton de recherche '{0}' spécifié n'est pas valide.
ja: 指定された検索トークン '{0}' は不正です。

source: Search functionality is temporarily unavailable.
ca: La funcionalitat de cerca temporalment no està disponible.
de: Die Suchfunktion ist vorübergehend nicht verfügbar.
es: La funcionalidad de búsqueda no está temporalmente disponible.
fr: La fonctionnalité de recherche est temporairement indisponible.
ja: 検索機能は一時的に使用できません。
ru: Функциональность поиска временно недоступна.

source: Publisher '{0}' already exists.
de: Herausgeber '{0}' ist bereits vorhanden.
es: El editor '{0}' ya existe.
fr: L'éditeur '{0}' existe déjà.
ja: パブリッシャー '{0}' はすでに存在します。

source: No publisher was specified or no default publisher has been configured for the repository.
de: Es wurde kein Herausgeber angegeben oder kein Standard-Herausgeber für das Repository konfiguriert.
es: No se ha especificado ningún editor o no se ha configurado ningún editor predeterminado para el repositorio.
fr: Aucun éditeur n'a été spécifié ou aucun éditeur par défaut n'a été configuré pour le référentiel.
ja: リポジトリのパブリッシャーが指定されなかったか、デフォルトのパブリッシャーが構成されていません。
ru: Издатель не указан или не выполнена настройка издателя для хранилища.

source: No publisher matching '{0}' could be found.
de: Es konnte kein Herausgeber gefunden werden, der '{0}' entspricht.
es: No se ha podido encontrar ningún editor que coincida con '{0}'.
fr: Aucun éditeur correspondant à '{0}' n'a pu être trouvé.
ja: '{0}' と一致するパブリッシャーが見つかりませんでした。

source: Quarantined path already exists.
de: Gesperrter Pfad ist bereits vorhanden.
es: Ya existe una ruta de cuarentena.
fr: Le chemin en quarantaine existe déjà.
ja: 隔離されたパスはすでに存在しています。

source: Unable to find trust anchor directory {0}
de: Sicherheitsankerverzeichnis {0} kann nicht gefunden werden
es: No se puede encontrar el directorio de anclaje de confianza {0}
fr: Le répertoire de l'ancre sécurisée {0} est introuvable
ja: トラストアンカーディレクトリ {0} が見つかりません

source: Skipping {name}; invalid manifest: {error}
de: {name} wird übersprungen; ungültiges Manifest: {error}
es: Omitiendo {name}; manifiesto no válido: {error}
fr: {name} ignoré ; manifeste non valide : {error}
ja: {name} をスキップしています; 無効なマニフェスト: {error}

source: Index corrupted or out of date. Removing old index directory ({0}) and rebuilding search indexes.
de: Index beschädigt oder veraltet. Das alte Indexverzeichnis ({0}) wird entfernt, und die Suchindizes werden neu erstellt.
es: Índice dañado o caducado. Eliminando directorio de índice antiguo ({0}) ygenerando nuevos índices de búsqueda.
fr: Index corrompu ou obsolète. Suppression de l'ancien répertoire d'index ({0}) et reconstruction des index de recherche.
ja: インデックスが壊れているか古くなっています。古いインデックスディレクトリ ({0}) を削除して検索インデックスを再構築しています。

source: writable root not writable by current user id or group.
ca: No es pot escriure a l'arrel per l'id o grup d'usuari actual.
de: Beschreibbare Root kann von aktueller Benutzer-ID oder Gruppe nicht beschrieben werden.
es: el grupo o el id de usuario actual no puede escribir en la raíz escribible.
fr: L'ID utilisateur ou le groupe actuel ne dispose pas de droits d'écriture pour la racine.
ja: 現在のユーザー ID またはグループでは書き込みできない書き込み可能ルートです。
ru: корень не доступен для записи текущему пользователю или группе.

source: unable to write to index directory.
ca: no es pot escriure al directori índex.
de: Schreiben in Indexverzeichnis nicht möglich.
es: no es posible escribir en el directorio del índice.
fr: Ecriture impossible dans le répertoire d'index
ja: インデックスディレクトリに書き込めません。
ru: запись в каталог индекса невозможна.

source: Unknown error
de: Unbekannter Fehler
es: Error desconocido
fr: Erreur inconnue
ja: 不明なエラー

source: Invalid file hash: {0}
de: Ungültiger Datei-Hash: {0}
es: Hash de archivo no válido: {0}
fr: Hachage de fichier non valide : {0}
ja: 無効なファイルハッシュ: {0}

source: Corrupt manifest.
de: Beschädigtes Manifest.
es: Manifiesto dañado.
fr: Manifeste endommagé.
ja: 壊れたマニフェスト。

source: Use pkglint(1) for more details.
de: Über pkglint(1) erhalten Sie weitere Details.
es: Use pkglint(1) para obtener más detalles.
fr: Utilisez pkglint(1) pour plus de détails.
ja: 詳細は、pkglint(1) を使用してください。

source: Missing file: {0}
de: Fehlende Datei: {0}
es: Archivo faltante: {0}
fr: Fichier manquant : {0}
ja: 見つからないファイル: {0}

source: Corrupted gzip file.
de: Beschädigte GZIP-Datei.
es: Archivo gzip dañado.
fr: Fichier gzip endommagé.
ja: 壊れた gzip ファイル。

source: Verification failure: {0}
de: Überprüfungsfehler: {0}
es: Error de verificación: {0}
fr: Echec de la vérification : {0}
ja: 検証エラー: {0}

source: Bad manifest.
de: Ungültiges Manifest.
es: Manifiesto incorrecto.
fr: Manifeste incorrect.
ja: 不正なマニフェスト。

source: Bad signature.
de: Ungültige Signatur.
es: Firma incorrecta.
fr: Signature incorrecte.
ja: 不正な署名。

source: Restrictive permissions.
de: Restriktive Berechtigungen.
es: Permisos restrictivos.
fr: Autorisations restrictives.
ja: 制限されたアクセス権。
