Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: command does not take any operands
de: Befehl akzeptiert keine Operanden
es: el comando no toma operandos
fr: commande n'accepte aucun opérande.
ja: コマンドはオペランドを取りません

source: -q and -v can not be combined
de: -q und -v können nicht kombiniert werden
es: -q y -v no se pueden combinar
fr: Il est impossible de combiner -q et -v
ja: -q と -v を組み合わせることはできません

source: Two package repository locations must be provided using -s.
de: Es müssen zwei Verzeichnisse für das Package-Repository mit der Option -s angegeben werden.
es: Se deben proporcionar dos ubicaciones de repositorio de paquetes mediante -s.
fr: Deux emplacements de référentiel de package doivent être fournis à l'aide de -s.
ja: 2 つのパッケージリポジトリの場所を -s を使用して指定する必要があります。

source: A second package repository location must also be provided using -s.
de: Es muss ein zweites Verzeichnis für das Package-Repository mit der Option -s angegeben werden.
es: También se debe proporcionar una segunda ubicación de repositorio de paquetes mediante -s.
fr: Un deuxième emplacement de référentiel de package doit également être fourni à l'aide de -s.
ja: 2 つ目のパッケージリポジトリの場所を -s を使用して指定する必要があります。

source: The pkgrepo command appears out of sync with the libraries provided by pkg:/package/pkg. The client version is {client} while the library API version is {api}.
de: Der pkgrepo-Befehl stimmt nicht mit den von pkg:/package/pkg angegebenen Bibliotheken überein. Die Clientversion ist {client} und die Bibliotheks- API-Version ist {api}.
es: El comando pkgrepo aparece desincronizado con las bibliotecas proporcionadas por pkg:/package/pkg. La versión de cliente es {client} y la versión de la API de biblioteca es {api}.
fr: La commande pkgrepo n'est pas synchronisée avec les bibliothèques fournies par pkg :/package/pkg. La version client est {client}, tandis que la version de l'API de la bibliothèque est {api}.
ja: pkgrepo コマンドは、pkg:/package/pkg で提供されているライブラリと同期が取れていない ようです。クライアントのバージョンが {client} であるのに対して、ライブラリ API のバージョンは {api} です。

source: Usage: pkgsend [options] command [cmd_options] [operands] Packager subcommands: pkgsend generate [-T pattern] [-u] [--target file] source ... pkgsend publish [-b bundle ...] [-d source ...] [-s repo_uri_or_path] [-T pattern] [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [manifest ...] Options: --help or -? display usage message Environment: PKG_REPO The path or URI of the destination repository.
de: Verwendung: pkgsend [options] command [cmd_options] [operands] Packager-Unterbefehle: pkgsend generate [-T pattern] [-u] [--target file] source ... pkgsend publish [-b bundle ...] [-d source ...] [-s repo_uri_or_path] [-T pattern] [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [manifest ...] Optionen: --help oder -? zur Anzeige von Verwendungsmeldung Umgebung: PKG_REPO Der Pfad oder die URI des Ziel-Repositorys.
es: Sintaxis: pkgsend [options] command [cmd_options] [operands] Subcomandos del empaquetador: pkgsend generate [-T pattern] [-u] [--target file] source ... pkgsend publish [-b bundle ...] [-d source ...] [-s repo_uri_or_path] [-T pattern] [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [manifest ...] Opciones: --help or -? muestran el mensaje de sintaxis Entorno: PKG_REPO Ruta o URI de repositorio de destino.
fr: Syntaxe : pkgsend [options] command [cmd_options] [operands] Sous-commandes du gestionnaire de packages : pkgsend generate [-T pattern] [-u] [--target file] source ... pkgsend publish [-b bundle ...] [-d source ...] [-s repo_uri_or_path] [-T pattern] [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [manifest ...] Options : --help or -? affiche un message relatif à la syntaxe Environnement : PKG_REPO Chemin ou URI du référentiel de destination.
ja: 使用方法: pkgsend [options] command [cmd_options] [operands] パッケージャーのサブコマンド: pkgsend generate [-T pattern] [-u] [--target file] source ... pkgsend publish [-b bundle ...] [-d source ...] [-s repo_uri_or_path] [-T pattern] [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [manifest ...] オプション: --help または -? 使用方法のメッセージを表示します 環境: PKG_REPO 保存先のリポジトリのパスまたは URI。

source: WARNING: Several SVR4 packages detected. Multiple pkg.summary and pkg.description attributes may have been generated.
de: WARNUNG: Mehrere SVR4-Pakete erkannt. Möglicherweise wurden mehrere pkg.summary- und pkg.description-Attribute generiert.
es: ADVERTENCIA: se detectaron varios paquetes SVR4. Es posible que se hayan generado varios atributos de descripción pkg.summary y pkg.
fr: AVERTISSEMENT : plusieurs packages SVR4 ont été détectés. Plusieurs attributs pkg.summary et pkg.description ont peut-être été générés.
ja: 警告: 複数の SVR4 パッケージが検出されました。複数の pkg.summary および pkg.description 属性が生成された可能性があります。

source: ERROR: class action script used in {pkg}: {path} belongs to "{classname}" class
de: ERROR: Klassenaktionsskript, das in {pkg}: {path} verwendet wird, gehört zu Klasse "{classname}"
es: ERROR: secuencia de comandos de acción de clase usada en {pkg}: {path} pertenece a la clase "{classname}"
fr: ERREUR : le script d'action de classe utilisé dans {pkg} : {path} appartient à la classe "{classname}"
ja: ERROR: {pkg} でクラスアクションスクリプトが使用されました: {path} は "{classname}" クラスに属しています

source: ERROR: script present in {pkg}: {script}
de: ERROR: Skript in {pkg} vorhanden: {script}
es: ERROR: secuencia de comandos presente en {pkg}: {script}
fr: ERREUR : script présent dans {pkg} : {script}
ja: ERROR: {pkg} にスクリプトがあります: {script}

source: Invalid repository configuration values were specified using --set-property or required values are missing. Please provide the correct and/or required values using the --set-property option.
ca: Valors de configuració de repositori no vàlids van ser especificats mitjançant --set-property o bé els valors requerits no hi són. Proporcioneu i/o corregiu els valors amb l'opció --set-property.
de: Mit --set-property wurden ungültige Repository-Konfigurationswerte angegeben oder erforderliche Werte fehlen. Geben Sie mit der --set-property-Option die korrekten und/oder erforderlichen Werte an.
es: Se especificaron valores de configuración de repositorio no válidos usando --set-property o faltan valores necesarios. Proporcione los valores correctos o necesarios mediante la opción --set-property.
fr: Des valeurs de configuration du référentiel incorrectes ont été spécifiées à l'aide de la commande --set-property ou des valeurs requises manquent. Fournissez les valeurs correctes et/ou requises via l'option --set-property.
ja: --set-property を使用して、無効なリポジトリ構成値が指定されたか、必要な値が指定されていません。--set-property オプションを使用して、正しい値、または必要な値を指定してください。
ru: Указаны недопустимые значения конфигурации хранилища при использовании параметра --set-property, или требуемые значения отсутствуют. Введите правильные и/или требуемые значения при использовании параметра --set-property.

source: only -e or -n may be specified
ca: solament podeu especificar -e o -n
de: Nur -e oder -n können angegeben werden.
es: sólo se puede especificar -e o -n
fr: Vous pouvez spécifier uniquement -e ou -n.
ja: 指定できるのは -e または -n だけです
ru: допускаются только параметры -e или -n.

source: open requires one package name
ca: obrir necessita el nom d'un paquet
de: open erfordert einen Paketnamen
es: open necesita un nombre de paquete
fr: La commande open nécessite un nom de package.
ja: open ではパッケージ名を 1 つ指定する必要があります
ru: для команды открытия требуется одно имя пакета

source: append requires one package name
de: 'append' erfordert einen Paketnamen
es: open requiere un nombre de paquete
fr: La commande append nécessite un nom de package.
ja: append ではパッケージ名を 1 つ指定する必要があります
ru: для команды добавления требуется одно имя пакета

source: No transaction ID specified using -t or in $PKG_TRANS_ID.
ca: No s'ha especificat cap ID de transacció utilitzant -t o a $PKG_TRANS_ID.
de: Keine Transaktions-ID angegeben mit -t oder in $PKG_TRANS_ID.
es: No se ha especificado un ID de transacción mediante -t o en $PKG_TRANS_ID.
fr: Aucun ID de transaction spécifié avec -t ou dans $PKG_TRANS_ID.
ja: -t の使用時、または $PKG_TRANS_ID でトランザクション ID が指定されていません。
ru: Не указан идентификатор транзакции параметром -t или переменной $PKG_TRANS_ID.

source: No transaction ID specified in $PKG_TRANS_ID
ca: No s'ha especificat cap ID de transacció a $PKG_TRANS_ID.
de: Keine Transaktions-ID in $PKG_TRANS_ID angegeben
es: No se ha especificado ID de transacción en $PKG_TRANS_ID
fr: Aucun ID de transaction spécifié dans $PKG_TRANS_ID
ja: $PKG_TRANS_ID にトランザクション ID が指定されていません
ru: В $PKG_TRANS_ID не указан идентификатор транзакции

source: No arguments specified for subcommand.
ca: No s'han especificat arguments per a la subcomada.
de: Für den Unterbefehl wurden keine Argumente angegeben.
es: No se han especificado argumentos para el subcomando.
fr: Aucun argument spécifié pour la sous-commande.
ja: サブコマンドに引数が指定されていません。
ru: Не указаны аргументы субкоманды.

source: invalid action for publication: {0}
de: Ungültige Aktion für Veröffentlichung: {0}
es: acción no válida para la publicación: {0}
fr: action non valide pour la publication : {0}
ja: 発行のアクションが無効です: {0}

source: A destination package repository must be provided using -s.
de: Ein Ziel-Repository für ein Paket muss mithilfe der Option -s angegeben werden.
es: Se debe proporcionar un repositorio de paquete de destino mediante -s.
fr: Un référentiel de package de destination doit être indiqué à l'aide de -s.
ja: 保存先のパッケージリポジトリを -s を使用して指定する必要があります。

source: File {filename} line {lineno}: {err}
de: Datei: {filename} Zeile {lineno}: {err}
es: Archivo {filename} línea {lineno}: {err}
fr: Fichier {filename} ligne {lineno} : {err}
ja: ファイル {filename} 行 {lineno}: {err}

source: The pkg.fmri attribute '{0}' in the package manifest must include a version.
de: Das pkg.fmri-Attribut '{0}' im Paketmanifest muss eine Version enthalten.
es: El atributo pkg.fmri '{0}' del manifiesto de paquete debe incluir una versión.
fr: L'attribut pkg.fmri '{0}' dans le manifeste du package doit inclure une version.
ja: パッケージマニフェストの pkg.fmri 属性 '{0}' にはバージョンが含まれている必要があります。

source: Manifest does not set pkg.fmri
de: Manifest legt pkg.fmri nicht fest
es: El manifiesto no establece pkg.fmri
fr: Le manifeste ne définit pas pkg.fmri
ja: マニフェストは pkg.fmri を設定していません

source: WARNING: Omitting signature action '{0}'
de: Warnung: Signaturaktion '{0}' wird ausgelassen
es: ADVERTENCIA: omitiendo acción de firma '{0}'
fr: AVERTISSEMENT : omission de l'action de signature '{0}'
ja: 警告: 署名アクション '{0}' を省略します

source: illegal {cmd} option -- {opt}
de: Unzulässige {cmd}-Option -- {opt}
es: opción {cmd} no permitida: {opt}
fr: Option {cmd} non admise -- {opt}
ja: 不正な {cmd} オプション -- {opt}
