Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Unable to determine the updates needed for the catalog using the provided catalog update data in '%s'. The specified catalog updates are for an older version of the catalog and cannot be used.
ca: No es poden determinar les actualitzacions necessàries pel catàleg utilitzant les dades d'actualització proporcionades en '%s'. Les actualitzacions de catàleg especificades són per a una versió antiga del catàleg i no poden utilitzar-se.
ru: Невозможно определить обновления, необходимые для каталога, с помощью предоставленных данных обновления каталога в '%s'. Указанные обновления каталога предназначены для старой версии каталога и, следовательно, не могут быть использованы.

source: '%s' could not be found in the catalog.
ca: '%s' no pot ser trobat al catàleg.
ru: Не удалось найти '%s' в каталоге.

source: Unknown catalog update type '%s'
ca: Tipus d'actualització de catàleg desconegut '%s'
ru: Неизвестный тип обновления каталога '%s'

source: Unrecognized, unknown, or invalid CatalogPart '%s'
ca: CatalogPart no-reconegut, desconegut, o no-vàlid '%s'
ru: Нераспознаваемая, неизвестная или недопустимая часть каталога '%s'

source: %s (pattern did not match)
ca: %s (patró no coincideix)
ru: %s (шаблон не подходит)

source: %s (publisher did not match)
ca: %s (publicador no coincideix)
ru: %s (издатель не подходит)

source: %s (version did not match)
ca: %s (nersiṕ no coincideix)
ru: %s (версия не подходит)

source: The search at url %s returned no results.
ca: La cerca a la url %s no ha retornat resultats.
ru: Поиск по URL-адресу %s не дал результатов.

source: %s did not return a valid response.
ca: %s no ha retornat una resposta vàlida.
ru: %s не вернул допустимый ответ.

source: The provided p5i data is in an unrecognized format or does not contain valid publisher information: %s
ru: Предоставленные данные p5i имеют неизвестный формат или не содержат действительные сведения об издателе: %s

source: Error encountered while retrieving data from '%s': %s
ca: S'ha produït un error mentres s'estava rebent dades de '%s': %s
ru: Ошибка при извлечении данных из '%s': %s

source: Error encountered while retrieving data from: %s
ca: S'ha produït un error mentres s'obtenien dades de: %s
ru: Ошибка при извлечении данных из: %s

source: '%s' is not a valid location.
ca: '%s' no és una localització vàlida.
ru: '%s' не является допустимым местоположением.

source: '%s' is not a valid boot environment name.
ca: '%s' no és un nom d'entorn d'arranc vàlid.
ru: '%s' не является допустимым именем среды загрузки.

source: The boot environment '%s' already exists.
ca: L'entorn d'arranc '%s' ja existeix.
ru: Среда загрузки '%s' уже существует.

source: Boot environment naming during package install is not supported on this version of OpenSolaris. Please update without the --be-name option.
ca: El nomenament de l'entorn d'arranc durant l'instal·lació no està suportat en aquesta versió d'OpenSolaris. Si us plau utilitzeu update sense l'opció --be-name.
ru: Присвоение названий средам загрузки при установке пакетов не поддерживается в данной версии OpenSolaris. Выполните update без параметра --be-name.

source: A problem occurred while attempting to rename the boot environment currently named %(orig)s to %(dest)s.
ca: S'ha produït un error mentre s'intentava reanomenar l'entorn d'arranc actualment anomenat %(orig)s a %(dest)s.
ru: Проблема при попытке переименования среды загрузки с текущим именем %(orig)s в %(dest)s.

source: Unable to mount %(name)s at %(mt)s
ca: No es pot desmuntar %(name)s a %(mt)s
ru: Не удалось смонтировать %(name)s на %(mt)s

source: Publisher meta_root '%(root)s' is invalid; unable to complete operation: '%(op)s'.
ca: El meta_root del publicador '%(root)s' no és vàlid; no es pot completar l'operació: '%(op)s'.
ru: Издатель meta_root '%(root)s' является недопустимым; невозможно завершить операцию: '%(op)s'.

source: '%s' is not a valid publisher alias.
ru: '%s' не является допустимым псевдонимом издателя.

source: '%s' is not a valid publisher name.
ca: '%s' no és un nom de publicador vàlid.
ru: '%s' не является допустимым именем издателя.

source: '%(value)s' is not a valid value for repository attribute '%(attribute)s'.
ca: '%(value)s' no és un valor vàlid per l'atribut de repositori '%(attribute)s'.
ru: '%(value)s' не является допустимым значением параметра хранилища '%(attribute)s'.

source: '%s' is not a valid repository collection type.
ca: '%s' no és un tipus de col·lecció de repositori vàlid.
ru: '%s' не является допустимым типом набора хранилища.

source: '%s' is not a valid URI.
ca: '%s' no és una URI vàlida.
ru: '%s' не является допустимым идентификатором URI.

source: '%s' is not a valid URI priority; integer value expected.
ca: '%s' no és una prioritat URI vàlida. S'esperava un valor de tipus enter.
ru: '%s' не является допустимым значением приоритета URI; ожидается целочисленное значение.

source: '%s' is not a valid repository URI sort policy.
ca: '%s' no és una política d'ordenació URI vàlida.
ru: '%s' не является допустимой политикой сортировки URI хранилищ.

source: Publisher '%s' is disabled and cannot be used for packaging operations.
ca: L'ediror '%s' està deshabilitat i no pot utilitzar-se per a operacions d'empaquetament.
ru: Издатель'%s' отключен, и не может использоваться для работы с пакетами.

source: A publisher with the same name or alias as '%s' already exists.
ca: Ja existeix un publicador amb el mateix nom o àlies '%s'.
ru: Издатель с таким же именем или псевдонимом, что и '%s', уже существует.

source: A repository with the same name or origin URIs already exists for publisher '%s'.
ca: Un repositori amb el mateix nom o origen URI ja existeix pel publicador '%s'.
ru: Хранилище с таким же именем или идентификаторами URI источников уже существует для издателя '%s'.

source: Mirror '%s' already exists for the specified publisher.
ca: La rèplica '%s' ja existeix pel publicador especificat.
ru: Для указанного издателя уже существует зеркало '%s'.

source: Origin '%s' already exists for the specified publisher.
ca: L'origen '%s' ja existeix pel publicador especificat.
ru: Для указанного издателя уже существует источник '%s'.

source: At least one origin is required for %s. You must add a new origin before attempting to remove the specified origin(s).
ca: Com a mínim es necessita un origen per a %s. Heu d'afegir l'origen abans d'intentar eliminar l'origen especificat.
ru: Для %s необходимо указать по крайней мере один источник. Перед попыткой удаления указанного источника или источников следует добавить дополнительный источник.

source: The preferred publisher cannot be removed.
ca: El publicador predeterminat no pot ser eliminat.
ru: Удаление предпочтительного издателя невозможно.

source: Publisher '%s' is disabled and cannot be set as the preferred publisher.
ca: El publicador '%s' està deshabilitat i no pot ser utilitzat com a publicador predeterminat.
ru: Издатель '%s' отключен, и его невозможно выбрать в качестве предпочтительного издателя.

source: The preferred publisher may not be disabled. Another publisher must be set as the preferred publisher before this publisher can be disabled.
ca: El publicador preferit no pot de ser deshabilitat. Un altre publicador ha de ser establert com a publicador preferit abans que el publicador pugui ser deshabilitat.
ru: Невозможно отключить предпочтительного издателя. Необходимо установить другого издателя в качестве предпочтительного до отключения этого издателя.

source: Unknown legal URI '%s'.
ca: URI legal desconegut '%s'.
ru: Неизвестный допустимый идентификатор URI '%s'.

source: Unknown publisher '%s'.
ca: Publicador desconegut '%s'.
ru: Неизвестный издатель '%s'.

source: The repository at %(location)s does not contain package data for %(unknown)s; only %(known)s. This is either because the repository location is not valid, or because the provided publisher does not match those known by the repository.
ru: Хранилище в %(location)s не содержит данные пакета для %(unknown)s; только для %(known)s. Это вызвано недействительностью местоположения хранилища или несоответствиемпредоставленного издателя издателю, известному хранилищу.

source: One or more of the repository origin(s) listed below contains package data for %(known)s; not %(unknown)s: %(origins)s This is either because one of the repository origins is not valid for this publisher, or because the list of known publishers retrieved from the repository origin does not match the client.
ru: Один или несколько источников хранилища, перечисленных ниже, содержат данные пакета для%(known)s; не для %(unknown)s: %(origins)s Это вызвано недействительностью одного из источников хранилища для данного издателя или несоответствием списка известных издателей из источника хранилищаклиенту.

source: The specified publisher repository does not contain any package data for %(unknown)s; only %(known)s.
ru: Указанный издатель не содержит данные пакета для %(unknown)s; только для %(known)s.

source: Unknown related URI '%s'.
ca: URI relacionat desconegut '%s'.
ru: Неизвестный связанный идентификатор URI '%s'.

source: Unknown repository '%s'.
ca: Repositori desconegut '%s'.
ru: Неизвестное хранилище '%s'.

source: Unknown repository mirror '%s'.
ca: Rèplica desconeguda '%s'.
ru: Неизвестное зеркало хранилища '%s'.

source: Publisher '%s' has no repositories that support the '%s' operation.
ca: El publicador '%s' no te repositoris que suportin l'acció '%s'.
ru: Издатель '%s' не имеет хранилищ, поддерживающих эту операцию '%s'.

source: Can not modify system repository using method '%s'.
ru: Невозможно изменить системное хранилище с использованием метода '%s'.

source: System repository does not support protocol '%s'.
ru: Системное хранилище не поддерживает протокол '%s'.

source: The package repository at %s does not provide publisher configuration information or the information provided is incomplete.
ru: Хранилище пакета в %s не предоставляет данные о настройках издателя или предоставленные данные являются неполными.

source: One of the package repository origins for %s does not provide publisher configuration information or the information provided is incomplete.
ru: Один из источников хранилища пакета для %s не предоставляет данные о настройке издателяили предоставленные сведения является неполной.

source: Unknown repository origin '%s'
ca: Origen del repositori desconegut '%s'.
ru: Неизвестный источник хранилища '%s'

source: The URI '%(uri)s' contains an unsupported scheme '%(scheme)s'.
ca: La URI '%(uri)s' conté un esquema no suportat '%(scheme)s'.
ru: Идентификатор URI '%(uri)s' содержит неподдерживаемую схему '%(scheme)s'.

source: The specified URI contains an unsupported scheme.
ca: La URI especificada conté un esquema no suportat.
ru: Указанный идентификатор URI содержит неподдерживаемую схему.

source: '%(attr)s' is not supported for '%(scheme)s'.
ca: '%(attr)s' no està suportat per '%(scheme)s'.
ru: '%(attr)s' не поддерживается для '%(scheme)s'.

source: The relevant signature action is found in %(pfmri)s and has a hash of %(hsh)s
ru: Релевантное действие подписи найдено в %(pfmri)s и содержит хэш %(hsh)s

source: The package involved is:%s
ru: Задействованный пакет: %s

source: The relevant signature action's value attribute is %s
ru: Атрибут значения релевантного действия подписи: %s

source: The signature action %(act)s was made using a version (%(ver)s) this version of pkg(7) doesn't understand.
ru: Действие подписи %(act)s выполнялось с использованием версии (%(ver)s), не распознаваемой данной версией pkg(7).

source: Certificate %s has been modified on disk. Its hash value is not what was expected.
ru: Сертификат %s был изменен на диске. Значение хэша не соответствует ожидаемому.

source: The certificate which issued this certificate:%(subj)s could not be found. The issuer is:%(issuer)s
ru: Не удалось найти сертификат, выпустивший этот сертификат:%(subj)s. Запрашивающая сторона:%(issuer)s

source: This certificate was revoked:%(cert)s for this reason: %(reason)s
ru: Этот сертификат аннулирован:%(cert)s по следующей причине: %(reason)s

source: A signature in %(pfmri)s could not be verified for this reason: %(reason)s The signature's hash is %(hash)s
ru: Не удалось проверить подпись в %(pfmri)s по причине: %(reason)s Хэш подписи: %(hash)s

source: The signature with this signature value: %(sigval)s could not be verified for this reason: %(reason)s
ru: Подпись с данным значением: %(sigval)s не удалось проверить по причине: %(reason)s

source: The policy for %(pub_str)s requires signatures to be present but no signature was found in %(fmri_str)s.
ru: Политика для %(pub_str)s требует существования подписей, однако в %(fmri_str)s отсутствуют подписи.

source: The policy for %(pub_str)s requires signatures to be present but no signature was found.
ru: Политика для %(pub_str)s требует существования подписей, однакоподпись не найдена.

source: The policy for %(pub_str)s requires certain CNs to be seen in a chain of trust. The following required names couldn't be found for this package:%(fmri_str)s. %(missing)s
ru: Политика для %(pub_str)s требует отображения нескольких CN в цепочке сертификатов. Не удалось найти следующие необходимые для пакета имена:%(fmri_str)s. %(missing)s

source: The policy for %(pub_str)s requires certain CNs to be seen in a chain of trust. The following required names couldn't be found. %(missing)s
ru: Политика для %(pub_str)s требует отображения нескольких CN в цепочке сертификатов. Не удалось найти следующие необходимые имена. %(missing)s

source: The certificate whose subject is %(cert)s could not be verified because it uses a critical extension that pkg5 cannot handle yet. Extension name:%(name)s Extension value:%(val)s
ru: Невозможно выполнить проверку сертификата с темой %(cert)s, поскольку он использует критическое расширение, которое невозможно обработать в pkg5. Имя расширения:%(name)s Значение расширения:%(val)s

source: Certificate '%(cert)s' for publisher '%(pub)s' needed to access '%(uri)s', has expired. Please install a valid certificate.
ca: El certificat '%(cert)s' pel publicador '%(pub)s' necessita accedir '%(uri)s', ha expirat. Si us plau instal·leu un certificat vàlid.
ru: Истек срок действия сертификата '%(cert)s' для издателя '%(pub)s, требуемого для доступа к '%(uri)s'. Установите действующий сертификат.

source: Certificate '%(cert)s' for publisher '%(pub)s', has expired. Please install a valid certificate.
ca: El certificat '%(cert)s', necessita accedir '%(pub)s', ha expirat. Si us plau instal·leu un certificat vàlid.
ru: Истек срок действия сертификата '%(cert)s' для издателя '%(pub)s'. Установитедействующий сертификат.

source: Certificate '%(cert)s', needed to access '%(uri)s', has expired. Please install a valid certificate.
ca: El certificat '%(cert)s', necessita accedir '%(uri)s', ha expirat. Si us plau instal·leu un certificat vàlid.
ru: Истек срок действия сертификата '%(cert)s', требуемого для доступа к '%(uri)s'. Установитедействующий сертификат.

source: Certificate '%s' has expired. Please install a valid certificate.
ca: El certificat '%s' ha expirat. Si us plau instal·leu un certificat vàlid.
ru: Истек срок действия сертификата '%s'. Установите действующий сертификат.

source: Certificate '%(cert)s' for publisher '%(pub)s', needed to access '%(uri)s', will expire in '%(days)s' days.
ca: El certificat '%(cert)s' pel publicador '%(pub)s', necessita accedir '%(uri)s', expirarà d'aquí '%(days)s' dies.
ru: Срок действия сертификата '%(cert)s' для издателя '%(pub)s', требуемого для доступа к '%(uri)s', закончится через '%(days)s' дней.

source: Certificate '%(cert)s' for publisher '%(pub)s' will expire in '%(days)s' days.
ca: El certificat '%(cert)s' pel publicador '%(pub)s' expirarà d'aquí '%(days)s' dies.
ru: Срок действия сертификата '%(cert)s' для издателя '%(pub)s' закончится через '%(days)s' дней.

source: Certificate '%(cert)s', needed to access '%(uri)s', will expire in '%(days)s' days.
ca: El certificat '%(cert)s', necessita accedir a '%(uri)s', expirarà d'aquí '%(days)s' dies.
ru: Срок действия сертификата '%(cert)s', требуемого для доступа к '%(uri)s', закончится через '%(days)s' дней.

source: Certificate '%(cert)s' will expire in '%(days)s' days.
ca: El certificat '%(cert)s' expirarà d'aquí a '%(days)s' dies.
ru: Срок действия сертификата '%(cert)s' закончится через '%(days)s' дней.

source: Certificate '%(cert)s' for publisher '%(pub)s', needed to access '%(uri)s', is invalid.
ca: El certificat '%(cert)s' pel publicador '%(pub)s', necessita accedir '%(uri)s', no és vàlida.
ru: Сертификат '%(cert)s' для издателя '%(pub)s', требуемый для доступа к '%(uri)s', является недействительным.

source: Certificate '%(cert)s' for publisher '%(pub)s' is invalid.
ca: El certificat '%(cert)s' pel publicador '%(pub)s' no es vàlid.
ru: Сертификат '%(cert)s' для издателя '%(pub)s' является недействительным.

source: Certificate '%(cert)s' needed to access '%(uri)s' is invalid.
ca: El certificat '%(cert)s' necessita accedir a '%(uri)s' no és vàlida.
ru: Сертификат '%(cert)s', требуемый для доступа к '%(uri)s', является недействительным.

source: Invalid certificate '%s'.
ca: Certificat no vàlid '%s'.
ru: Недействительный сертификат '%s'.

source: Unable to locate key '%(key)s' for publisher '%(pub)s' needed to access '%(uri)s'.
ca: No es pot localitzar la clau '%(key)s' pel publicador '%(pub)s' necessària per accedir a '%(uri)s'.
ru: Не обнаружен ключ '%(key)s' для издателя '%(pub)s', требуемый для доступа к '%(uri)s'.

source: Unable to locate key '%(key)s' for publisher '%(pub)s'.
ca: No es pot localitzar la clau '%(key)s' pel publicador '%(pub)s'.
ru: Не обнаружен ключ '%(key)s' для издателя '%(pub)s'.

source: Unable to locate key '%(key)s' needed to access '%(uri)s'.
ca: No es pot localitzar la clau'%(key)s' necessària per accedir a '%(uri)s'.
ru: Не обнаружен ключ '%(key)s', требуемый для доступа '%(uri)s'.

source: Unable to locate key '%s'.
ca: No es pot localitzar la clau '%s'.
ru: Не обнаружен ключ '%s'.

source: Unable to locate certificate '%(cert)s' for publisher '%(pub)s' needed to access '%(uri)s'.
ca: No es pot localitzar el certificat '%(cert)s' per al publicador '%(pub)s' necessari per a accedir a '%(uri)s'.
ru: Не обнаружен сертификат '%(cert)s' для издателя '%(pub)s', требуемый для доступа к '%(uri)s'.

source: Unable to locate certificate '%(cert)s' for publisher '%(pub)s'.
ca: No es pot localitzar el certificat '%(cert)s' pel publicador '%(pub)s'.
ru: Не обнаружен сертификат '%(cert)s' для издателя '%(pub)s'.

source: Unable to locate certificate '%(cert)s' needed to access '%(uri)s'.
ca: No es pot localitzar el certificat '%(cert)s' necessita accedir a '%(uri)s'.
ru: Не обнаружен сертификат '%(cert)s', требуемый для доступа к '%(uri)s'.

source: Unable to locate certificate '%s'.
ca: No es pot localitzar el certificat '%s'.
ru: Не обнаружен сертификат '%s'.

source: Certificate '%(cert)s' for publisher '%(pub)s', needed to access '%(uri)s', has a future effective date.
ca: El certificat '%(cert)s' pel publicador '%(pub)s', necessita accedir a '%(uri)s', té una futura data efectiva.
ru: Дата вступления в силу сертификата '%(cert)s' для издателя '%(pub)s', требуемого для доступа к '%(uri)s', находится в будущем.

source: Certificate '%(cert)s' for publisher '%(pub)s' has a future effective date.
ca: El certificat '%(cert)s' pel publicador '%(pub)s' té una futura data efectiva.
ru: Дата вступления в силу сертификата '%(cert)s' для издателя '%(pub)s' находится в будущем.

source: Certificate '%(cert)s' needed to access '%(uri)s' has a future effective date.
ca: El certificat '%(cert)s' necessita accedir a '%(uri)s' té una futura data efectiva.
ru: Дата вступления в силу сертификата '%(cert)s', требуемого для доступа к '%(uri)s', находится в будущем.

source: Certificate '%s' has a future effective date.
ca: El certificat '%s' té una futura data efectiva.
ru: Дата вступления в силу сертификата '%s' находится в будущем.

source: Gave a bad response:%s
ca: Ha donat una resposta dolenta:%s
ru: Некорректный ответ:%s

source: Could not find %s
ca: No es pot trobar %s
ru: Не удалось найти %s

source: The signature data for the manifest of the '%s' package is not valid.
ca: Les dades de signatura del manifest del paquet '%s' no són vàlides.
ru: Данные подписи для манифеста пакета '%s' являются недопустимыми.

source: there is already an image at: %s. To override, use the -f (force) option.
ca: aquí ja hi ha una imatge: %s. Per a sobreescriure-la, utilitzeu l'opció -f (forçar).
ru: образ уже находится по адресу: %s. Для перезаписи используйте параметр -f (force).

source: the specified image path is not empty: %s. To override, use the -f (force) option.
ca: la ruta de a imatge especificada no està buida: %s. Per a sobreescriure-la, utilitzeu l'opció -f (forçar).
ru: указанный путь к образу не является пустым: %s. Для перезаписи используйте параметр -f (force).

source: pkg: A system error %(e)s was caught executing %(cmd)s
ca: pkg: S'ha capturat un error de sistema %(e)s executant %(cmd)s
ru: pkg: произошла системная ошибка %(e)s при выполнении %(cmd)s

source: pkg: '%(cmd)s' failed. with a return code of %(ret)d.
ca: pkg: '%(cmd)s' error. amb un codi de retorn %(ret)d.
ru: pkg: '%(cmd)s' сбой. с кодом возврата %(ret)d.

source: pkg: unable to activate %s
ca: pkg: no puc activar %s
ru: pkg: невозможно активировать %s

source: unable to unmount BE %(be_name)s mounted at %(be_path)s
ru: невозможно размонтировать загрузочную среду %(be_name)s, смонтированную в %(be_path)s

source: A clone of %s exists and has been updated and activated. On the next boot the Boot Environment %s will be mounted on '/'. Reboot when ready to switch to this updated BE.
ca: Un clon de %s existeix i ha set actualitzat i activat. Al següent arranc de l'entorn d'arranc %s serà muntat a '/'. Reinicieu quan desitgeu per a activar aquest entorn d'arranc actualitzat.
ru: Клон %s существует, он был обновлен и активирован. Во время следующей загрузки загрузочная среда %s будет смонтирована в '/'. Выполните перезагрузку, когда будете готовы переключиться на обновленную загрузочную среду.

source: %s has been updated successfully
ca: %s ha estat actualitzat correctament
ru: Обновление %s выполнено успешно

source: The running system has not been modified. Modifications were only made to a clone of the running system. This clone is mounted at %s should you wish to inspect it.
ca: El sistema que s'esta executant no ha estat modificat. Les modificacions solament es van fer a un clon del sistema que s'esta executant. Aquest clon està muntat a %s potser desitgeu inspeccionar-lo.
ru: Работающая система не изменена. Изменения были внесены только в копию работающей системы. Данная копия смонтирована по адресу %s, если необходимо ее проверить.

source: pkg: unable to rollback BE %s and restore image
ca: pkg: no es pot revocar l'entorn d'arranc %s i restaurar l'imatge
ru: pkg: невозможно выполнить откат загрузочной среды %s и восстановить образ

source: %s failed to be updated. No changes have been made to %s.
ca: %s Error al ser actualitzat. No s'ha fet canvis a %s.
ru: %s обновить не удалось. В %s не внесено никаких изменений.

source: pkg: unable to destroy snapshot %s
ca: pkg: no es pot destruir l'instantània %s
ru: pkg: невозможно уничтожить снимок %s

source: pkg: unable to create BE %s
ca: pkg: no es pot crear l'Entorn d'arranc %s
ru: pkg: невозможно создать загрузочную среду %s

source: pkg: unable to mount BE %(name)s on %(clone_dir)s
ca: pkg: no es pot muntar l'Entorn d'arranc %(name)s a %(clone_dir)s
ru: pkg: невозможно смонтировать загрузочную среду %(name)s на %(clone_dir)s
