Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Unknown img_path type.
ca: Tipus img_path desconegut.
de: Unbekannter img_path-Typ.
es: Tipo img_path desconocido.
fr: Type img_path inconnu.
ja: 不明な img_path タイプ。
ru: Неизвестный тип img_path.

source: Skipping publisher metadata refresh;image rooted at {0} must have its format updated before a refresh can occur.
de: Aktualisierung der Herausgeber-Metadaten wird übersprungen. Das Format des Root-Abbilds in {0} muss aktualisiert werden, bevor eine Aktualisierung erfolgen kann.
es: Omitiendo refrescamiento de metadatos de editor; la imagen con raíz en {0} debe tener el formato actualizado antes de refrescar.
fr: Actualisation des métadonnées d'éditeur ignorée ; le format de l'image se trouvant à l'emplacement {0} doit être mis à jour avant l'actualisation.
ja: パブリッシャーメタデータのリフレッシュをスキップします。{0} をルートに持つイメージは、リフレッシュする前にその形式を更新する必要があります。

source: Start time must be older than finish time: {0}
de: Startzeit muss vor der Endzeit liegen: {0}
es: La hora de inicio debe ser anterior a la hora de finalización: {0}
fr: L'heure de début doit être antérieure à l'heure de fin : {0}
ja: 開始時間は終了時間よりも前である必要があります: {0}

source: No history entries found for {0}
de: Für {0} wurden keine Historieneinträge gefunden
es: No se encontraron entradas de historial para {0}
fr: Aucune entrée d'historique détectée pour {0}
ja: {0} の履歴エントリが見つかりません

source: Invalid time format '{0}'. Please use %Y-%m-%dT%H:%M:%S or %Y-%m-%dT%H:%M:%S-%Y-%m-%dT%H:%M:%S
de: Ungültiges Zeitformat '{0}'. Verwenden Sie %Y-%m-%dT%H:%M:%S oder %Y-%m-%dT%H:%M:%S-%Y-%m-%dT%H:%M:%S
es: Formato de fecha y hora no válido '{0}'. Utilice %Y-%m-%dT%H:%M:%S o %Y-%m-%dT%H:%M:%S-%Y-%m-%dT%H:%M:%S
fr: Format d'heure non valide '{0}'. Veuillez utiliser %Y-%m-%dT%H:%M:%S ou %Y-%m-%dT%H:%M:%S-%Y-%m-%dT%H:%M:%S
ja: 無効な時間形式 '{0}'。%Y-%m-%dT%H:%M:%S または %Y-%m-%dT%H:%M:%S-%Y-%m-%dT%H:%M:%S を使用してください

source: The pkg client api module can not be invoked from an setuid executable.
de: Das pkg-Client-API-Modul kann nicht von einer ausführbaren setuid-Datei aus aufgerufen werden.
es: No se puede invocar el módulo api del cliente pkg desde un setuid ejecutable.
fr: Le module api du client pkg ne peut pas être appelé depuis un exécutable setuid.
ja: pkg クライアント API モジュールを setuid 実行可能ファイルから起動できません。

source: The image cannot be modified as it is currently in use by another package client: {pid_name} on {host}, pid {pid}.
de: Das Image kann nicht geändert werden, da es derzeit von einem anderen Packageclient verwendet wird: {pid_name} auf {host}, pid {pid}.
es: La imagen no se puede modificar porque está siendo utilizada por otro cliente de paquete: {pid_name} en {host}, pid {pid}.
fr: L'image ne peut pas être modifiée car elle est actuellement utilisée par un autre client du package : {pid_name} sur {host}, pid {pid}.
ja: イメージは、次に示す別のパッケージクライアントで現在使用されているため変更できません: {host} 上の {pid_name}、pid {pid}。

source: The image cannot be modified as it is currently in use by another package client: {pid_name} on an unknown host, pid {pid}.
de: Das Image kann nicht geändert werden, da es derzeit von einem anderen Packageclient verwendet wird: {pid_name} auf einem unbekannten Host, pid {pid}.
es: La imagen no se puede modificar porque está siendo utilizada por otro cliente de paquete: {pid_name} en un host desconocido, pid {pid}.
fr: L'image ne peut pas être modifiée car elle est actuellement utilisée par un autre client du package : {pid_name} sur un hôte inconnu, pid {pid}.
ja: イメージは、次に示す別のパッケージクライアントで現在使用されているため変更できません: 不明なホスト上の {pid_name}、pid {pid}。

source: The image cannot be modified as it is currently in use by another package client: pid {pid} on {host}.
de: Das Image kann nicht geändert werden, da es derzeit von einem anderen Packageclient verwendet wird. pid {pid} auf {host}.
es: La imagen no se puede modificar porque está siendo utilizada por otro cliente de paquete: pid {pid} en {host}.
fr: L'image ne peut pas être modifiée car elle est actuellement utilisée par un autre client du package : pid {pid} sur {host}.
ja: イメージは、次に示す別のパッケージクライアントで現在使用されているため変更できません: {host} 上の pid {pid}。

source: The image cannot be modified as it is currently in use by another package client.
de: Das Abbild kann nicht geändert werden, da es derzeit von einem anderen Paket-Client verwendet wird.
es: La imagen no se puede modificar porque está siendo utilizada por otro cliente de paquete.
fr: L'image ne peut pas être modifiée car elle est actuellement utilisée par un autre client du package.
ja: イメージは、別のパッケージクライアントで現在使用されているため変更できません。
ru: Образ невозможно изменить, поскольку в настоящее время он используется другим клиентом пакета.

source: The image rooted at {0} is written in an older format and must be updated before the requested operation can be performed.
de: Das Root-Abbild in {0} weist ein älteres Format auf und muss aktualisiert werden, um den angeforderten Vorgang ausführen zu können.
es: La imagen con raíz en {0} está escrita en un formato anterior y se debe actualizar para poder llevar a cabo la operación solicitada.
fr: L'image qui se trouve à l'emplacement {0} est écrite dans un format antérieur et doit être mise à jour afin que l'opération requise puisse être exécutée.
ja: {0} をルートに持つイメージは古い形式で書き込まれているため、要求された操作を実行する前に更新する必要があります。

source: Insufficient disk space available ({avail}) for estimated need ({needed}) for {use}
de: Nicht genügend Speicherplatz ({avail}) für benötigten Platz ({needed}) für {use}
es: Espacio disponible en el disco no suficiente ({avail}) para la necesidad estimada ({needed}) de {use}
fr: Espace disque disponible ({avail}) insuffisant par rapport à l'espace requis estimé ({needed}) pour {use}
ja: 使用可能なディスク容量 ({avail}) は、{use} に必要な推定容量 ({needed}) に対して不足しています

source: The requested operation cannot be completed due to invalid package metadata. Details follow: {0}
de: Der angeforderte Vorgang kann aufgrund ungültiger Paket-Metadaten nicht abgeschlossen werden. Details folgen: {0}
es: La operación solicitada no se puede completar debido a la presencia de metadatos de paquete no válidos. Detalles: {0}
fr: L'opération demandée ne peut pas être effectuée en raison de métadonnées non valides. Les détails sont les suivants : {0}
ja: パッケージのメタデータが無効なので、要求された操作を完了できません。詳細は次のとおりです: {0}

source: Package: {0}
es: Paquete: {0}
ja: パッケージ: {0}

source: License requires acceptance.
ca: La llicència ha d'acceptar-se.
de: Lizenz muss akzeptiert werden.
es: Es necesario aceptar la licencia.
fr: La licence nécessite une acceptation.
ja: ライセンスに同意する必要があります。
ru: Лицензию требуется принять.

source: License must be viewed.
ca: La llicència ha de ser visualitzada.
de: Lizenz muss gelesen werden.
es: Se debe ver la licencia.
fr: La licence doit être lue.
ja: ライセンスに目を通す必要があります。
ru: Лицензию требуется просмотреть.

source: The plan for the current operation is no longer valid. The image has likely been modified by another process or client. Please try the operation again.
de: Der Plan für den aktuellen Vorgang ist nicht mehr gültig. Das Abbild wurde möglicherweise von einem anderen Vorgang oder Client geändert. Wiederholen Sie den Vorgang.
es: El plan para la operación actual ya no es válido. Es posible que otro proceso o cliente haya modificado la imagen. Vuelva a realizar la operación.
fr: Le plan de l'opération actuelle n'est plus valide. L'image a très probablement été modifiée par un autre processus ou un autre client. Veuillez retenter l'opération.
ja: 現在の操作の計画は有効でなくなりました。別のプロセスまたはクライアントによってイメージが変更されている可能性があります。操作をやり直してください。
ru: План текущей операции больше не действителен. Образ, возможно, изменен другим процессом или клиентом. Попытайтесь выполнить операцию повторно.

source: Invalid package state change attempted '{states}' for package '{fmri}'.
de: Ungültige Änderung von Packagestatus '{states}' für Package '{fmri}' versucht.
es: Se intentó un cambio de estado de paquete no válido '{states}' para el paquete '{fmri}'.
fr: Tentative de modification incorrecte de l'état du package '{states}' pour le package '{fmri}'.
ja: パッケージ '{fmri}' に対する状態 '{states}' の変更は無効です。

source: pkg(7) out of date
de: pkg(7) ist veraltet
es: pkg(7) obsoleto
fr: pkg(7) obsolète
ja: pkg(7) は最新ではありません

source: Requested operation cannot be performed in live image.
de: Der angeforderte Vorgang kann bei einem Live-Abbild nicht ausgeführt werden.
es: No se puede realizar la operación solicitada en una imagen activa.
fr: Impossible d'effectuer l'opération demandée dans une image live.
ja: 要求された操作はライブイメージ内では実行できません。

source: Could not operate on {0} because of insufficient permissions. Please try the command again as a privileged user.
de: Für {0} konnte aufgrund unzureichender Berechtigungen kein Vorgang ausgeführt werden. Führen Sie den Befehl als privilegierter Benutzer erneut aus.
es: No se pudo operar en {0} debido a un número insuficiente de permisos. Vuelva a intentar ejecutar el comando como usuario con privilegios.
fr: Impossible d'effectuer l'opération sur {0} car les autorisations sont insuffisantes. Essayez d'exécuter à nouveau la commande en tant qu'utilisateur privilégié.
ja: アクセス権が十分でないため {0} を 操作できませんでした。特権ユーザーとしてしてコマンドを再試行してください。

source: Could not complete the operation because of insufficient permissions. Please try the command again as a privileged user.
de: Der Vorgang konnte aufgrund unzureichender Berechtigungen nicht abgeschlossen werden. Führen Sie den Befehl als privilegierter Benutzer erneut aus.
es: No es posible completar la operación debido a un número insuficiente de permisos. Intente ejecutar el comando de nuevo como usuario con privilegios.
fr: Impossible de terminer l'opération car les autorisations sont insuffisantes. Esasyez d'exécuter à nouveau la commande en tant qu'utilisateur privilégié.
ja: アクセス権が十分でないため操作を完了できませんでした。 特権ユーザーとしてしてコマンドを再試行してください。

source: Could not operate on {0} because the file is in use. Please stop using the file and try the operation again.
de: Vorgang für {0} konnte nicht durchgeführt werden, weil die Datei verwendet wird. Schließen Sie die Datei, und führen Sie den Vorgang erneut aus.
es: No se pudo operar en {0} debido a que el archivo está en uso. Deje de usar el archivo y vuelva a intentar realizar la operación.
fr: Impossible d'effectuer l'opération sur {0} car le fichier est en cours d'utilisation. Fermez le fichier et tentez de nouveau l'opération.
ja: ファイルが使用中のため {0} を 操作できませんでした。ファイルの使用を中止し、 操作を再試行してください。

source: Insufficient access to complete the requested operation. Please try the operation again as a privileged user.
de: Der angeforderten Vorgang konnte aufgrund unzureichenden Zugriffs nicht abgeschlossen werden. Führen Sie den Vorgang als privilegierter Benutzer erneut aus.
es: Acceso insuficiente para completar la operación solicitada. Intente realizar la operación de nuevo como usuario con privilegios.
fr: Accès insuffisant pour terminer l'opération demandée. Retentez l'opération en tant qu'utilisateur privilégié.
ja: アクセス権が十分でないため、要求された操作を完了できませんでした。 特権ユーザーとして操作を再試行してください。

source: Could not complete the operation on {0}: read-only filesystem.
de: Der Vorgang für {0} konnte nicht abgeschlossen werden: Schreibgeschütztes Dateisystem.
es: No se ha podido completar la operación en {0}: el sistema de archivos es de sólo lectura.
fr: Impossible de terminer l'opération sur {0} : système de fichiers en lecture seule.
ja: {0} 上での操作を完了できませんでした: ファイルシステムは読み取り専用です。

source: Could not complete the operation: read-only filesystem.
ca: No es pot completar l'operació: sistema de fitxers de només-lectura.
de: Der Vorgang konnte nicht abgeschlossen werden: Schreibgeschütztes Dateisystem.
es: No se pudo completar la operación: el sistema de archivos es de sólo lectura.
fr: Impossible de terminer l'opération : système de fichiers en lecture seule.
ja: 操作を完了できませんでした: ファイルシステムは読み取り専用です。
ru: Не удалось выполнить операцию: файловая система доступна только для чтения.

source: Unable to obtain or operate on lock at {0}. Please try the operation again as a privileged user.
de: Die Sperre bei {0} konnte nicht abgerufen werden, oder der Vorgang konnte für die Sperre nicht ausgeführt werden. Führen Sie den Vorgang als privilegierter Benutzer erneut aus.
es: No se puede obtener el bloqueo u operar con el bloqueo en {0}. Intente realizar la operación de nuevo como usuario con privilegios.
fr: Impossible d'obtenir ou de faire fonctionner le verrouillage dans {0}. Retentez l'opération en tant qu'utilisateur privilégié.
ja: {0} のロックを取得できないか、操作を実行できません。 特権ユーザーとして操作を再試行してください。

source: The following pattern(s) did not match any packages:
de: Die folgenden Muster entsprechen keinem der Pakete:
es: Los siguientes modelos no coinciden con ningún paquete:
fr: Le ou les modèles suivants ne correspondent à aucun package :
ja: 次のパターンはどのパッケージにも一致しませんでした:

source: '{0}' matches multiple packages
de: '{0}' entspricht mehreren Packages
es: '{0}' coincide con varios paquetes
fr: '{0}' correspond à plusieurs packages
ja: '{0}' は複数のパッケージに一致します

source: '{0}' is an illegal FMRI
de: '{0}' ist ein unzulässiger FMRI
es: '{0}' es un FMRI no válido
fr: '{0}' est un FMRI non autorisé
ja: '{0}' は不正な FMRI です

source: The following different patterns specify the same package(s):
de: Folgende andere Muster beziehen sich auf die gleichen Pakete:
es: Los siguientes modelos diferentes especifican el mismo paquete:
fr: Les différents modèles suivants caractérisent le ou les mêmes packages :
ja: 次の異なるパターンが同じパッケージを指定しています:

source: The files listed below were modified after operation planning was complete or were missing during plan execution; this may indicate an administrative issue or system configuration issue: {0}
de: Die unten aufgelisteten Dateien wurden nach Abschluss der Vorgangsplanung geändert oder fehlten bei der Planausführung. Dies kann auf ein administratives Problem oder Systemkonfigurationsproblem hinweisen: {0}
es: Los archivos que se muestran a continuación se modificaron después de finalizar la planificación de operaciones o no se encontraron durante la ejecución del plan; esto puede indicar un problema administrativo o de configuración del sistema: {0}
fr: Les fichiers listés ci-après ont été modifiés après la planification de l'opération ou étaient manquants pendant l'exécution du plan. Cela peut être dû à un problème d'administration ou de configuration du système : {0}
ja: 以下に示すファイルは、操作計画の完了後に変更されたか、または計画の実行中に見つかりませんでした: これは管理の問題またはシステム構成の問題を示している可能性があります: {0}

source: The following pattern(s) did not match any allowable packages. Try using a different matching pattern, or refreshing publisher information:
de: Die folgenden Muster entsprachen keinem der zugelassenen Pakete. Verwenden Sie ein anderes entsprechendes Muster, oder aktualisieren Sie die Herausgeberinformationen:
es: Los siguientes modelos no coinciden con ningún paquete permitido. Pruebe con otro modelo de coincidencia o refresque la información del editor:
fr: Le ou les modèles suivants ne correspondent à aucun package autorisé. Utilisez un autre modèle de correspondance ou actualisez les informations de l'éditeur :
ja: 次のパターンは許可されているどのパッケージにも一致しませんでした。 別のマッチングパターンを使用するか、パブリッシャー情報をリフレッシュしてください:

source: The following pattern(s) only matched packages rejected by user request. Try using a different matching pattern, or refreshing publisher information:
de: Die folgenden Muster entsprachen nur Paketen, die auf Anforderung des Benutzers zurückgewiesen wurden. Verwenden Sie ein anderes entsprechendes Muster, oder aktualisieren Sie die Herausgeberinformationen:
es: Los siguientes modeles sólo coincidieron con paquetes rechazados por solicitud del usuario. Pruebe con otro modelo de coincidencia o refresque la información del editor:
fr: Le ou les modèles suivants ne correspondent qu'à des packages rejetés sur demande de l'utilisateur. Utilisez un autre modèle de correspondance ou actualisez les informations de l'éditeur :
ja: 次のパターンはユーザーの要求によって拒否されたパッケージのみに一致しました。 別のマッチングパターンを使用するか、パブリッシャー情報をリフレッシュしてください:

source: The following pattern(s) only matched packages that are not available for the current image's architecture, zone type, and/or other variant:
de: Die folgenden Muster entsprechen nur Paketen, die für Architektur und Zonentyp des aktuellen Abbilds und/oder andere Varianten nicht verfügbar sind:
es: Los siguientes modelos sólo coinciden con paquetes que no están disponibles para la arquitectura, el tipo de zona u otras variantes de la imagen actual:
fr: Le(s) modèle(s) suivant(s) correspond(ent) uniquement aux packages non disponibles pour l'architecture, le type de zone et/ou d'autres variantes de l'image actuelle :
ja: 次のパターンは、現在のイメージの構造、ゾーンタイプ、および その他のバリアントに使用できないパッケージにのみ一致しました。

source: The following patterns only matched packages that are from publishers other than that which supplied the already installed version of this package
ca: Els següents patrons només coincideixen amb paquets d'altres publicadors no pas amb el publicador seleccionat que va proporcionar la versió d'aquest paquet ja instal·lat
de: Die folgenden Muster entsprechen nur Paketen, die von anderen Herausgebern stammen als dem, der die bereits installierte Version des Pakets herausgegeben hat.
es: Los siguientes modelos sólo coincidían con paquetes que proceden de editores distintos a los que suministraron la versión ya instalada de este paquete
fr: Les modèles suivants correspondent uniquement aux packages issus d'éditeurs autres que ceux ayant fourni la version déjà installée de ces packages.
ja: 次のパターンは、すでにインストール済みのこのパッケージのバージョンを提供したパブリッシャーとは異なる場所からのパッケージに一致します。
ru: Следующие шаблоны совпадают только с пакетами, издатель которых отличается от издателя, от которого была получена уже установленная версия пакета

source: '{0}' matches no installed packages
de: '{0}' entspricht keinem installierten Paket.
es: '{0}' no coincide con ningún paquete instalado
fr: '{0}' ne correspond à aucun package installé.
ja: '{0}' はどのインストール済みパッケージにも一致しません

source: '{0}' is an illegal fmri
de: '{0}' ist ein unzulässiger FMRI.
es: '{0}' es un fmri no permitido
fr: '{0}' est un FMRI non autorisé.
ja: '{0}' は不正な FMRI です

source: '{p}' supports the following architectures: {archs}
de: '{p}' unterstützt die folgenden Architekturen: {archs}
es: '{p}' admite las arquitecturas siguientes: {archs}
fr: '{p}' prend en charge les architectures suivantes : {archs}
ja: '{p}' は次のアーキテクチャーをサポートしています: {archs}

source: Image architecture is defined as: {0}
de: Abbildarchitektur ist definiert als: {0}
es: Arquitectura de imagen definida como: {0}
fr: L'architecture d'image est définie en tant que : {0}
ja: イメージのアーキテクチャーは次のように定義されています: {0}

source: '{p}' depends on obsolete package '{op}'
de: '{p}' hängt von veraltetem Package '{op}' ab
es: '{p}' depende del paquete obsoleto '{op}'
fr: '{p}' dépend du package obsolète '{op}'
ja: '{p}' は廃止されたパッケージ '{op}' に依存しています

source: The proposed operation can not be performed for the following package(s) as they are already installed:
ca: L'operació proposada no pot ser realitzada ja que aquests paquets ja estan instal·lats:
de: Der vorgeschlagene Vorgang kann für folgende Pakete nicht durchgeführt werden, da sie bereits installiert sind:
es: La operación propuesta no se puede realizar para los siguientes paquetes dado que ya están instalados:
fr: L'opération proposée ne peut pas être effectuée pour les packages suivants car ils sont déjà installés :
ja: 次のパッケージがすでにインストールされているため、この操作は実行できません:
ru: Предложенную операцию невозможно выполнить для следующих пакетов, так как они уже установлены:

source: The following mediations are not syntactically valid:
de: Folgende Vermittler sind in syntaktischer Hinsicht ungültig:
es: Las siguientes mediaciones no son válidas desde el punto de vista sintáctico:
fr: La syntaxe des médiateurs suivants n'est pas valide :
ja: 次の仲介は構文として有効ではありません:

source: The following patterns specify different versions of the same package(s):
de: Folgende Muster beziehen sich auf andere Versionen derselben Pakete:
es: Los siguientes patrones especifican versiones diferentes del mismo paquete:
fr: Les différents modèles suivants caractérisent différentes versions du ou des mêmes packages :
ja: 次のパターンは同じパッケージの異なるバージョンを指定します:

source: No solution was found to satisfy constraints
ca: No es va trobar cap solució que satisfés les restriccions
de: Es wurde keine Lösung gefunden, die die Einschränkungen erfüllt
es: No se encontró una solución que satisficiera las restricciones
fr: Aucune solution ne répond aux contraintes.
ja: 制約を満たす解決は見つかりませんでした
ru: Удовлетворение ограничений оказалось невозможным.

source: Syncing this linked image would require the following package updates:
de: Für die Synchronisation dieses verknüpften Abbilds sind die folgenden Paketaktualisierungen erforderlich:
es: Para sincronizar esta imagen enlazada, es necesario realizar las siguientes actualizaciones de paquetes:
fr: La synchronisation de cette image liée requiert les mises à jour de packages suivantes :
ja: このリンクされたイメージを同期するには、次のパッケージの更新が必要です:

source: The proposed operation on this parent image can not be performed because temporary origins were specified and this image has children. Please either retry the operation again without specifying any temporary origins, or if packages from additional origins are required, please configure those origins persistently.
de: Der vorgeschlagene Vorgang für dieses übergeordnete Abbild kann nicht ausgeführt werden, weil temporäre Ursprünge angegeben wurden und dieses Abbild über untergeordnete Abbilder verfügt. Führen Sie den Vorgang erneut aus, ohne temporäre Ursprünge anzugeben. Wenn jedoch Pakete von zusätzlichen Ursprüngen erforderlich sind, konfigurieren Sie diese Ursprünge dauerhaft.
es: La operación propuesta para esta imagen principal no se puede realizar porque se especificaron orígenes temporales y esta imagen tiene imágenes secundarias. Vuelva a realizar la operación sin especificar orígenes temporales o, si se necesitan paquetes de orígenes adicionales, configure esos orígenes continuamente.
fr: L'opération proposée sur cette image parente ne peut pas être effectuée car des origines temporaires ont été spécifiées et cette image a des enfants. Veuillez retenter l'opération sans spécifier d'origine temporaire ou, si des packages d'origines supplémentaires sont requis, configurez ces origines de manière permanente.
ja: 一時的な起点が指定され、このイメージに子があるため、この親イメージに対して提案 された操作を実行できませんでした。一時的な起点を指定せずにこの操作を再試行する か、追加の起点からのパッケージが必要な場合は、それらの起点を永続的に構成して ください。

source: Package {pkg} is missing a dependency: {dep}
de: Für Package {pkg} fehlt eine Abhängigkeit: {dep}
es: Falta una dependencia en el paquete {pkg}: {dep}
fr: Une dépendance est manquante dans le package {pkg} : {dep}
ja: パッケージ {pkg} は依存関係を欠いています: {dep}

source: The following files are not packaged in this image:
de: Folgende Dateien sind nicht in diesem Abbild gepackt:
es: Los siguientes archivos no están empaquetados en esta imagen:
fr: Les fichiers suivants ne sont pas inclus dans cette image :
ja: このイメージには次のファイルがパッケージされていません:

source: The following packages are already installed in this image; use uninstall to avoid these:
de: Folgende Pakete sind in diesem Abbild bereits installiert. Führen Sie eine Deinstallation aus, um diese auszuschließen:
es: Utilice la opción de desinstalación para los siguientes paquetes, que ya están instalados en esta imagen:
fr: Les packages suivants sont déjà installés dans cette image. Désinstallez-les afin de les éviter :
ja: このイメージには次のパッケージがすでにインストールされています。これらのパッケージを削除するにはアンインストールを使用します:

source: The following packages are a target of group dependencies; use install to unavoid these:
de: Folgende Pakete sind Ziel von Gruppenabhängigkeiten. Führen Sie eine Installation aus, um diese einzubeziehen:
es: Utilice la opción de instalación para los siguientes paquetes, que son un destino de las dependencias de grupos:
fr: Les packages suivants sont une cible de dépendances de groupe. Installez-les afin de ne pas les éviter :
ja: 次のパッケージはグループ依存性のターゲットです。これらのパッケージを使用するにはインストールを使用します:
