Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Usage: pkgrecv [-aknrv] [-s src_uri] [-d (path|dest_uri)] [-c cache_dir] [-m match] [--mog-file file_path ...] [--raw] [--key src_key --cert src_cert] [--dkey dest_key --dcert dest_cert] (fmri|pattern) ... pkgrecv [-s src_repo_uri] --newest pkgrecv [-nv] [-s src_repo_uri] [-d path] [-p publisher ...] [--key src_key --cert src_cert] --clone Options: -a Store the retrieved package data in a pkg(7) archive at the location specified by -d. The file may not already exist, and this option may only be used with filesystem-based destinations. -c cache_dir The path to a directory that will be used to cache downloaded content. If one is not supplied, the client will automatically pick a cache directory. In the case where a download is interrupted, and a cache directory was automatically chosen, use this option to resume the download. -d path_or_uri The filesystem path or URI of the target repository to republish packages to. The target must already exist. New repositories can be created using pkgrepo(1). -h Display this usage message. -k Keep the retrieved package content compressed, ignored when republishing. Should not be used with pkgsend. -m match Controls matching behaviour using the following values: all-timestamps (default) includes all matching timestamps (implies all-versions) all-versions includes all matching versions latest includes only the latest version of each package -n Perform a trial run with no changes made. -v Display verbose output. -p publisher Only clone the given publisher. Can be specified multiple times. Only valid with --clone. -r Recursively evaluates all dependencies for the provided list of packages and adds them to the list. -s src_repo_uri A URI representing the location of a pkg(7) repository to retrieve package data from. --clone Make an exact copy of the source repository. By default, the clone operation will only succeed if publishers in the source repository are also present in the destination. By using -p, the operation can be limited to specific publishers which will be added to the destination repository if not already present. Packages in the destination repository which are not in the source will be removed. Cloning will leave the destination repository altered in case of an error. --mog-file Specifies the path to a file containing pkgmogrify(1) transforms to be applied to every package before it is copied to the destination. A path of '-' can be specified to use stdin. This option can be specified multiple times. This option can not be combined with --clone. --newest List the most recent versions of the packages available from the specified repository and exit. (All other options except -s will be ignored.) --raw Retrieve and store the raw package data in a set of directory structures by stem and version at the location specified by -d. May only be used with filesystem- based destinations. --key src_key Specify a client SSL key file to use for pkg retrieval. --cert src_cert Specify a client SSL certificate file to use for pkg retrieval. --dkey dest_key Specify a client SSL key file to use for pkg publication. --dcert dest_cert Specify a client SSL certificate file to use for pkg publication. Environment: PKG_DEST Destination directory or URI PKG_SRC Source URI or path
de: Verwendung: pkgrecv [-aknrv] [-s src_uri] [-d (path|dest_uri)] [-c cache_dir] [-m match] [--mog-file file_path ...] [--raw] [--key src_key --cert src_cert] [--dkey dest_key --dcert dest_cert] (fmri|pattern) ... pkgrecv [-s src_repo_uri] --newest pkgrecv [-nv] [-s src_repo_uri] [-d path] [-p publisher ...] [--key src_key --cert src_cert] --clone Optionen: -a Speichern Sie die abgerufenen Packagedaten in einem pkg(7)-Archiv in dem mit -d angegebenen Verzeichnis. Die Datei darf nicht bereits vorhanden sein, und diese Option kann nur mit dateisystembasierten Zielen verwendet werden. -c cache_dir Der Pfad zu einem Verzeichnis, in dem heruntergeladene Inhalte gecacht werden. Wenn kein Verzeichnis angegeben wird, wählt der Client automatisch ein Cacheverzeichnis. Wenn in diesem Fall ein Download unterbrochen wird und ein Cacheverzeichnis automatisch gewählt wurde, verwenden Sie diese Option, um den Download wieder aufzunehmen. -d path_or_uri Der Dateisystempfad oder die URI des Ziel-Repositorys, in dem Packages erneut veröffentlicht werden sollen. Das Ziel muss bereits vorhanden sein. Neue Repositorys können mit pkgrepo(1) erstellt werden. -h Diese Verwendungsmeldung anzeigen. -k Belässt den abgerufenen Packageinhalt im komprimierten Status, wird bei der erneuten Veröffentlichung ignoriert. Darf nicht mit pkgsend verwendet werden. -m match Kontrolliert das Übereinstimmungsverhalten mit den folgenden Werten: all-timestamps (Standard) Umfasst alle übereinstimmenden Zeitstempel (impliziert all-versions) all-versions Umfasst alle übereinstimmenden Versionen latest Umfasst nur die letzte Version jedes Packages -n Führt einen Testlauf ohne Änderungen aus. -v Zeigt Ausgabe im Verbose-Modus an. -p publisher Klont nur den angegebenen Herausgeber. Kann mehrmals angegeben werden. Nur gültig mit --clone. -r Wertet alle Abhängigkeiten für die angegebene Packageliste aus und fügt diese zu der Liste hinzu. -s src_repo_uri Eine URI, die das Verzeichnis eines pkg(7)-Repositorys darstellt, aus dem Packagedaten abgerufen werden sollen. --clone Erstellt eine genaue Kopie des Quellverzeichnisses. Standardmäßig verläuft der Klonvorgang nur erfolgreich, wenn Herausgeber im Quell-Repository auch im Ziel-Repository vorhanden sind. Mit -p kann der Vorgang auf bestimmte Herausgeber begrenzt werden, die zu dem Ziel-Repository hinzugefügt werden, wenn sie noch nicht vorhanden sind. Packages im Ziel-Repository, die nicht im Quell-Repository vorhanden sind, werden entfernt. Das Klonen belässt das Ziel-Repository bei einem Fehler im geänderten Status. --mog-file Gibt den Pfad zu einer Datei an, die pkgmogrify(1)-Transformationen enthält, die für jedes Package angewendet werden müssen, bevor es in das Ziel kopiert wird. Ein Pfad von '-' kann angegeben werden, um stdin zu verwenden. Diese Option kann mehrmals angegeben werden. Diese Option kann nicht mit --clone kombiniert werden. --newest Führt die neuesten Versionen der Packages auf, die in dem angegebenen Repository verfügbar sind, und beendet den Vorgang. (Alle anderen Optionen, mit Ausnahme von -s werden ignoriert.) --raw Ruft die Raw-Packagedaten ab und speichert sie in einem Set von Verzeichnisstrukturen nach Stamm und Version in dem mit -d angegebenen Verzeichnis. Kann nur mit dateisystembasierten Zielen verwendet werden. --key src_key Gibt eine Client-SSL-Schlüsseldatei für den pkg-Abruf an. --cert src_cert Gibt eine Client-SSL-Zertifikatsdatei für den pkg-Abruf an. --dkey dest_key Gibt eine Client-SSL-Schlüsseldatei zur pkg-Veröffentlichung an. --dcert dest_cert Gibt eine Client-SSL-Zertifikatsdatei für die pkg-Veröffentlichung an. Umgebung: PKG_DEST Zielverzeichnis oder URI PKG_SRC Quell-URI oder Pfad
es: Sintaxis: pkgrecv [-aknrv] [-s src_uri] [-d (path|dest_uri)] [-c cache_dir] [-m match] [--mog-file file_path ...] [--raw] [--key src_key --cert src_cert] [--dkey dest_key --dcert dest_cert] (fmri|pattern) ... pkgrecv [-s src_repo_uri] --newest pkgrecv [-nv] [-s src_repo_uri] [-d path] [-p publisher ...] [--key src_key --cert src_cert] --clone Opciones: -a Almacena los datos del paquete recuperados en un archivo pkg(7) en la ubicación especificada por -d. Es posible que el archivo no exista y que esta opción solo se pueda utilizar con destinos basados en el sistema de archivos. -c cache_dir La ruta de un directorio que se utilizará para almacenar el contenido descargado en caché. Si no se suministra un directorio, el cliente selecciona automáticamente un directorio de caché. En el caso de que se interrumpa la descarga y se haya elegido automáticamente un directorio de caché, utilice esta opción para reanudar la descarga. -d path_or_uri El URI o la ruta del sistema de archivos del repositorio de destino en el que volverán a publicar los paquetes. El destino ya debe existir. Se pueden crear repositorios nuevos mediante pkgrepo(1). -h Muestra este mensaje de sintaxis. -k Mantiene comprimido el contenido del paquete recuperado; se omite al volver a publicar. No se debe utilizar con pkgsend. -m match Controla el comportamiento de las coincidencias mediante los valores siguientes: all-timestamps (default) incluye todas las marcas de hora coincidentes (afecta a todas las versiones) all-versions incluye todas las versiones coincidentes latest incluye solo las últimas versiones de cada paquete -n Lleva a cabo una ejecución de prueba sin realizar cambios. -v Muestra la salida detallada. -p publisher Solo se clona el editor especificado. Se puede especificar varias veces. Solo válido con --clone. -r Evalúa recursivamente todas las dependencias de la lista de paquetes proporcionada y las agrega a la lista. -s src_repo_uri Un URI que representa la ubicación de un repositorio pkg(7) del cual se pueden recuperar datos de paquete. --clone Crea una copia exacta del repositorio de origen. Por defecto, la operación de clonación finalizará correctamente solo si los editores del repositorio de origen también están presentes en el destino. Si se utiliza -p, la operación se puede limitar a editores específicos que se agregan al repositorio de destino si aún no están presentes. Los paquetes del repositorio de destino que no estén en el origen se eliminarán. La clonación dejará modificaciones en el repositorio de destino si se produce un error. --mog-file Especifica la ruta a un archivo que contiene las transformaciones de pkgmogrify(1) que se aplicarán a cada paquete antes de copiarlo en el destino. Se puede especificar una ruta de '-' para usar stdin. Esta opción se puede especificar varias veces. Esta opción se puede combinar con --clone. --newest Muestra las versiones más recientes de los paquetes disponibles en el repositorio especificado y se cierra. (Se omiten todas las opciones excepto -s). --raw Recupera y guarda los datos de paquetes sin procesar en un conjunto de estructuras de directorios, por recurso y versión, en la ubicación especificada por -d. Solo se puede utilizar con destinos basados en sistema de archivos. --key src_key Especifica el archivo de claves SSL de cliente que se utilizará para recuperar paquetes. --cert src_cert Especifica el archivo de certificados SSL de cliente que se utilizará para recuperar paquetes. --dkey dest_key Especifica el archivo de claves SSL de cliente que se utilizará para publicar paquetes. --dcert dest_cert Especifica el archivo de certificados SSL de cliente que se utilizará para publicar paquetes. Entorno: PKG_DEST URI o directorio de destino PKG_SRC Ruta o URI de origen
fr: Utilisation : pkgrecv [-aknrv] [-s src_uri] [-d (path|dest_uri)] [-c cache_dir] [-m match] [--mog-file file_path ...] [--raw] [--key src_key --cert src_cert] [--dkey dest_key --dcert dest_cert] (fmri|pattern) ... pkgrecv [-s src_repo_uri] --newest pkgrecv [-nv] [-s src_repo_uri] [-d path] [-p publisher ...] [--key src_key --cert src_cert] --clone Options : -a Stocke les données du package récupéré dans une archive pkg(7) à l'emplacement spécifié par -d. Le fichier n'existe peut-être pas encore et cette option peut uniquement être utilisée avec des destinations basées sur un système de fichiers. -c cache_dir Chemin d'un répertoire qui sera utilisé pour la mise en cache du contenu téléchargé. Si aucun chemin n'est fourni, le client choisit automatiquement un répertoire cache. Dans le cas où un téléchargement est interrompu et qu'un répertoire de cache a été automatiquement sélectionné, utilisez cette option pour reprendre le téléchargement. -d path_or_uri Chemin du système de fichiers ou URI du référentiel cible où les packages doivent être republiés. La cible doit déjà exister. De nouveaux référentiels peuvent être créés à l'aide de pkgrepo(1). -h Affiche ce message de syntaxe. -k Maintient la compression, ignore le contenu de package récupéré lors de la nouvelle publication. Ne doit pas être utilisé avec pkgsend. -m match Contrôle le comportement de correspondance à l'aide des valeurs suivantes : all-timestamps (par défaut) Inclut tous les horodatages correspondants (implique all-versions) all-versions Inclut toutes les versions correspondantes latest Inclut uniquement la version la plus récente de chaque package -n Effectue une série de tests sans apporter de modifications. -v Affiche la sortie en mode verbose. -p publisher Clone uniquement l'éditeur donné. Option pouvant être spécifiée plusieurs fois. Valide uniquement avec --clone. -r Evalue de manière récursive toutes les dépendances pour la liste de packages fournie et les ajoute à la liste. -s src_repo_uri URI représentant l'emplacement d'un référentiel pkg(7) à partir duquel récupérer les données de package. --clone Fait une copie exacte du référentiel source. Par défaut, l'opération de clonage réussit uniquement si les éditeurs du référentiel source sont également présents dans la destination. En utilisant -p, l'opération peut être limitée à des éditeurs spécifiques qui seront ajoutés au référentiel de destination s'ils ne sont pas déjà présents. Les packages du référentiel de destination qui ne sont pas présents dans la source seront supprimés. En cas d'erreur, le référentiel de destination sera altéré par l'opération de clonage. --mog-file Indique le chemin vers un fichier contenant les transformations pkgmogrify(1) à appliquer à chaque package avant de le copier vers la destination. Le chemin '-' peut être indiqué afin d'utiliser stdin. Cette option peut être spécifiée plusieurs fois. Cette option ne peut pas être associée à --clone. --newest Répertorie les dernières versions des packages disponibles depuis le référentiel, puis quitte. (Toutes les autres options seront ignorées, sauf -s.) --raw Récupère et stocke les données brutes de package dans un ensemble de structures de répertoire par racine et version à l'emplacement spécifié par -d. Peut uniquement être utilisé avec des destinations basées sur un système de fichiers. --key src_key Spécifie un fichier clé SSL client à utiliser pour la récupération de package. --cert src_cert Spécifie un fichier de certificat SSL client à utiliser pour la récupération de package. --dkey dest_key Spécifie un fichier clé SSL client SSL à utiliser pour la publication de package. --dcert dest_cert Spécifie un fichier de certificat SSL client pour la publication de package. Environnement : PKG_DEST URI ou répertoire de destination PKG_SRC URI ou chemin source
ja: 使用方法: pkgrecv [-aknrv] [-s src_uri] [-d (path|dest_uri)] [-c cache_dir] [-m match] [--mog-file file_path ...] [--raw] [--key src_key --cert src_cert] [--dkey dest_key --dcert dest_cert] (fmri|pattern) ... pkgrecv [-s src_repo_uri] --newest pkgrecv [-nv] [-s src_repo_uri] [-d path] [-p publisher ...] [--key src_key --cert src_cert] --clone オプション: -a 取得されたパッケージデータを、-d オプションで指定された 場所にある pkg(7) アーカイブ内に格納します。ファイルはま だ存在していないことがあり、このオプションはファイルシス テムベースの宛先とともに使用できます。 -c cache_dir ダウンロードされたコンテンツをキャッシュするために使用さ れるディレクトリへのパス。ディレクトリが指定されない場合 は、クライアントによってキャッシュディレクトリが自動的に 選択されます。ダウンロードが中断されたときに、キャッシュ ディレクトリが自動的に選択されていた場合は、このオプショ ンを使用してダウンロードを再開します。 -d path_or_uri パッケージを再発行するターゲットリポジトリのファイルシス テムパスまたは URI。ターゲットはすでに存在している必要が あります。pkgrepo(1) を使用して新しいリポジトリを作成で きます。 -h この使用方法のメッセージを表示します。 -k 取得されたパッケージの内容を圧縮したままにし、再発行のと きに無視します。pkgsend と一緒に使用しないようにしてくだ さい。 -m match 次の値を使用して、マッチング動作を制御します。 all-timestamps (default) 一致するすべてのタイムスタンプを含めます (all-ve rsions が暗黙的に指定されます) all-versions 一致するすべてのバージョンを含めます latest 各パッケージの最新バージョンのみ含めます -n 変更を行うことなく、試験実行を行います。 -v 詳細な出力を表示します。 -p publisher 指定されたパブリッシャーのみ複製します。複数回指定できま す。--clone と同時に使用する場合のみ有効です。 -r 提供されたパッケージリストのすべての依存関係を再帰的に評 価し、これらをリストに追加します。 -s src_repo_uri パッケージデータの取得元の pkg(7) リポジトリの場所を表す URI。 --clone ソースリポジトリの同一のコピーを作成します。デフォルトで は、クローン操作はソースリポジトリ内のパブリッシャーが宛 先にも存在する場合のみ成功します。-p を使用することによ って、操作を特定のパブリッシャーに限定することができ、パ ブリッシャーが宛先リポジトリにまだ存在しない場合は追加さ れます。宛先リポジトリ内のパッケージはソースに存在しない 場合、削除されます。クローン操作でエラーが発生した場合、 宛先リポジトリは変更されたままになります。 --mog-file パッケージが宛先にコピーされる前にすべてのパッケージに適 用される pkgmogrify(1) 変換を含むファイルへのパスを指定 します。パス '-' を指定して stdin を使用できます。このオ プションは複数回指定できます。このオプションは --clone と組み合わせることができません。 --newest 指定されたリポジトリから使用可能な最新バージョンのパッケ ージを一覧表示し、終了します。(-s を除くすべてのオプショ ンが無視されます。) --raw raw パッケージデータを取得し、-d で指定された場所に、幹 およびバージョンごとの一連のディレクトリ構造内に格納しま す。ファイルシステムベースの宛先でのみ使用できます。 --key src_key pkg 取得のために使用するクライアント SSL キーファイルを 指定します。 --cert src_cert pkg 取得のために使用するクライアント SSL 証明書ファイル を指定します。 --dkey dest_key pkg 公開のために使用するクライアント SSL キーファイルを 指定します。 --dcert dest_cert pkg 公開のために使用するクライアント SSL 証明書ファイ ルを指定します。 環境: PKG_DEST 宛先ディレクトリまたは URI PKG_SRC ソース URI またはパス

source: Cached files were preserved in the following directory: {0} Use pkgrecv -c to resume the interrupted download.
de: Die zwischengespeicherten Dateien befinden sich in dem folgenden Verzeichnis: {0} Verwenden Sie pkgrecv -c, um den unterbrochenen Download fortzusetzen.
es: Los archivos almacenados en caché se conservaron en el directorio siguiente: {0} Utilice pkgrecv -c para reanudar la descarga interrumpida.
fr: Des fichiers mis en cache ont été conservés dans le répertoire suivant : {0} Utilisez pkgrecv -c pour reprendre le téléchargement interrompu.
ja: キャッシュされたファイルは次のディレクトリに保存されました: {0} 中断されたダウンロードを再開するには、pkgrecv -c を使用します。

source: Unable to parse manifest '{mpath}' for package '{pfmri}'
de: Manifest '{mpath}' für Package '{pfmri}' kann nicht geparst werden
es: No se puede analizar el manifiesto '{mpath}' para el paquete '{pfmri}'
fr: Impossible d'analyser le manifeste '{mpath}' pour le package '{pfmri}'
ja: パッケージ '{pfmri}' のマニフェスト '{mpath}' を解析できません

source: Illegal option -- {0}
de: Unzulässige Option -- {0}
es: Opción no permitida: {0}
fr: Option non admise -- {0}
ja: 不正なオプション -- {0}

source: Illegal option value -- {0}
de: Unzulässiger Optionswert -- {0}
es: Valor de opción no permitido: {0}
fr: Valeur d'option non admise -- {0}
ja: 不正なオプション値 -- {0}

source: a destination must be provided
de: Ein Ziel muss angegeben werden
es: se debe proporcionar un destino
fr: une destination doit être indiquée
ja: 保存先を指定する必要があります

source: a source repository must be provided
ca: s'ha de proporcionar un repositori font
de: Es muss ein Quell-Repository angegeben werden
es: se debe proporcionar un repositorio de origen
fr: un référentiel source doit être indiqué
ja: ソースリポジトリを指定する必要があります
ru: необходимо указать хранилище исходного кода

source: --clone can not be used with -c. Content will be downloaded directly to the destination repository and re-downloading after a pkgrecv failure will not be required.
de: --clone kann nicht mit -c verwendet werden. Inhalt wird direkt in das Ziel-Repository heruntergeladen. Erneutes Herunterladen nach einem pkgrecv-Fehler ist nicht erforderlich.
es: --clone no se puede usar con -c. El contenido se descargará directamente en el repositorio de destino y no será necesario volver a descargarlo después de un error de pkgrecv.
fr: --clone ne peut pas être utilisé avec -c. Le contenu sera directement téléchargé vers le référentiel de destination et un nouveau téléchargement après un échec de pkgrecv ne sera pas nécessaire.
ja: --clone は -c と同時に使用できません。 内容は保存先のリポジトリに直接ダウンロードされるため、pkgrecv エラー後の再ダウンロードは必要ありません。

source: --clone can not be used with --raw.
de: --clone kann nicht mit --raw verwendet werden.
es: --clone no se puede usar con --raw.
fr: --clone ne peut pas être utilisé avec --raw.
ja: --clone は --raw と同時に使用できません。

source: --clone can not be used with -a.
de: --clone kann nicht mit -a verwendet werden.
es: --clone no se puede usar con -a.
fr: --clone ne peut pas être utilisé avec -a.
ja: --clone は -a と同時に使用できません。

source: --clone can not be used with --newest.
de: --clone kann nicht mit --newest verwendet werden.
es: --clone no se puede usar con --newest.
fr: --clone ne peut pas être utilisé avec --newest.
ja: --clone は --newest と同時に使用できません。

source: --clone does not support FMRI patterns
de: --clone unterstützt FMRI-Muster nicht
es: --clone no admite los patrones FMRI
fr: --le clone ne prend pas en charge les modèles FMRI
ja: --clone は FMRI パターンをサポートしていません

source: -p can only be used with --clone.
de: -p kann nur mit --clone verwendet werden.
es: -p sólo se puede usar con --clone.
fr: -p peut uniquement être utilisé avec --clone.
ja: -p は --clone と同時に指定した場合にのみ使用できます。

source: --mog-file can not be used with --clone.
de: --mog-file kann nicht mit --clone verwendet werden.
es: --mog-file no se puede usar con --clone.
fr: --mog-file ne peut pas être utilisé avec --clone.
ja: --mog-file は --clone と同時に使用できません。

source: Retrieving manifests for dependency evaluation ...
ca: Recuperant manifests per a la avaluació de dependències ...
de: Manifests für Evaluierung von Abhängigkeiten werden abgerufen...
es: Recuperando manifiestos para la evaluación de dependencias ...
fr: Récupération des manifestes pour l'évaluation de la dépendance...
ja: 依存関係の評価のためにマニフェストを取得しています...
ru: Извлечение манифестов для оценки зависимости...

source: Cannot write extra data {0}
de: Zusätzliche Daten {0} können nicht geschrieben werden
es: No se pueden escribir los datos adicionales {0}
fr: Impossible d'écrire des données supplémentaires {0}
ja: 追加のデータ {0} を書き込めません

source: Target archive '{0}' already exists.
de: Zielarchiv '{0}' ist bereits vorhanden.
es: El contenedor de destino '{0}' ya existe.
fr: L'archive cible '{0}' existe déjà.
ja: ターゲットアーカイブ '{0}' はすでに存在します。

source: Retrieving packages for publisher {0} ...
de: Pakete für Herausgeber {0} werden abgerufen...
es: Recuperando paquetes para el editor {0}...
fr: Extraction de packages pour l'éditeur {0}...
ja: パブリッシャー {0} のパッケージを取得しています...

source: must specify at least one pkgfmri
ca: heu d'especificar almenys un pkgfmri
de: muss mindestens ein pkgfmri angeben
es: se debe especificar al menos un pkgfmri
fr: doit spécifier au moins un pkgfmri
ja: pkgfmri は少なくとも 1 つ指定する必要があります
ru: необходимо указать хотя бы один pkgfmri

source: Retrieving and evaluating {0:d} package(s)...
de: {0:d} Pakete werden abgerufen und evaluiert...
es: Recuperando y evaluando {0:d} paquete(s)...
fr: Récupération et évaluation de package(s) {0:d}...
ja: {0:d} 個のパッケージを取得および評価しています...

source: Creating mogrified manifest failed: {0}
de: Mit Mogrify bearbeitetes Manifest konnte nicht erstellt werden: {0}
es: No se pudo crear el manifiesto de mogrify: {0}
fr: Echec de la création du manifeste mogrified : {0}
ja: 変換したマニフェストの作成に失敗しました: {0}

source: Archiving packages ...
de: Packages werden archiviert ...
es: Archivando paquetes...
fr: Archivage des packages...
ja: パッケージをアーカイブしています...

source: Archiving packages (dry-run) ...
de: Packages werden archiviert (Probelauf) ...
es: Archivando paquetes (ejecución simulada)...
fr: Archivage des packages (test)...
ja: パッケージをアーカイブしています (予行演習)...

source: Packages to add:
de: Hinzuzufügende Packages:
es: Paquetes que agregar:
fr: Packages à ajouter :
ja: 追加するパッケージ:

source: Files to retrieve:
de: Abzurufende Dateien:
es: Archivos que recuperar:
fr: Fichiers à récupérer :
ja: 取得するファイル:

source: Estimated transfer size:
de: Geschätzte Übertragungsgröße:
es: Tamaño de transferencia estimado:
fr: Taille de transfert estimée :
ja: 推定転送サイズ:

source: Packages to archive:
de: Zu archivierende Packages:
es: Paquetes que archivar:
fr: Packages à archiver :
ja: アーカイブするパッケージ:

source: One or more packages could not be retrieved: {0}
de: Mindestens ein Package konnte nicht abgerufen werden: {0}
es: Uno o más paquetes no se pudieron recuperar: {0}
fr: Un ou plusieurs packages n'ont pas pu être récupérés : {0}
ja: 1 つ以上のパッケージを取得できませんでした: {0}

source: Destination clone repository must be filesystem-based.
de: Zielklon-Repository muss auf einem Dateisystem basieren.
es: El repositorio de clonación de destino debe estar basado en sistema de archivos.
fr: Le référentiel clone de destination doit être basé sur un système de fichiers.
ja: 保存先のクローンリポジトリは、ファイルシステムベースである必要があります。
