Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Unable to locate key '{key}' needed to access '{uri}'.
de: Schlüssel '{key}' für den Zugriff auf '{uri}' kann nicht gefunden werden.
es: No se puede encontrar la clave '{key}' necesaria para acceder a '{uri}'.
fr: La clé '{key}' nécessaire pour accéder à '{uri}' est introuvable.
ja: '{uri}' へのアクセスに必要なキー '{key}' が見つかりません。

source: Unable to locate key '{0}'.
de: Schlüssel '{0}' wurde nicht gefunden.
es: No es posible encontrar la clave '{0}'.
fr: La clé '{0}' est introuvable.
ja: キー key '{0}' が見つかりません。

source: Unable to locate certificate '{cert}' for publisher '{pub}' needed to access '{uri}'.
de: Zertifikat '{cert}' für Herausgeber '{pub}' für den Zugriff auf '{uri}' kann nicht gefunden werden.
es: No se puede encontrar el certificado '{cert}' para el editor '{pub}' necesario para acceder a '{uri}'.
fr: Le certificat '{cert}' pour l'éditeur '{pub}' nécessaire pour accéder à '{uri}' est introuvable.
ja: '{uri}' へのアクセスに必要なパブリッシャー '{pub}' の証明書 '{cert}' が見つかりません。

source: Unable to locate certificate '{cert}' for publisher '{pub}'.
de: Zertifikat '{cert}' für Herausgeber '{pub}' kann nicht gefunden werden.
es: No se puede encontrar el certificado '{cert}' para el editor '{pub}'.
fr: Le certificat '{cert}' pour l'éditeur '{pub}' est introuvable.
ja: パブリッシャー '{pub}' の証明書 '{cert}' が見つかりません。

source: Unable to locate certificate '{cert}' needed to access '{uri}'.
de: Zertifikat '{cert}' für den Zugriff auf '{uri}' kann nicht gefunden werden.
es: No es posible encontrar el certificado '{cert}' necesario para acceder a '{uri}'.
fr: Le certificat '{cert}' nécessaire pour accéder à '{uri}' est introuvable.
ja: '{uri}' へのアクセスに必要な証明書 '{cert}' が見つかりません。

source: Unable to locate certificate '{0}'.
de: Zertifikat {0}' wurde nicht gefunden.
es: No es posible encontrar el certificado '{0}'.
fr: Le certificat '{0}' est introuvable.
ja: 証明書 '{0}' が見つかりません。

source: Certificate '{cert}' for publisher '{pub}', needed to access '{uri}', has a future effective date.
de: Zertifikat '{cert}' für Herausgeber '{pub}' für den Zugriff auf '{uri}' hat ein zukünftiges Gültigkeitsdatum.
es: El certificado '{cert}' para el editor '{pub}', necesario para acceder a '{uri}', tiene una fecha de entrada en vigor futura.
fr: Le certificat '{cert}' pour l'éditeur '{pub}', nécessaire pour accéder à '{uri}', n'est pas encore valide.
ja: '{uri}' へのアクセスに必要なパブリッシャー '{pub}' の証明書 '{cert}' の発効日が未来の日付になっています。

source: Certificate '{cert}' for publisher '{pub}' has a future effective date.
de: Zertifikat '{cert}' für Herausgeber '{pub}' hat ein zukünftiges Gültigkeitsdatum.
es: El certificado '{cert}' para el editor '{pub}' tiene una fecha de entrada en vigor futura.
fr: Le certificat '{cert}' pour l'éditeur '{pub}' n'est pas encore valide.
ja: パブリッシャー '{pub}' の証明書 '{cert}' の発効日が未来の日付になっています。

source: Certificate '{cert}' needed to access '{uri}' has a future effective date.
de: Zertifikat '{cert}' für den Zugriff auf '{uri}' hat ein zukünftiges Gültigkeitsdatum.
es: El certificado '{cert}' necesario para acceder a '{uri}' tiene una fecha de entrada en vigor futura.
fr: Le certificat '{cert}' nécessaire pour accéder à '{uri}' n'est pas encore valide.
ja: '{uri}' へのアクセスに必要な証明書 '{cert}' の発効日が未来の日付になっています。

source: Certificate '{0}' has a future effective date.
de: Das Gültigkeitsdatum des Zertifikats '{0}' liegt in der Zukunft.
es: El certificado '{0}' tiene una fecha de entrada en vigor futura.
fr: Le certificat '{0}' n'est pas encore valide.
ja: 証明書 '{0}' の発効日が未来の日付になっています。

source: Gave a bad response:{0}
de: Fehlerhafte Antwort:{0}
es: Ha proporcionado una respuesta incorrecta:{0}
fr: Mauvaise réponse obtenue : {0}
ja: 不正な応答でした:{0}

source: Could not find {0}
de: {0} nicht gefunden
es: No se pudo encontrar {0}
fr: {0} introuvable
ja: {0} が見つかりませんでした

source: The signature data for the manifest of the '{0}' package is not valid.
de: Die Signaturdaten für das Manifest von Paket '{0}' ist nicht gültig.
es: Los datos de firma del manifiesto del paquete '{0}' no son válidos.
fr: Les données de signature pour le manifeste du package '{0}' ne sont pas valides.
ja: '{0}' パッケージのマニフェストに対する署名日付が無効です。

source: The signature data for the manifest is not valid.
ca: Les dades de signatura del manifest no són vàlides.
de: Die Signaturdaten für das Manifest sind nicht gültig.
es: Los datos de firma del manifiesto no son válidos.
fr: Les données de signature pour le manifeste ne sont pas valides.
ja: マニフェストに対する署名日付が無効です。
ru: Данные подписи для манифеста являются недопустимыми.

source: there is already an image at: {0}. To override, use the -f (force) option.
de: Es ist bereits ein Image vorhanden unter: {0}. Verwenden Sie zum Überschreiben die Option -f (force).
es: ya hay una imagen en: {0}. Para anularla, utilice la opción -f (force).
fr: une image existe déjà à : {0}. Pour l'écraser, utilisez l'option -f (forcer).
ja: 次の場所にすでにイメージが存在します: {0}。 オーバーライドするには、-f (force) オプションを使用します。

source: The configuration data for the image rooted at {0} is empty or missing.
de: Die Konfigurationsdaten für das Root-Abbild in {0} sind leer oder nicht vorhanden.
es: Faltan los datos de configuración para la imagen con raíz en {0} o están vacíos.
fr: Les données de configuration pour l'image placée à l'emplacement {0} sont vides ou manquantes.
ja: {0} をルートに持つイメージの構成データが空であるか、存在しません。

source: The image rooted at {0} is invalid or is not supported by this version of the packaging system.
de: Das Root-Abbild in {0} ist ungültig oder wird von dieser Version des IPS nicht unterstützt.
es: La imagen con raíz en {0} no es válida o no se admite en esta versión del sistema de paquetes.
fr: L'image qui se trouve à l'emplacement {0} n'est pas valide ou n'est pas prise en charge par cette version du système d'empaquetage.
ja: {0} をルートに持つイメージが無効であるか、このバージョンのパッケージシステムでサポートされていません。

source: the specified image path is not empty: {0}. To override, use the -f (force) option.
de: Der angegebene Imagepfad ist nicht leer: {0}. Verwenden Sie zum Überschreiben die Option -f (force).
es: la ruta de imagen especificada no está vacía: {0}. Para anularla, utilice la opción -f (force).
fr: le chemin de l'image spécifié n'est pas vide : {0}. Pour l'écraser, utilisez l'option -f (forcer).
ja: 指定されたイメージのパスは空ではありません: {0}。 オーバーライドするには、-f (force) オプションを使用します。

source: Invalid linked image attach property: {0}
de: Ungültige attach-Eigenschaft des verknüpften Abbilds: {0}
es: Propiedad de conexión de imagen enlazada no válida: {0}
fr: Propriété d'image liée ATTACH incorrecte : {0}.
ja: リンクされたイメージの接続プロパティーが無効です: {0}

source: Invalid linked image attach property value: {0}
de: Ungültiger attach-Eigenschaftswert des verknüpften Abbilds: {0}
es: Valor de propiedad de conexión de imagen enlazada no válido: {0}
fr: Valeur de propriété d'image liée ATTACH incorrecte : {0}.
ja: リンクされたイメージの接続プロパティーの値が無効です: {0}

source: Linked image type does not support child attach: {0}
de: Der Typ des verknüpften Abbilds unterstützt nicht das Anhängen des untergeordneten Abbilds: {0}
es: El tipo de imagen enlazada no admite conexión de imagen secundaria: {0}
fr: Le type d'image liée ne prend pas en charge ATTACH pour l'enfant : {0}
ja: リンクされたイメージのタイプが子の接続をサポートしていません: {0}

source: Linked image type does not support parent attach: {0}
de: Der Typ des verknüpften Abbilds unterstützt nicht das angehängte übergeordnete Abbild: {0}
es: El tipo de imagen enlazada no admite conexión de imagen principal: {0}
fr: Le type d'image liée ne prend pas en charge ATTACH pour le parent : {0}
ja: リンクされたイメージのタイプが親の接続をサポートしていません: {0}

source: Cannot attach root image as child: {0}
de: Root-Abbild kann nicht als untergeordnetes Abbild angehängt werden: {0}
es: No se puede anexar una imagen raíz como elemento secundario: {0}
fr: Impossible d'attacher une image racine en tant qu'enfant : {0}
ja: ルートイメージを子として接続できません: {0}

source: Cannot link images when an image is not at its default location. The image currently located at: {curpath} is normally located at: {path}
de: Images können nicht verknüpft werden, wenn sich ein Image nicht im Standardverzeichnis befindet. Das Image mit dem aktuellen Verzeichnis {curpath} befindet sich normalerweise unter {path}
es: No se pueden enlazar imágenes si la imagen no está en su ubicación por defecto. La imagen ubicada actualmente en: {curpath} suele estar ubicada en: {path}
fr: Impossible de lier des images lorsque celles-ci ne se trouvent pas dans leur emplacement par défaut. L'image actuellement située sous : {curpath} se trouve normalement sous : {path}
ja: デフォルトの場所にないイメージはリンクできません。イメージの現在の場所は次のとおりです。 {curpath} 通常の場所は次のとおりです。 {path}

source: Can't initialize child image ({lin}) at path: {path}
de: Untergeordnetes Image ({lin}) in Pfad {path} kann nicht initialisiert werden
es: No se puede inicializar la imagen secundaria ({lin}) en la ruta: {path}
fr: Impossible d'initialiser l'image enfant ({lin}) dans le chemin : {path}
ja: 次のパスで子イメージ ({lin}) を初期化できません: {path}

source: Can't initialize child image at path: {0}
de: Untergeordnetes Abbild mit Pfad {0} kann nicht initialisiert werden
es: No se puede inicializar la imagen secundaria en la ruta: {0}
fr: Impossible d'initialiser l'image enfant dans le chemin : {0}
ja: 次のパスで子イメージを初期化できません: {0}

source: Linked image is diverged: {0}
de: Verknüpftes Abbild ist umgeleitet: {0}
es: La imagen enlazada está separada: {0}
fr: L'image liée est écartée : {0}
ja: リンクされたイメージが分岐しています: {0}

source: A linked child image with this name already exists: {0}
de: Ein verknüpftes untergeordnetes Abbild mit diesem Namen ist bereits vorhanden: {0}
es: Ya existe una imagen secundaria enlazada con este nombre: {0}
fr: Il existe déjà une image enfant liée portant ce nom : {0}
ja: この名前を持つリンクされた子イメージがすでに存在します: {0}

source: Child image '{path}' is not located within the parent's altroot '{altroot}'
de: Untergeordnetes Image '{path}' befindet sich nicht im altroot '{altroot}' des übergeordneten Images
es: La imagen secundaria '{path}' no está ubicada dentro del altroot de la imagen principal '{altroot}'
fr: L'image enfant '{path}' n'est pas placée dans l'altroot du parent '{altroot}'
ja: 子イメージ '{path}' は親の altroot '{altroot}' の内部にありません

source: Child image '{cpath}' is not nested within the parent image '{ppath}'
de: Untergeordnetes Image '{cpath}' ist nicht innerhalb des übergeordneten Images '{ppath}' verschachtelt
es: La imagen secundaria '{cpath}' no está anidada en la imagen principal '{ppath}'
fr: L'image enfant '{cpath}' n'est pas imbriquée dans l'image parente '{ppath}'
ja: 子イメージ '{cpath}' は親イメージ '{ppath}' の内部で入れ子になっていません

source: Failed '{op}' for child image ({lin}) at path: {path}: {strerror}
de: '{op}' für untergeordnetes Image ({lin}) in Pfad nicht erfolgreich: {path}: {strerror}
es: Se produjo un error en '{op}' para la imagen secundaria ({lin}) en la ruta: {path}: {strerror}
fr: Echec de '{op}'pour l'image enfant ({lin}) dans le chemin : {path} : {strerror}
ja: 次のパスで子イメージ ({lin}) の '{op}' に失敗しました: {path}: {strerror}

source: Failed '{op}' for child image at path: {path}: {strerror}
de: '{op}' für untergeordnetes Image in Pfad nicht erfolgreich: {path}: {strerror}
es: Se produjo un error en '{op}' para la imagen secundaria en la ruta: {path}: {strerror}
fr: Echec de '{op}'pour l'image enfant dans le chemin : {path} : {strerror}
ja: 次のパスで子イメージの '{op}' に失敗しました: {path}: {strerror}

source: Child path not absolute: {0}
de: Untergeordneter Pfad nicht absolut: {0}
es: La ruta secundaria no es absoluta: {0}
fr: Le chemin de l'enfant n'est pas un chemin absolu : {0}
ja: 子のパスが絶対パスではありません: {0}

source: Unknown child linked image: {0}
de: Unbekanntes untergeordnetes verknüpftes Abbild: {0}
es: Imagen enlazada secundaria desconocida: {0}
fr: Image liée enfant inconnue : {0}
ja: リンクされた子イメージが不明です: {0}

source: The following subprocess returned an unexpected exit code of {rv:d}: {cmd}
de: Der folgende Unterprozess hat einen unerwarteten Exit Code von {rv:d} zurückgegeben: {cmd}
es: El siguiente subproceso devolvió un código de salida inesperado de {rv:d}: {cmd}
fr: Le sous-processus suivant a renvoyé un code de sortie inattendu de {rv:d}: {cmd}
ja: 次のサブプロセスが予期しない終了コード {rv:d} を返しました: {cmd}

source: And generated the following error message: {errout}
de: Folgende Fehlermeldung wurde generiert: {errout}
es: Se produjo el siguiente mensaje de error: {errout}
fr: Et généré le message d'erreur suivant : {errout}
ja: また、次のエラーメッセージを生成しました: {errout}

source: The following subprocess: {cmd} Generated the following unexpected output: {output}
de: Der folgende Unterprozess: {cmd} hat die folgende unerwartete Ausgabe erzeugt: {output}
es: El siguiente subproceso: {cmd} generó el siguiente resultado inesperado: {output}
fr: Le sous-processus suivant : {cmd} a généré la sortie inattendue suivante : {output}
ja: 次のサブプロセス {cmd} で次の予期しない出力が生成されました。 {output}

source: Linked image type does not support child detach: {0}
de: Der Typ des verknüpften Abbilds unterstützt nicht das Trennen des untergeordneten Abbilds: {0}
es: El tipo de imagen enlazada no admite desconexión de imagen secundaria: {0}
fr: Le type d'image liée ne prend pas en charge DETACH pour l'enfant : {0}
ja: リンクされたイメージのタイプが子の切り離しをサポートしていません: {0}

source: Parent linked to child, can not detach child: {0}
de: Das übergeordnete und mit dem untergeordneten Abbild verkünpften Abbild kann nicht vom untergeordneten Abbild getrennt werden: {0}
es: Imagen principal enlazada a imagen secundaria, no se puede desconectar imagen secundaria: {0}
fr: Parent lié à l'enfant, impossible de détacher l'enfant : {0}
ja: 子にリンクされた親が子を切り離せません: {0}

source: Linked image type does not support parent detach: {0}
de: Der Typ des verknüpften Abbilds unterstützt nicht das Trennen des übergeordneten Abbilds: {0}
es: El tipo de imagen enlazada no admite desconexión de imagen principal: {0}
fr: Le type d'image liée ne prend pas en charge DETACH pour le parent : {0}
ja: リンクされたイメージのタイプが親の切り離しをサポートしていません: {0}

source: Image already a linked child: {0}
de: Abbild ist bereits ein verknüpftes untergeordnetes Abbild: {0}
es: La imagen ya tiene una imagen secundaria enlazada: {0}
fr: L'image est déjà un enfant lié : {0}
ja: イメージはすでにリンクされた子です: {0}

source: Intermediate image '{ipath}' found between child '{cpath}' and parent '{ppath}'
de: Zwischenimage '{ipath}' zwischen untergeordnetem Image '{cpath}' und übergeordnetem Image '{ppath}' ermittelt
es: Imagen intermedia '{ipath}' encontrada entre elemento secundario '{cpath}' y el principal '{ppath}'
fr: L'image intermédiaire '{ipath}' a été trouvée entre l'enfant '{cpath}' et le parent '{ppath}'
ja: 中間イメージ '{ipath}' が子 '{cpath}' と親 '{ppath}' の間で見つかりました

source: Invalid linked image name '{0}'. Linked image names have the following format '<linked_image plugin>:<linked_image name>'
de: Ungültiger Name für verknüpftes Abbild '{0}'. Namen von verknüpften Abbildern haben das folgende Format '<linked_image plugin>:<linked_image name>'
es: Nombre de imagen enlazada no válido '{0}'. Los nombres de imagen enlazada tienen el siguiente formato '<linked_image plugin>:<linked_image name>'
fr: Le nom d'image liée '{0}' n'est pas valide. Les noms d'images liées ont le format suivant '<linked_image plugin>:<linked_image name>'
ja: リンクされたイメージの名前 '{0}' が無効です。リンクされたイメージの名前の形式は '<linked_image plugin>:<linked_image name>' です

source: Can't link image to itself: {0}
de: Abbild kann nicht mit sich selbst verknüpft werden: {0}
es: No se puede enlazar la imagen a sí misma: {0}
fr: Impossible de lier l'image à elle-même : {0}
ja: イメージはそれ自体にリンクできません: {0}

source: Can't initialize parent image at path: {0}
de: Übergeordnetes Abbild mit folgendem Pfad kann nicht initialisiert werden: {0}
es: No se puede inicializar la imagen principal en la ruta: {0}
fr: Impossible d'initialiser l'image parente dans le chemin : {0}
ja: 次のパスで親イメージを初期化できません: {0}

source: Parent path not absolute: {0}
de: Übergeordneter Pfad nicht absolut: {0}
es: La ruta principal no es absoluta: {0}
fr: Le chemin du parent n'est pas un chemin absolu : {0}
ja: 親のパスが絶対パスではありません: {0}

source: Can't access parent image at path: {0}
de: Zugriff auf übergeordnetes Abbild mit folgendem Pfad nicht möglich: {0}
es: No se puede acceder a la imagen principal en la ruta: {0}
fr: Impossible d'accéder à l'image parente dans le chemin : {0}
ja: 次のパスで親イメージにアクセスできません: {0}

source: A parent image '{ppath}' can not be nested within a child image '{cpath}'
de: Ein übergeordnetes Image '{ppath}' kann nicht innerhalb eines untergeordneten Images '{cpath}' verschachtelt werden
es: Una imagen principal '{ppath}' no se puede anidar dentro de una imagen secundaria '{cpath}'
fr: L'image parente '{ppath}' ne peut pas être imbriquée dans l'image enfant '{cpath}'
ja: 親イメージ '{ppath}' は子イメージ '{cpath}' の内部の入れ子にすることはできません

source: Parent image '{path}' is not located within the child's altroot '{altroot}'
de: Übergeordnetes Image '{path}' befindet sich nicht im altroot '{altroot}' des untergeordneten Images
es: La imagen principal '{path}' no está ubicada dentro del altroot de la imagen secundaria '{altroot}'
fr: L'image parent '{path}' n'est pas placée dans l'altroot de l'enfant '{altroot}'
ja: 親イメージ '{path}' は子の altroot '{altroot}' の内部にありません

source: A '{op}' operation failed for child '{lin}' with an unexpected return value of {exitrv:d} and generated the following output: {errout}
de: Ein '{op}'-Vorgang war für untergeordnetes Objekt '{lin}' mit einem unerwarteten Rückgabewert von {exitrv:d} nicht erfolgreich und hat folgende Ausgabe generiert: {errout}
es: Se produjo un error en la operación '{op}' para la imagen secundaria '{lin}' con un valor de retorno inesperado de {exitrv:d} y se generó la siguiente salida: {errout}
fr: Une opération '{op}' a échoué pour l'enfant '{lin}' avec renvoi de la valeur inattendue {exitrv:d} et génération de la sortie suivante : {errout}
ja: 子 '{lin}' に対する '{op}' 操作は、予期しない 戻り値 {exitrv:d} で失敗し、次の出力を生成しました: {errout}

source: A '{op}' operation failed for child '{lin}' with an unexpected exception: {e} The child generated the following output: {errout}
de: Ein '{op}'-Vorgang war für untergeordnetes Objekt '{lin}' mit einer unerwarteten Ausnahme nicht erfolgreich: {e} Das untergeordnete Objekt hat folgende Ausgabe generiert: {errout}
es: Se produjo un error en la operación '{op}' para la imagen secundaria '{lin}' con una excepción inesperada: {e} La imagen secundaria generó la siguiente salida: {errout}
fr: Une opération '{op}' a échoué pour l'enfant '{lin}' avec une exception inattendue : {e} L'enfant a généré la sortie suivante : {errout}
ja: 子 '{lin}' に対する '{op}' 操作は、予期しない 例外で失敗しました: {e} 子は次の出力を生成しました: {errout}

source: Current image already a linked child: {0}
de: Aktuelles Abbild ist bereits ein verknüpftes untergeordnetes Abbild: {0}
es: La imagen actual ya tiene una imagen secundaria enlazada: {0}
fr: L'image actuelle est déjà un enfant lié : {0}
ja: 現在のイメージはすでにリンクされた子です: {0}

source: Current image is not a linked child: {0}
de: Aktuelles Abbild ist kein verknüpftes untergeordnetes Abbild: {0}
es: La imagen actual no es una imagen secundaria enlazada: {0}
fr: L'image actuelle n'est pas un enfant lié : {0}
ja: 現在のイメージはリンクされた子ではありません: {0}

source: A '{op}' operation for child '{lin}' generated non-json output. The json parser failed with the following error: {e} The child generated the following output: {errout}
de: Vorgang '{op}' hat für das untergeordnete Element '{lin}' eine Nicht-JSON-Ausgabe generiert. Der JSON-Parser war mit folgender Fehlermeldung nicht erfolgreich: {e} Das untergeordnete Element hat die folgende Ausgabe generiert: {errout}
es: La operación '{op}' para la imagen secundaria '{lin}' generó una salida no JSON. Se produjo un error en el analizador JSON con el siguiente error: {e} La imagen secundaria generó la siguiente salida: {errout}
fr: Une opération '{op}' pour l'enfant '{lin}' a généré une sortie non-json. L'analyseur json a échoué en raison de l'erreur suivante : {e} L'enfant a généré la sortie suivante : {errout}
ja: 子 '{lin}' に対する '{op}' 操作は、json でない出力を生成しました。 json パーサーは次のエラーで失敗しました: {e} 子は次の出力を生成しました: {errout}

source: The following packages were frozen at two different versions by the patterns provided. The package stem and the versions it was frozen at are provided:
de: Folgende Pakete wurden in zwei unterschiedlichen Versionen durch die angegebenen Muster eingefroren. Der Paketstamm und die Versionen, in die er eingefroren wurde, werden angegeben:
es: Los siguientes paquetes fueron bloqueados en dos versiones diferentes por los modelos proporcionados. Se proporciona el recurso y las versiones en las que se bloqueó el paquete:
fr: Les packages suivants ont été figés à deux versions différentes par les modèles indiqués. Le radical du package et les versions auxquelles il a été figé sont indiquées :
ja: 次のパッケージは、指定されたパターンによって 2 つの異なるバージョンで 凍結されました。パッケージの語幹および凍結されたバージョンが 提供されています:

source: The following patterns contained wildcards but matched no installed packages.
de: Folgende Muster enthielten Platzhalter, entsprachen aber keinem der installierten Pakete.
es: Los siguientes modelos contenían comodines pero no coincidían con ningún paquete instalado.
fr: Les modèles suivants contenaient des caractères génériques mais n'ont pas trouvé de correspondance dans les packages installés.
ja: 次のパターンはワイルドカードを含んでいますが、どのインストール済み パッケージにも一致しませんでした。

source: The following patterns attempted to freeze the listed packages at a version different from the version at which the packages are installed.
de: Folgende Muster versuchten, die aufgelisteten Pakete in einer anderen Version einzufrieren als der Version, in der die Pakete installiert sind.
es: Los siguientes modelos intentaron bloquear los paquetes mostrados en una versión distinta de la versión en la que se instalaron los paquetes.
fr: Les modèles suivants ont tenté de figer les packages répertoriés à une version différente de la version des packages installée.
ja: 次のパターンは、一覧にあるパッケージをパッケージがインストールされた バージョンとは異なるバージョンで凍結しようとしました。

source: The following patterns don't match installed packages and contain no version information. Uninstalled packages can only be frozen by providing a version at which to freeze them.
de: Folgende Muster stimmen nicht mit installierten Paketen überein und enthalten keine Versionsinformationen. Deinstallierte Pakete können nur eingefroren werden, wenn eine Version angegeben wird, in die sie eingefroren werden sollen.
es: Los siguientes modelos no coinciden con los paquetes instalados y no contienen información de la versión. Los paquetes desinstalados sólo se pueden bloquear proporcionando la versión en la que se bloquearán.
fr: Les modèles suivants ne correspondent à aucun package installé et ne contiennent aucune information de version. Les packages non installés peuvent uniquement être figés en spécifiant la version à laquelle ils doivent être figés.
ja: 次のパターンは、インストール済みパッケージと一致せず、 バージョン情報を含んでいません。アンインストールされたパッケージを凍結するには、 凍結するバージョンを指定する必要があります。

source: The freeze state file '{0}' is invalid.
de: Die Freeze-Statusdatei '{0}' ist ungültig.
es: El archivo de estado de bloqueo '{0}' no es válido.
fr: Le fichier d'état de figement '{0}' n'est pas valide.
ja: 凍結状態ファイル '{0}' は無効です。

source: The freeze state file '{loc}' was expected to have a version of {exp}, but its version was {found}
de: Für die Freeze-Statusdatei '{loc}' wurde eine Version {exp} erwartet, die Version war jedoch {found}
es: Se esperaba que el archivo de estado de bloqueo '{loc}' tuviera la versión {exp}, pero la versión era {found}
fr: La version attendue dans le fichier d'état de figement '{loc}' était {exp}, mais la version trouvée est {found}
ja: 凍結状態ファイル '{loc}' のバージョンは {exp} のはずでしたが、バージョンは {found} でした

source: Option '{option}' may not be repeated.
de: Option '{option}' kann nicht wiederholt werden.
es: La opción '{option}' no se puede repetir.
fr: L'option '{option}' ne peut pas être répétée.
ja: オプション '{option}' を繰り返すことはできません。
