Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: linked image property arguments must be of the form '<name>=<value>'.
de: Die Eigenschaftenargumente eines verknüpften Abbilds müssen die Form '<name>=<value>' aufweisen.
es: los argumentos de propiedad de imagen enlazada deben tener el formato '<name>=<value>'.
fr: les arguments de propriété d'image liée doivent adopter le format '<name>=<value>'.
ja: リンクされたイメージのプロパティーの引数は '<name>=<value>' の形式になっている必要があります。

source: invalid linked image property: '{0}'.
de: Ungültige Eigenschaft des verküpften Abbilds: '{0}'.
es: propiedad no válida de imagen enlazada: '{0}'.
fr: propriété d'image liée incorrecte : '{0}'.
ja: リンクされたイメージのプロパティーが無効です: '{0}'。

source: linked image property specified multiple times: '{0}'.
de: Eigenschaft des verknüpften Abbilds ist mehrmals angegeben: '{0}'.
es: propiedad de imagen enlazada especificada varias veces: '{0}'.
fr: propriété d'image liée spécifiée plusieurs fois : '{0}'.
ja: リンクされたイメージのプロパティーが複数回指定されました: '{0}'。

source: {op}: no such property: {p}
de: {op}: Keine derartige Eigenschaft: {p}
es: {op}: esta propiedad no existe: {p}
fr: {op} : cette propriété n'existe pas : {p}
ja: {op}: そのようなプロパティーは存在しません: {p}

source: synced
de: synchronisiert
es: sincronizada
fr: synchronisé
ja: 同期

source: diverged
de: umgeleitet
es: separada
fr: écarté
ja: 分岐

source: cannot specify linked image property: '{0}'
de: Eigenschaft des verknüpften Abbilds kann nicht angegeben werden: '{0}'
es: no se puede especificar la propiedad de la imagen enlazada: '{0}'
fr: impossible de spécifier la propriété d'image liée : '{0}'
ja: リンクされたイメージのプロパティーを指定できません: '{0}'

source: a linked image name and path must be specified
de: Name und Pfad eines verknüpften Abbilds müssen angegeben werden
es: se debe especificar una ruta y un nombre de imagen enlazada
fr: vous devez spécifier le nom et le chemin d'accès de l'image liée
ja: リンクされたイメージの名前とパスを指定する必要があります

source: The -p option can be specified only once.
de: Die Option -p darf nur einmal angegeben werden.
es: La opción -p puede especificarse sólo una vez.
fr: L'option -p ne peut être spécifiée qu'une fois.
ja: -p オプションは一度だけ指定できます。

source: Facet arguments must be of the form '<name>=(True|False)'
de: Facettenargumente müssen die Form '<name>=(True|False)' aufweisen
es: Los argumentos de faceta deben tener el formato '<name>=(True|False)'
fr: Les arguments de facette doivent adopter le format '<name>=(True|False)'
ja: ファセットの引数は '<name>=(True|False)' の形式になっている必要があります

source: properties to be set must be of the form '<name>=<value>'. This is what was given: {0}
de: Eigenschaften müssen in der Form '<Name>=<Wert>' festgelegt werden. Folgendes wurde angegeben: {0}
es: las propiedades configuradas deben de tener el formato '<name>=<value>'. Se proporcionó lo siguiente: {0}
fr: les propriétés à définir doivent respecter le format '<nom>=<valeur>'. Vous avez utilisé le format suivant : {0}
ja: 設定するプロパティーは '<name>=<value>' の形式になっている必要があります。次のように指定されました: {0}

source: a property may only be set once in a command. {0} was set twice
de: Eine Eigenschaft kann nur einmal pro Befehl festgelegt werden. {0} wurde zweimal festgelegt.
es: una propiedad sólo puede definirse una vez en un comando. {0} se ha definido dos veces
fr: une propriété ne peut être définie qu'une seule fois dans une commande. {0} a été définie deux fois
ja: プロパティーは 1 つのコマンドで 1 回だけ設定できます。{0} は 2 回設定されました

source: variant arguments must be of the form '<name>=<value>'.
ca: els arguments variant han de ser de la forma '<nom>=<valor>'.
de: Variantenargumente müssen die Form '<Name>=<Wert>' haben.
es: los argumentos variant deben tener el formato '<nombre>=<valor>'.
fr: les arguments de variante doivent adopter la forme '<name>=<value>'.
ja: バリアントの引数は '<name>=<value>' の形式になっている必要があります。
ru: аргументы варианта должны иметь форму '<name>=<value>'.

source: an image directory path must be specified
de: Es muss ein Abbildverzeichnispfad angegeben werden
es: se debe especificar una ruta de directorio de imagen
fr: vous devez spécifier un chemin d'accès au répertoire image
ja: イメージディレクトリのパスを指定する必要があります
ru: необходимо указать путь к каталогу образа

source: only one image directory path may be specified
ca: únicament es pot especificar la ruta d'un directori
de: Es darf nur ein Abbildverzeichnispfad angegeben werden
es: sólo se puede especificar una ruta al directorio de la imagen
fr: un seul chemin de répertoire d'images peut être spécifié
ja: 指定できるイメージディレクトリのパスは 1 つだけです
ru: необходимо указать только один путь к каталогу изображения

source: --no-refresh cannot be used with -p unless a publisher prefix is provided.
de: --no-refresh kann nur mit -p verwendet werden, wenn ein Herausgeberpräfix angegeben wird.
es: --no-refresh no se puede usar con la opción -p, a menos que se proporcione un prefijo de editor.
fr: l'actualisation -no ne peut pas être effectuée avec --p à moins de fournir un préfixe d'éditeur.
ja: パブリッシャーの接頭辞が指定されていない場合、--no-refresh と -p は同時に使用できません。
ru: --no-refresh нельзя использовать вместе с -p без предоставления префикса издателя.

source: A publisher must be specified if -g or -m are used.
de: Ein Herausgeber muss angegeben werden, wenn-g oder -m verwendet werden.
es: Se debe especificar un editor si se usan -g o -m.
fr: Un éditeur doit être spécifié si -g ou -m sont utilisés.
ja: -g または -m が使用されている場合は、パブリッシャーを指定する必要があります。

source: The URI '{pub_url}' does not appear to point to a valid pkg repository. Please check the repository's location and the client's network configuration. Additional details: {error}
de: Die angegebene URI '{pub_url}' zeigt scheinbar nicht auf ein gültiges pkg-Repository. Prüfen Sie das Repository-Verzeichnis und die Netzwerkkonfiguration des Clients. Zusätzliche Details: {error}
es: El URI '{pub_url}' no parece apuntar a un repositorio de paquetes válido. Compruebe la ubicación del repositorio y la configuración de la red del cliente. Detalles adicionales: {error}
fr: L'URI '{pub_url}' ne semble pas pointer vers un référentiel pkg valide. Vérifiez l'emplacement du référentiel et la configuration du réseau du client. Informations supplémentaires : {error}
ja: URI '{pub_url}' は有効な pkg リポジトリを指していないようです。 リポジトリの場所とクライアントのネットワーク構成を確認してください。 追加詳細: %{error}

source: command does not take operands ('{0}')
de: Befehl akzeptiert keine Operanden ('{0}')
es: el comando no acepta operandos ('{0}')
fr: La commande n'utilise pas d'opérande ('{0}')
ja: コマンドはオペランドを取りません ('{0}')

source: CLIENT
ja: クライアント
ru: КЛИЕНТ

source: COMMAND
fr: COMMANDE
ja: コマンド

source: FINISH
fr: FIN
ja: 完了

source: NEW BE
fr: Nouvel env. d'initialisation
ja: 新規 BE

source: NEW BE UUID
fr: UUID du nouvel env. d'initialisation
ja: 新規 BE UUID

source: OPERATION
ca: OPERACIÓ
ja: 操作
ru: РАБОТА

source: OUTCOME
ca: RESULTATS
fr: RESULTAT
ja: 結果
ru: РЕЗУЛЬТАТ

source: REASON
fr: RAISON
ja: 理由

source: RELEASE NOTES
fr: NOTES DE VERSION
ja: リリースノート

source: SNAPSHOT
fr: INSTANTANE
ja: スナップショット

source: START
fr: DEMARRAGE
ja: 開始

source: TIME
ca: HORA
fr: HEURE
ja: 時間
ru: ВРЕМЯ

source: USER
fr: UTILISATEUR
ja: ユーザー

source: Argument to -n must be numeric
de: Argumente von -n müssen numerisch sein
es: El argumento para -n debe ser numérico
fr: L'argument de -n doit être numérique
ja: -n の引数は数値でなければいけません
ru: Аргумент для -n должен быть цифровым

source: Argument to -n must be positive
de: Argumente von -n müssen positiv sein
es: El argumento de -n debe ser positivo
fr: L'argument de -n doit être positif
ja: -n の引数は正の値でなければいけません
ru: Аргумент для -n должен быть положительным

source: 'command' and 'reason' columns cannot be used together.
de: Spalten 'Befehl' und 'Grund' können nicht gemeinsam verwendet werden.
es: Las columnas 'command' y 'reason' no se pueden utilizar juntas.
fr: Les colonnes 'commande' et 'raison' ne peuvent pas être utilisées simultanément.
ja: 'command' 列と 'reason' 列は一緒に使用できません。

source: The '{0}' column must be the last item in the -o list
de: Spalte '{0}' muss in der Liste -o das letzte Element sein.
es: La columna '{0}' debe ser el último elemento de la lista -o
fr: La colonne '{0}' doit être le dernier élément de la liste -o
ja: '{0}' 列は -o リストの最後の項目である必要があります

source: Unknown output column '{0}'
de: Unbekannte Ausgabespalte '{0}'
es: Columna de salida desconocida '{0}'
fr: Colonne de sortie inconnue '{0}'
ja: 不明な出力列 '{0}'

source: -H and -l may not be combined
ca: -H i -l no poden combinar-se
de: -H und -I dürfen nicht kombiniert werden
es: Es posible que -H e -l no se pueden combinar
fr: il est impossible de combiner -H et -l
ja: -H と -l を組み合わせることはできません
ru: параметры -H и -l нельзя использовать совместно

source: -o and -l may not be combined
de: -o und -l dürfen nicht kombiniert werden
es: -o y -l no se pueden combinar
fr: il est impossible de combiner -o et -l
ja: -o と -l を組み合わせることはできません

source: -n and -t may not be combined
de: -n und -t dürfen nicht kombiniert werden
es: -n y -t no se pueden combinar
fr: il est impossible de combiner -n et -t
ja: -n と -t を組み合わせることはできません

source: -o and -N may not be combined
de: -o und -N dürfen nicht kombiniert werden
es: -o y -N no se pueden combinar
fr: Il est impossible de combiner -o et -N
ja: -o と -N を組み合わせることはできません

source: -l and -N may not be combined
de: -l und -N dürfen nicht kombiniert werden
es: -l y -N no se pueden combinar
fr: Il est impossible de combiner -l et -N
ja: -l と -N を組み合わせることはできません

source: {0}: Release notes:
de: {0}: Versionshinweise:
es: {0}: Notas de la versión:
fr: {0} : notes de version :
ja: {0}: リリースノート:

source: {0}: Release notes: None
de: {0}: Versionshinweise: Keine
es: {0}: Notas de la versión: Ninguna
fr: {0} : notes de version : aucune
ja: {0}: リリースノート: なし

source: {0} (clock drift detected)
de: {0} (Uhrenfehler erkannt)
es: {0} (se detectó un desfase de reloj)
fr: {0} (dérive d'horloge détectée)
ja: {0} (クロックドリフトが検出されました)

source: (Unknown)
de: (Unbekannt)
es: (No se conoce)
fr: (Inconnu)
ja: (不明)

source: (None)
de: (Kein)
es: (Ninguno)
fr: (Aucun)
ja: (なし)

source: Duplicate column specified: {0}
de: Doppelte Spalte angegeben: {0}
es: Columna duplicada especificada: {0}
fr: Colonne dupliquée spécifiée : {0}
ja: 重複した列が指定されました: {0}

source: Operation
de: Vorgang
es: Operación
fr: Opération
ja: 操作

source: Outcome
de: Ergebnis
es: Resultado
fr: Résultat
ja: 結果

source: Reason
de: Ursache
es: Motivo
fr: Raison
ja: 理由

source: Client
es: Cliente
ja: クライアント

source: Version
es: Versión
ja: バージョン

source: User
de: Benutzer
es: Usuario
fr: Utilisateur
ja: ユーザー

source: Boot Env.
de: Boot-Umg.
es: Entorno de inicio
fr: Env. d'initialisation
ja: ブート環境

source: Boot Env. UUID
de: Boot-Umg.-UUID
es: Entorno de inicio UUID
fr: UUID de l'env. d'initialisation
ja: ブート環境 UUID

source: New Boot Env.
de: Neue Boot-Umg.
es: Entorno de inicio nuevo
fr: Nouvel env. d'initialisation
ja: 新しいブート環境

source: New Boot Env. UUID
de: Neue Boot-Umg.-UUID
es: UUID de entorno de inicio nuevo
fr: UUID du nouvel env. d'initialisation
ja: 新しいブート環境 UUID

source: Snapshot
es: Instantánea
fr: Instantané
ja: スナップショット

source: Start Time
de: Startzeit
es: Hora de inicio
fr: Heure de début
ja: 開始時間

source: End Time
de: Endzeit
es: Hora de finalización
fr: Heure de fin
ja: 終了時間

source: Total Time
de: Gesamtzeit
es: Tiempo total
fr: Durée totale
ja: 合計時間

source: Command
de: Befehl
es: Comando
fr: Commande
ja: コマンド

source: Release Notes
de: Versionshinweise
es: Notas de la versión
fr: Notes de version
ja: リリースノート

source: Start State
de: Anfangsstatus
es: Estado inicial
fr: Etat de début
ja: 開始状態

source: End State
de: Endstatus
es: Estado final
fr: Etat de fin
ja: 終了状態

source: Errors
de: Fehler
es: Errores
fr: Erreurs
ja: エラー

source: History purged.
ca: Història purgada.
de: Historie gelöscht
es: Se depuró el historial.
fr: Historique purgé.
ja: 履歴が削除されます。
ru: История очищена.

source: The following proxy configuration is set in the environment:
ca: La següent configuració de proxy està establerta en l'entorn:
de: In der Umgebung ist folgende Proxy-Konfiguration festgelegt:
es: En el entorno está establecida la siguiente configuración proxy:
fr: La configuration proxy suivante est définie dans l'environnement :
ja: 次のプロキシ構成が環境に設定されました:
ru: В среде установлена следующая конфигурация прокси:

source: Image format updated.
de: Imageformat aktualisiert.
es: Formato de imagen actualizado.
fr: Format de l'image mis à jour.
ja: イメージ形式が更新されました。

source: Image format already current.
de: Abbildformat bereits aktualisiert.
es: Formato de imagen ya actualizado.
fr: Format de l'image déjà actuel.
ja: イメージ形式はすでに最新です。

source: version: command does not take operands ('{0}')
de: version: Befehl akzeptiert keine Operanden ('{0}')
es: versión: el comando no toma operandos ('{0}')
fr: version : la commande n'utilise pas d'opérande ('{0}')
ja: version: コマンドはオペランドを取りません ('{0}')

source: illegal global option -- {0}
de: Unzulässige globale Option -- {0}
es: opción global no válida -- {0}
fr: option générale non admise -- {0}
ja: 不正なグローバルオプション -- {0}

source: {opt} takes argument of form name=value, not {arg}
de: {opt} akzeptiert Argumente in Form von Name=Wert, und nicht {arg}
es: {opt} requiere un argumento con el formato name=value, no {arg}
fr: {opt} attend des arguments de la forme nom=valeur, et non de la forme {arg}
ja: {opt} は、{arg} ではなく、形式 name=value の引数を取ります

source: unknown subcommand '{0}'
de: Unbekannter Unterbefehl '{0}'
es: subcomando desconocido '{0}'
fr: sous-commande inconnue '{0}'
ja: 不明なサブコマンド '{0}'

source: no subcommand specified
ca: cap sub-comanda especificada
de: Es wurde kein Unterbefehl angegeben
es: no se especificó ningún subcomando
fr: aucune sous-commande spécifiée
ja: サブコマンドが指定されていません
ru: не указана субкоманда

source: runid must be an integer
de: runid muss eine Ganzzahl sein
es: El ID de ejecución debe ser un número entero
fr: runid doit être un nombre entier.
ja: runid は整数である必要があります

source: -R not allowed for {0} subcommand
de: -R für {0} Unterbefehl nicht zulässig
es: -R no se admite para subcomando {0}
fr: -R n'est pas autorisé pour la sous-commande {0}.
ja: -R は {0} サブコマンドでは許可されていません

source: illegal option -- {0}
de: Unzulässige Option -- {0}
es: opción no permitida -- {0}
fr: option non admise -- {0}
ja: 不正なオプション -- {0}

source: Could not find image. Use the -R option or set $PKG_IMAGE to the location of an image.
de: Abbild nicht gefunden. Verwenden Sie die Option -R oder legen Sie für $PKG_IMAGE den Speicherort eines Abbilds fest.
es: No se pudo encontrar la imagen. Use la opción -R o establezca $PKG_IMAGE en la ubicación de una imagen.
fr: Impossible de trouver l'image. Utilisez l'option -R ou définissez $PKG_IMAGE sur l'emplacement d'une image.
ja: イメージが見つかりませんでした。-R オプションを使用するか、 $PKG_IMAGE をイメージの場所に設定します。

source: illegal argument -- {0}
de: Unzulässiges Argument -- {0}
es: argumento no permitido -- {0}
fr: argument non admis -- {0}
ja: 不正な引数 -- {0}

source: Linked image exception(s): {0}
de: Verknüpfte Abbildausnahme(n): {0}
es: Excepción de imagen enlazada: {0}
fr: Exception(s) d'image(s) liée(s) : {0}
ja: リンクされたイメージの例外: {0}

source: Errors were encountered while attempting to retrieve package or file data for the requested operation.
ca: Es van trobar errors mentre s'intentava recuperar les dades del paquet o fitxer per l'operació sol·licitada.
de: Fehler beim Abrufen von Paket oder Dateidaten für den angeforderten Vorgang.
es: Se encontraron errores al intentar recuperar datos de paquete o de archivos para la operación solicitada.
fr: Une erreur a été détectée lors de la tentative de récupération des données du package ou du fichier pour l'opération requise.
ja: 要求された操作に対するパッケージまたはファイルデータの取得を 試行しているときに、 エラーが発生しました。
ru: Произошли ошибки во время попытки извлечения пакета или данных из файла для запрошенной операции.

source: Details follow: {0}
de: Details folgen: {0}
es: Estos son los detalles: {0}
fr: Détails : {0}
ja: 詳細は次のとおりです: {0}

source: An error was encountered while attempting to read image state information to perform the requested operation. Details follow: {0}
de: Fehler bei dem Versuch, die Statusinformationen zum Abbild zu lesen, um den angeforderten Vorgang auszuführen. Details folgen: {0}
es: Se ha producido un error al intentar leer la información de estado de la imagen para realizar la operación solicitada. Detalles: {0}
fr: Une erreur s'est produite lors d'une tentative de lecture d'informations d'état d'images nécessaires à l'exécution de l'opération demandée. Les détails sont les suivants : {0}
ja: 要求された操作を実行するためにイメージの状態情報を読み取ろうとして エラーが発生しました。詳細は次のとおりです: {0}

source: Unable to contact a valid package repository. This may be due to a problem with the repository, network misconfiguration, or an incorrect pkg client configuration. Please verify the client's network configuration and repository's location.
de: Es konnte kein gültiges Paket-Repository kontaktiert werden. Dies kann an einem Problem mit dem Repository, der Netzwerkkonfiguration oder der pkg-Client-Konfiguration liegen. Überprüfen Sie die Netzwerkkonfiguration des Clients und den Speicherort des Repositorys.
es: No se puede contactar con un repositorio de paquetes válido. Esto puede deberse a un problema con el repositorio, a un error en la configuración de red o a una configuración incorrecta del cliente de paquete. Compruebe la configuración de red del cliente y la ubicación del repositorio.
fr: Impossible de contacter un référentiel de package valide. Le problème provient peut-être du référentiel, d'une mauvaise configuration réseau ou d'une configuration client pkg incorrecte. Vérifiez la configuration réseau du client et l'emplacement du référentiel.
ja: 有効なパッケージリポジトリに接続できません。これはリポジトリの問題、ネットワークの構成ミス、または pkg クライアントの構成の誤りが原因と考えられます。クライアントのネットワーク構成とリポジトリの場所を確認してください。
ru: Не удалось соединиться с действительным хранилищем пакета. Возможно, это вызвано проблемой, связанной с хранилищем, неправильной настройкой сети или некорректной настройкой клиента pkg . Проверьте параметры настройки сети клиента и местоположение хранилища.

source: Additional details: {0}
de: Zusätzliche Details: {0}
es: Detalles adicionales: {0}
fr: Informations supplémentaires : {0}
ja: 追加詳細: {0}

source: An error was encountered while attempting to load history information about past client operations.
ca: S'ha produït un error mentre s'intentava carregar l'històric quant a les operacions antigues de client.
de: Fehler beim Laden der Historie-Daten vergangener Client-Vorgänge.
es: Error al intentar cargar la información del historial sobre las operaciones antiguas del cliente.
fr: Une erreur s'est produite lors de la tentative de chargement des informations d'historique sur les opérations client effectuées précédemment.
ja: 以前のクライアント操作に関する履歴情報のロードを試行しているときに、 エラーが発生しました。
ru: Произошла ошибка во время попытки загрузки информации из истории последних операций клиента.

source: An error was encountered while attempting to store information about the current operation in client history.
ca: S'ha produït un error mentre s'intentava emmagatzemar l'informació quant a l'operació actual al històric del client.
de: Fehler beim Speichern der Daten des aktuellen Vorgangs in der Client-Historie.
es: Error al intentar almacenar información sobre la operación actual en el historial del cliente.
fr: Une erreur s'est produite lors de la tentative d'enregistrement des informations sur l'opération actuelle dans l'historique client.
ja: 現在の操作に関する情報をクライアント履歴に格納しようとしたときに、 エラーが発生しました。
ru: Произошла ошибка во время попытки сохранения в истории клиента информации о текущей операции.

source: An error was encountered while attempting to purge client history.
ca: S'ha produït un error mentre s'intentava purgar la història del client.
de: Fehler beim Leeren der Client-Historie
es: Error al intentar purgar el historial del cliente.
fr: Une erreur s'est produite lors de la tentative de purge de l'historique client.
ja: クライアント履歴の削除を試行しているときに、エラーが発生しました。
ru: Произошла ошибка во время попытки очистки истории клиента.

source: The pkg command appears out of sync with the libraries provided by pkg:/package/pkg. The client version is {client} while the library API version is {api}.
de: Der pkg-Befehl stimmt nicht mit den von pkg:/package/pkg angegebenen Bibliotheken überein. Die Clientversion ist {client} und die Bibliotheks- API-Version ist {api}.
es: El comando pkg aparece desincronizado con las bibliotecas proporcionadas por pkg:/package/pkg. La versión de cliente es {client} y la versión de la API de biblioteca es {api}.
fr: La commande pkg n'est pas synchronisée avec les bibliothèques fournies par pkg :/package/pkg. La version client est {client}, tandis que la version de l'API de la bibliothèque est {api}.
ja: pkg コマンドは、pkg:/package/pkg で提供されているライブラリと同期が取れていない ようです。クライアントのバージョンが {client} であるのに対して、ライブラリ API のバージョンは {api} です。

source: Despite the error while indexing, the operation has completed successfuly.
de: Trotz des Fehlers bei der Indexerstellung wurde der Vorgang erfolgreich abgeschlossen.
fr: Malgré une erreur au cours de l'indexation, l'opération a été effectuée avec succès.
ja: インデックス作成中にエラーが発生しましたが、操作は正常に終了しました。

source: Usage: pkg.depot-config ( -d repository_dir | -S ) -r runtime_dir [-c cache_dir] [-s cache_size] [-p port] [-h hostname] [-l logs_dir] [-T template_dir] [-A] [-t server_type] ( ( [-F] [-P server_prefix] ) | [--https ( ( --cert server_cert_file --key server_key_file [--cert-chain ssl_cert_chain_file] ) | --cert-key-dir cert_key_directory ) [ (--ca-cert ca_cert_file --ca-key ca_key_file ) ] [--smf-fmri smf_pkg_depot_fmri] ] )
de: Syntax: pkg.depot-config ( -d repository_dir | -S ) -r runtime_dir [-c cache_dir] [-s cache_size] [-p port] [-h hostname] [-l logs_dir] [-T template_dir] [-A] [-t server_type] ( ( [-F] [-P server_prefix] ) | [--https ( ( --cert server_cert_file --key server_key_file [--cert-chain ssl_cert_chain_file] ) | --cert-key-dir cert_key_directory ) [ (--ca-cert ca_cert_file --ca-key ca_key_file ) ] [--smf-fmri smf_pkg_depot_fmri] ] )
es: Sintaxis: pkg.depot-config ( -d repository_dir | -S ) -r runtime_dir [-c cache_dir] [-s cache_size] [-p port] [-h hostname] [-l logs_dir] [-T template_dir] [-A] [-t server_type] ( ( [-F] [-P server_prefix] ) | [--https ( ( --cert server_cert_file --key server_key_file [--cert-chain ssl_cert_chain_file] ) | --cert-key-dir cert_key_directory ) [ (--ca-cert ca_cert_file --ca-key ca_key_file ) ] [--smf-fmri smf_pkg_depot_fmri] ] )
fr: Utilisation : pkg.depot-config ( -d repository_dir | -S ) -r runtime_dir [-c cache_dir] [-s cache_size] [-p port] [-h hostname] [-l logs_dir] [-T template_dir] [-A] [-t server_type] ( ( [-F] [-P server_prefix] ) | [--https ( ( --cert server_cert_file --key server_key_file [--cert-chain ssl_cert_chain_file] ) | --cert-key-dir cert_key_directory ) [ (--ca-cert ca_cert_file --ca-key ca_key_file ) ] [--smf-fmri smf_pkg_depot_fmri] ] )
ja: 使用方法: pkg.depot-config ( -d repository_dir | -S ) -r runtime_dir [-c cache_dir] [-s cache_size] [-p port] [-h hostname] [-l logs_dir] [-T template_dir] [-A] [-t server_type] ( ( [-F] [-P server_prefix] ) | [--https ( ( --cert server_cert_file --key server_key_file [--cert-chain ssl_cert_chain_file] ) | --cert-key-dir cert_key_directory ) [ (--ca-cert ca_cert_file --ca-key ca_key_file ) ] [--smf-fmri smf_pkg_depot_fmri] ] )

source: Unable to chown {dir} to {user}:{group}: {err}
de: {dir} kann nicht in {user}:{group} geändert werden: {err}
es: No se puede cambiar el propietario de {dir} a {user}:{group}: {err}
fr: Echec de chown {dir} pour {user}:{group} : {err}
ja: {user}:{group} への {dir} の chown を行えません: {err}

source: pkg.depot-config only supports v4 repositories
de: pkg.depot-config unterstützt nur v4-Repositorys
es: pkg.depot-config sólo admite repositorios v4
fr: pkg.depot-config prend uniquement en charge les référentiels v4
ja: pkg.depot-config は v4 のリポジトリのみをサポートします
