Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Usage: pkgrecv [-s src_repo_uri] [-d (path|dest_uri)] [-kr] [-m match] (fmri|pattern) ... pkgrecv [-s src_repo_uri] -n Options: -c cache_dir The path to a directory that will be used to cache downloaded content. If one is not supplied, the client will automatically pick a cache directory. In the case where a download is interrupted, and a cache directory was automatically chosen, use this option to resume the download. -d path_or_uri The path of a directory to save the retrieved package to, or the URI of a repository to republish it to. If not provided, the default value is the current working directory. If a directory path is provided, then package content will only be retrieved if it does not already exist in the target directory. If a repository URI is provided, a temporary directory will be created and all of the package data retrieved before attempting to republish it. -h Display this usage message. -k Keep the retrieved package content compressed, ignored when republishing. Should not be used with pkgsend. -m match Controls matching behaviour using the following values: all-timestamps includes all matching timestamps, not just latest (implies all-versions) all-versions includes all matching versions, not just latest -n List the most recent versions of the packages available from the specified repository and exit. (All other options except -s will be ignored.) -r Recursively evaluates all dependencies for the provided list of packages and adds them to the list. -s src_repo_uri A URI representing the location of a pkg(7) repository to retrieve package data from. Environment: PKG_DEST Destination directory or repository URI PKG_SRC Source repository URI
ru: Использование: pkgrecv [-s src_repo_uri] [-d (path|dest_uri)] [-kr] [-m match] (fmri|pattern) ... pkgrecv [-s src_repo_uri] -n Параметры: -c cache_dir Путь к каталогу, который будет использоваться для сохранения в кэше загруженного содержимого. Если путь не предоставлен, клиент автоматически выбирает каталог кэша. В случае прерывания загрузки, и автоматического выбора каталога кэша, используйте этот параметр для возобновления загрузки. -d path_or_uri Путь каталога для сохранения возвращенного пакета или идентификатор URI каталога для его повторной публикации. Если путь не предоставляется, в качестве текущего рабочего каталога используется значение по умолчанию. При предоставлении пути к каталогу содержимое пакета будет возвращено, если оно еще не существует в целевом каталоге. Если предоставляется идентификатор URI хранилища, создается временный каталог и все возвращенные данные пакета перед попыткой его повторной публикации. -h Отображение данного сообщения об использовании. -k Сохранение возвращенного содержимого пакета в сжатом виде, игнорируется при повторной публикации. Необходимо использовать сpkgsend. -m match Управляет поведением сопоставления при помощи следущих значений: all-timestamps включает все метки времени, а не только последнюю (относится ко всем версиям) all-versions включает все соответствующие версии, а не только последнюю -n Вывод списка новейших доступных версий пакетов из указанного каталога и выход из него. (Остальные параметры кроме -s будут игнорироваться.) -r Рекурсивно оценивает все зависимости для предоставленного списка пакетов и добавляет их в список. -s src_repo_uri Идентификатор URI, предоставляющий путь к каталогу pkg(7) для возврата данных пакета. Среда: PKG_DEST Целевой каталог или идентификатор URI хранилища PKG_SRC Идентификатор URI исходного хранилища

source: Cached files were preserved in the following directory: %s Use pkgrecv -c to resume the interrupted download.
ru: Кэшированные файлы сохранены в следующем каталоге: %s Используйте pkgrecv -c для возобновления прерванной загрузки.

source: Unable to parse manifest '%(mpath)s' for package '%(pfmri)s'
ca: No es pot analitzar el manifest'%(mpath)s' pel paquet '%(pfmri)s'
ru: Невозможно проанализировать манифест '%(mpath)s' для пакета '%(pfmri)s'.

source: Illegal option -- %s
ca: Opció Il·legal -- %s
ru: Недопустимый параметр -- %s

source: Illegal option value -- %s
ca: Valor d'opció no permès -- %s
ru: Недопустимое значение параметра -- %s

source: -n takes no options
ca: -n no pren cap opció
ru: -n используется без параметров

source: To create a repository, use the pkgsend command.
ca: Per a crear un repositori, utilitzeu la comanda pkgsend.
ru: Для создания хранилища используйте команду pkgsend.

source: The repository configuration for the repository located at '%s' is not valid or the specified path does not exist. Please correct the configuration of the repository or create a new one.
ca: La configuració del repositori pel repositori situat a '%s' no és vàlid o bé la ruta especificada no existeix. Corregiu la configuració del repositori o creau-ne una de nova.
ru: Конфигурация хранилища, расположенного в '%s', недопустима, или указанный путь не существует. Исправьте конфигурацию хранилища или создайте новую.

source: Unable to create basedir '%s'.
ca: No es pot crear el directori base (basedir) '%s'.
ru: Невозможно создать basedir '%s'.

source: Retrieving manifests for package evaluation ...
ca: Recuperant manifests per a la avaluació de paquet ...
ru: Извлечение манифестов для оценки пакета...

source: Skipping %s: already present at destination
ru: Пропуск %s: уже существует в целевом местоположении

source: Retrieving package content ...
ca: Recuperant contingut del paquet ...
ru: Извлечение содержимого пакета...

source: Republishing %s ...
ca: Re-publicant %s ...
ru: Повторная публикация %s...

source: Usage: pkgsign [-aciks] [--no-index] [--no-catalog] [--sign-all | fmri-to-sign ...]
ru: Использование: pkgsign [-aciks] [--no-index] [--no-catalog] [--sign-all | fmri-to-sign ...]

source: %s was expected to be a certificate but isn't a file.
ru: Предполагалось, что %s является сертификатом, но он не является файлом.

source: %s was expected to be a key file but isn't a file.
ru: Предполагалось, что %s является файлом ключа, но он не является файлом.

source: At least one fmri must be provided for signing.
ru: Для подписи необходимо предоставить по крайней мере один FMRI.

source: No fmris may be provided if the sign-all option is set.
ru: При установке параметра sign-all FMRI можно не предоставлять.

source: %s is not a recognized signature algorithm.
ru: %s является неизвестным алгоритмом подписи.

source: Using %s as the signature algorithm requires that a key and certificate pair be presented using the -k and -c options.
ru: Использование %s в качестве алгоритма подписи требует предоставления пары ключа и сертификата с использованием параметров -k и -c.

source: The %s hash algorithm does not use a key or certificate. Do not use the -k or -c options with this algorithm.
ru: Алгоритм хеширования %s не использует ключ или сертификат. Не используйте параметры -k или -c вместе с этим алгоритмом.

source: Signed %s
ru: Подписано %s

source: A text message describing the updates is displayed near the panel's Notification Area when updates become available if set to true.
ca: Un missatge de text descriu les actualitzacions es mostrat prop de l'àrea de Notificació quan les actualitzacions es converteixen amb disponibles si està establert a cert.
ru: Текстовое сообщение с описанием состояния обновлений отображается возле области уведомлений панели в случае наличия доступных обновлений, если параметр имеет значение "истина".

source: How often to check for updates
ca: Amb quina freqüència es comprova per a actualitzacions
ru: Как часто проверять наличие обновлений

source: How often to check for updates. The valid values are Daily, Weekly, Monthly, Never
ca: Amb quina freqüència es comprova per a actualitzacions. Els valors vàlids són Diària, Setmanal, Mensual, Mai
ru: Как часто проверять наличие обновлений. допустимые значения: ежедневно, еженедельно, ежемесячно, никогда

source: Start delay
ca: Iniciar espera
ru: Задержка выполнения

source: The notify icon is displayed on startup if set to true.
ca: La icona de notificació és mostrada a l'iniciar si està establert a cert.
ru: Если параметр имеет значение "истина", значок уведомления отображается во время запуска

source: The time, in seconds, that the updatemanagernotifier should wait, after starting, before checking for updates.
ca: El temps, en segons, que l'updatemanagernotifier ha d'esperar-se, després de ser iniciat, per a comprovar actualitzacions.
ru: Время в секундах, которое средство уведомления диспетчера обновлений должно выждать после запуска перед проверкой обновлений.

source: The updatemanagernotifier program terminates after the user activates the icon in the notification area if set to true.
ca: El programa notificador de gestió d'actualització finalitza després que l'usuari activi la icona en l'àrea de notificació si s'estableix a cert.
ru: Если установлено значение true, программа updatemanagernotifier завершает работу после выбора пользователем значка в области уведомлений.

source: Whether to always display the icon on startup
ca: Si voleu mostrar sempre l'icona a l'inici
ru: Всегда ли отображать значок во время запуска

source: Whether to display text message when updates are available
ca: Si voleu mostrar un missatges de text quan les actualitzacions estiguin disponibles
ru: Отображать ли текстовые сообщения, когда доступны обновления

source: Whether to terminate updatemanagernotiifer after icon activation.
ca: Si finalitzar el notificador de gestió d'actualització després de l'activació de l'icona.
ru: Необходимость прекращения работы updatemanagernotifier после активации значка.

source: Install available updates
ca: Instal·lar actualitzacions disponibles
ru: Установить доступные обновления

source: Notify user when updates are available
ca: Notificar a l'usuari quant hi hagi actualitzacions disponibles
ru: Уведомлять пользователя о наличии обновлений

source: Update Manager Notifier
ca: Notificador del Gestor d'Actualitzacions
ru: Средство уведомления диспетчера обновлений

source: <b>Updates are available: </b> %(updates)s %(installs)s %(removes)s
ru: <b>Доступны обновления: </b> %(updates)s %(installs)s %(removes)s

source: %d Update,
ru: %d обновление,

source: %d Install,
ru: %d установка,

source: %d Remove
ru: %d удаление

source: Updates available %(updates)s %(installs)s %(removes)s
ru: Доступны обновления %(updates)s %(installs)s %(removes)s

source: Please click on icon to update.
ru: Щелкните значок для обновления.

source: Another instance of UpdateManagerNotify is running
ca: Hi ha una altra instància de UpdateManagerNotify executant-se
ru: Запущен еще один экземпляр средства уведомления диспетчера обновлений

source: Error: %s
ru: Ошибка: %s

source: Only one -r option is supported.
ru: Поддерживается только параметр -r.

source: Only one -l option is supported.
ru: Поддерживается только параметр -l.

source: Invalid file %s: manifest not encoded in UTF-8: %s
ru: Недействительный файл %s: манифест не представлен в кодировке UTF-8: %s

source: Unable to read manifest file %s: %s
ru: Не удалось считать файл манифеста %s: %s

source: Error in %(file)s line: %(ln)s: %(err)s
ru: Ошибка в строке %(file)s: %(ln)s: %(err)s

source: Error in file %(file)s: %(err)s
ru: Ошибка в файле %(file)s: %(err)s

source: Manifest %s does not declare fmri.
ru: Манифест %s не объявляет FMRI.

source: <b>Add, modify and remove publishers</b>
ca: <b>Afegir, modificar i treure publicadors</b>
ru: <b>Добавление, изменение или удаление издателей</b>

source: <b>Apply the following changes:</b>
ca: <b>Aplicar els canvis següents:</b>
ru: <b>Применить следующие изменения:</b>

source: <b>Delete, rename and activate boot environments</b>
ca: <b>Eliminar, reanomenar i activar entorns d'arranc</b>
ru: <b>Удаление, переименование и активация сред загрузки.</b>

source: <b>Exit</b>
ca: <b>Sortir</b>
ru: <b>Выход</b>

source: <b>General</b>
ru: <b>Общие</b>

source: <b>Installed Version:</b>
ru: <b>Установленная версия:</b>

source: <b>Installed:</b>
ca: <b>Instal·lat:</b>
ru: <b>Установлено:</b>

source: <b>Name:</b>
ca: <b>Nom:</b>
ru: <b>Имя:</b>

source: <b>Origins</b>
ca: <b>Orígens</b>
ru: <b>Источники</b>

source: <b>Publisher added successfully</b>
ca: <b>Publicador afegit correctament</b>
ru: <b>Издатель добавлен успешно</b>

source: <b>Publisher</b>
ca: <b>Publicador</b>
ru: <b>Издатель</b>

source: <b>Recent Searches</b>
ca: <b>Cerques recents</b>
ru: <b>Недавние результаты поиска</b>

source: <b>Review the packages to be installed or udpated</b>
ca: <b>Revisar els paquets a ser instal·lats o actualitzats</b>
ru: <b>Проверка пакетов для установки или обновления</b>

source: <b>Show Confirmation Dialog</b>
ca: <b>Mostrar el diàleg de confirmació</b>
ru: <b>Показывать диалоговое окно подтверждения</b>

source: <b>Startup</b>
ca: <b>Inici</b>
ru: <b>Запуск</b>

source: <b>Update Manager</b>
ru: <b>Диспетчер обновлений</b>

source: <b>Updates completed successfully</b>
ru: <b>Обновление успешно завершено</b>

source: <b>Version to Install:</b>
ru: <b>Версия для установки:</b>

source: <b>View Package Manager Logs</b>
ca: <b>Visualitzar els registres del Gestor de Paquets</b>
ru: <b>Просмотр журналов регистрации диспетчера пакетов</b>

source: <b>_Mirrors</b>
ca: <b>_Rèpliques</b>
ru: <b>_Зеркала</b>

source: <b>_SSL Key and Certificate</b>
ca: <b>Clau _SSL i Certificat</b>
ru: <b>_Ключ и сертификат SSL</b>

source: <big><b>Package Manager Web Installer</b></big>
ca: <big><b>Instal·lador Web Gestor de Paquets</b></big>
ru: <big><b>Веб-установщик Диспетчера пакетов</b></big>

source: <span foreground="blue"><u>What's this?</u></span>
ca: <span foreground="blue"><u>Què és això?</u></span>
ru: <span foreground="blue"><u>Что это?</u></span>

source: A new boot environment has been created and will be given the following name.
ca: S'ha creat un nou entorn d'arranc i se l'hi ha assignat el següent nom.
ru: Создана новая среда загрузки, которой присвоено следующее имя.

source: A_dd
ca: Afegir
ru: До_бавить

source: A_lias:
ca: À_lies:
ru: _Псевдоним

source: About Glade
ca: Quant a Glade
ru: О Glade

source: Add Publisher
ca: Afegir publicador
ru: Добавить издателя

source: Adding Publisher Complete
ca: Afegint publicador complet
ru: Добавление издателя выполнено

source: Applying changes...
ca: Aplicant canvis...
ru: Применение изменений...

source: B_rowse...
ca: Navega_r...
ru: _Обзор...

source: Bro_wse...
ca: Navegar...
ru: _Обзор

source: Browse for SSL Certificate
ca: Navegar per a un certificat SSL
ru: Выбор сертификата SSL

source: Browse for SSL Key
ca: Navegar per a una clau SSL
ru: Выбор ключа SSL

source: C_lear Search
ca: Netejar cerca
ru: О_чистить поиск

source: Check for and install all available Updates.
ru: Проверка и установка доступных обновлений.

source: Checking package dependencies...
ca: Comprovant dependències del paquet...
ru: Проверка зависимостей пакета...

source: Clear Recent Searc_hes
ca: Netejar les cerques recents
ru: Сброс недавних результатов поиска

source: Confirmation
ca: Confirmació
ru: Подтверждение

source: Copyright (c) 2008, 2010, Oracle and/or its affiliates. All rights reserved.
ru: Copyright (c) 2008, 2010, Корпорация Oracle и ее филиалы. Все права защищены.

source: Currently active boot environment
ca: Entorn d'arranc actualment actiu
ru: Активная в данный момент загрузочная среда

source: D_eselect All
ca: _Deseleccionar-ho Tot
ru: _Отменить выделение

source: D_etails
ca: D_etalls
ru: _Подробные сведения

source: Dependencies
ca: Dependències
ru: Зависимости

source: Details
ca: Detalls
ru: Подробности

source: Do not notify me about these publishers again.
ca: No em torneu a notificar quant aquests publicadors.
ru: Более не уведомлять об этих издателях.

source: Errors and Warnings
ca: Errors i Advertències
ru: Ошибки и предупреждения

source: Files
ca: Fitxers
ru: Файлы

source: Go to package _list
ca: Anar al _llistat de paquets
ru: Перейти к списку_пакетов

source: Information
ca: Informació
ru: Информация

source: Install/Upgrade Check
ca: Comprovar Instal·lar/Actualitzar
ru: Проверка установки/обновления

source: License
ca: Llicència
ru: Лицензия

source: M_irror:
ca: M_irall:
ru: _Зеркало:

source: Manage Boot Environments
ca: Gestionar entorns d'arranc
ru: Управление загрузочными средами

source: Manage Publishers
ca: Gestionar publicadors
ru: Управление издателями

source: Manage _Boot Environments...
ca: Gestionar _Entorns d'arranc...
ru: _Управление загрузочными средами...

source: Modify Publisher
ca: Modificar publicador
ru: Изменить издателя

source: Name:
ca: Nom:
ru: Имя:

source: O_rigin:
ca: O_rigen:
ru: _Источник:

source: On Package _Install/Update
ca: En _Instal·lar/Actualitzar paquets
ru: При у_становке/обновлении пакета

source: On Package _Remove
ca: En Elimina_r paquets
ru: При уд_алении пакета

source: On _Updates
ca: En Act_ualitzacions
ru: При об_новлении

source: Package Version Info
ca: Informació de la versió del paquet
ru: Сведения о версии пакета

source: Preferences
ca: Preferències
ru: Параметры

source: Pu_blisher:
ca: Pu_blicador:
ru: И_здатель:

source: Publisher Alias:
ru: Псевдоним издателя:

source: Publisher Name:
ca: Nom publicador:
ru: Имя издателя:

source: Re_fresh
ca: Re_frescar
ru: О_бновить

source: Re_gistration Details
ca: Detalls del re_gistrament
ru: Подробные данные р_егистрации

source: Read the release notes before restarting the system.
ca: Llegir les notes de la versió abans de reiniciar el sistema.
ru: Перед перезапуском системы ознакомьтесь с заметками о выпуске.

source: Read the release notes.
ca: Llegir les notes de la versió.
ru: Прочтите заметки о выпуске.

source: Refresh
ca: Refrescar
ru: Обновить

source: Release notes
ca: Notes de la versió
ru: Заметки о выпуске

source: Remember current state on _exit
ca: Recordar l'_estat actual al sortir
ru: Запоминать текущее состояние при _выходе

source: Remo_ve
ca: Treure
ru: Уд_алить

source: Remov_e
ca: Treur_e
ru: Уда_лить

source: Restart _Now
ca: Rei_niciar ara
ru: Н_емедленный перезапуск

source: SSL C_ertificate:
ca: C_ertificat SSL:
ru: Сертификат _SSL

source: SSL Certi_ficate:
ca: Certi_ficat SSL:
ru: Сер_тификат SSL

source: SSL _Key:
ca: C_lau SSL:
ru: _Ключ SSL:

source: SSL _Key:
ca: C_lau SSL:
ru: _Ключ SSL:

source: Search Publisher Errors
ca: Errors cerca publicadors
ru: Ошибки поиска по издателям

source: Search errors with the following publishers:
ca: Cercar errors amb els següents publicadors:
ru: Ошибки поиска со следующими издателями:

source: Select _Updates
ca: Seleccionar Act_ualitzacions
ru: Выбор о_бновлений

source: Set publisher priorities using arrows.
ca: Establiu la prioritat del publicador utilitzant les fletxes.
ru: Установите приоритеты издателей с помощью стрелок.

source: Show Start Page on _startup
ca: Mostrar la pàgina d'inici a l'iniciar
ru: Вывод начальной страницы при_запуске

source: Show _all publisher results
ca: Mostrar resultats tots els publicadors
ru: Показывать _все результаты для издателей

source: Specify the publisher URI and optional alias
ru: Укажите URI издателя и дополнительный псевдоним

source: The following will be added to your system:
ca: El següent serà afegit al vostre sistema:
ru: В систему будут добавлены следующие компоненты:

source: This is a secure publisher.
ca: Aquest és un publicador segur.
ru: Этот издатель является защищенным.

source: This publisher requires an SSL key and an SSL certificate. Specify the location of these files.
ca: Aquests publicadors necessiten una clau i certificat SSL. Especifiqueu la localització d'aquests fitxers.
ru: Для данного издателя необходим ключ SSL и сертификат SSL. Укажите путь к этим файлам.

source: Updates Complete
ru: Обновления завершены

source: Versions
ru: Версии

source: Vie_w:
ca: Visualitzar:
ru: В_ид:

source: _Accept
ca: _Acceptar
ru: _Принять

source: _Add
ca: _Afegir
ru: _Добавить

source: _Add Publisher...
ca: _Afegir publicador...
ru: _Добавить издателя...

source: _Add...
ca: _Afegir...
ru: _Добавить...

source: _Alias:
ru: _Псевдоним:

source: _Browse...
ca: _Navegar...
ru: _Просмотреть...

source: _Contents
ca: _Continguts
ru: _Содержание

source: _Details
ca: _Detalls
ru: _Подробная информация

source: _Do not show this confirmation dialog again
ca: No tornar a mostrar aquest _diàleg de confirmació
ru: _Не показывать больше это окно подтверждения

source: _Down
ca: Abaix
ru: _Вниз

source: _Edit
ca: _Edició
ru: П_равка

source: _Export Selections...
ca: _Exportar seleccions...
ru: _Экспорт выбранных параметров...

source: _File
ca: _Fitxer
ru: _Файл

source: _Help
ca: _Ajuda
ru: _Справка

source: _Install Details
ca: Detalls _instal·lació
ru: _Подробные данные установки

source: _Install/Update
ca: _Instal·lar / Actualitzar
ru: _Установка/обновление

source: _Logs
ca: Re_gistres
ru: _Журналы

source: _Manage Publishers...
ca: _Gestionar publicadors
ru: _Управление издателями...

source: _Modify...
ca: _Modificar...
ru: _Изменить...

source: _Package
ca: _Paquet
ru: _Пакет

source: _Package Version Info
ca: Informació versió del _paquet
ru: _Сведения о версии пакета

source: _Recent Searches
ca: Cerques _recents
ru: Н_едавние результаты поиска

source: _Registration Details
ca: Detalls _registrament
ru: _Подробные сведения о регистрации

source: _Remove
ca: _Eliminar
ru: _Удалить

source: _Remove Details
ca: T_reure detalls
ru: _Удалить подробные данные

source: _Restart Later
ru: _Перезагрузить позже

source: _Search
ca: _Cercar
ru: _Поиск

source: _Up
ca: Am_unt
ru: _Вверх

source: _Update Details
ca: Detalls act_ualització
ru: _Обновить подробные данные

source: _Updates
ca: Act_ualitzacions
ru: О_бновления

source: _View
ca: _Visualitzar
ru: _Просмотр

source: label
ca: etiqueta
ru: метка
