Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: The provided p5i data is in an unrecognized format or does not contain valid publisher information: {0}
de: Das Format der bereitgestellten p5i-Daten wird nicht erkannt oder enthält keine gültigen Herausgeberinformationen: {0}
es: No se reconoce el formato de los datos p5i proporcionados o no contienen información válida del editor: {0}
fr: Les données p5i fournies utilisent un format non reconnu ou ne contiennent pas d'informations valides sur l'éditeur : {0}
ja: 指定された p5i データは、認識できない形式であるか、有効なパブリッシャー情報を含んでいません: {0}

source: The provided p5i data is in an unrecognized format or does not contain valid publisher information.
de: Das Format der bereitgestellten p5i-Daten wird nicht erkannt oder enthält keine gültigen Herausgeberinformationen.
es: No se reconoce el formato de los datos p5i proporcionados o no contienen información válida del editor.
fr: Les données p5i fournies utilisent un format non reconnu ou ne contiennent pas d'informations valides sur l'éditeur.
ja: 指定された p5i データは、認識できない形式であるか、有効なパブリッシャー情報を含んでいません。
ru: Предоставленные данные p5i имеют неизвестный формат или не содержат действительныесведения об издателе.

source: The provided p5s data is in an unrecognized format or does not contain valid publisher information: {0}
de: Das Format der bereitgestellten p5s-Daten wird nicht erkannt oder enthält keine gültigen Herausgeberinformationen: {0}
es: Los datos p5s proporcionados tienen un formato no reconocido o no contienen información de editor válida: {0}
fr: Les données p5s fournies utilisent un format non reconnu ou ne contiennent pas d'informations valides sur l'éditeur : {0}
ja: 指定された p5s データは、認識できない形式であるか、有効なパブリッシャー情報を含んでいません: {0}

source: The provided p5s data is in an unrecognized format or does not contain valid publisher information.
de: Das Format der bereitgestellten p5s-Daten wird nicht erkannt oder enthält keine gültigen Herausgeberinformationen.
es: Los datos p5s proporcionados tienen un formato no reconocido o no contienen información de editor válida.
fr: Les données p5s fournies utilisent un format non reconnu ou ne contiennent pas d'informations valides sur l'éditeur.
ja: 指定された p5s データは、認識できない形式であるか、有効なパブリッシャー情報を含んでいません。

source: Unsupported pkg(7) publisher information data format.
de: Datenformat der Herausgeberinformationen pkg(7) wird nicht unterstützt.
es: Formato no admitido de la información del editor pkg(7).
fr: Le format des données d'information de l'éditeur pkg(7) n'est pas pris en charge.
ja: pkg(7) パブリッシャー情報としてサポートされていないデータ形式です。
ru: Неподдерживаемый формат данных об издателе pkg(7).

source: Unsupported pkg(7) publisher and image information data format.
de: Datenformat der pkg(7)-Herausgeber- und Abbildinformationen und wird nicht unterstützt.
es: Formato no admitido de la información de la imagen y del editor pkg(7).
fr: Le format des données d'information d'image et d'éditeur pkg(7) n'est pas pris en charge.
ja: pkg(7) のパブリッシャーおよびイメージ情報としてサポートされていないデータ形式です。

source: {0} is not a supported version for creating a syspub response.
de: {0} ist keine unterstützte Version zur Erstellung einer syspub-Antwort.
es: {0} no es una versión compatible para crear una respuesta syspub.
fr: {0} n'est pas une version prise en charge pour la création d'une réponse syspub.
ja: {0} は、syspub 応答の作成をサポートしているバージョンではありません。

source: Error encountered while retrieving data from '{location}': {data}
de: Beim Abrufen von Daten aus '{location}' ist ein Fehler aufgetreten: {data}
es: Se ha encontrado un error al recuperar los datos de '{location}': {data}
fr: Une erreur s'est produite lors de la récupération des données à partir de '{location}' : {data}
ja: '{location}' からのデータの取得中にエラーが発生しました: {data}

source: Error encountered while retrieving data from: {0}
de: Beim Abrufen von Daten ist ein Fehler aufgetreten: {0}
es: Se ha encontrado un error al recuperar los datos de: {0}
fr: Une erreur s'est produite lors de la récupération des données à partir de {0}.
ja: データの取得中にエラーが発生しました: {0}

source: '{0}' is not a valid location.
de: '{0}' ist kein gültiger Speicherort.
es: '{0}' no es una ubicación válida.
fr: '{0}' n'est pas un emplacement valide.
ja: '{0}' は有効な場所ではありません。

source: '{0}' is not a valid boot environment name.
de: '{0}' ist kein gültiger Name für eine Boot-Umgebung.
es: '{0}' no es un nombre de entorno de inicio válido.
fr: '{0}' n'est pas un nom d'environnement d'initialisation valide.
ja: '{0}' は有効なブート環境名ではありません。

source: The boot environment '{0}' already exists.
de: Die Boot-Umgebung '{0}' ist bereits vorhanden.
es: El entorno de inicio actual '{0}' ya existe.
fr: L'environnement d'initialisation '{0}' existe déjà.
ja: ブート環境名 {0} はすでに存在しています。

source: The boot environment '{be_name}' already exists in zone '{zonename}'.
de: Die Boot-Umgebung '{be_name}' ist bereits in Zone '{zonename}' vorhanden.
es: El entorno de inicio '{be_name}' ya existe en la zona '{zonename}'.
fr: L'environnement d'initialisation '{be_name}' existe déjà dans la zone '{zonename}'.
ja: ブート環境 '{be_name}' はゾーン '{zonename}' にすでに存在しています。

source: Boot environment naming during package install is not supported on this version of Solaris. Please update without the --be-name option.
de: Die Benennung der Boot-Umgebung während der Packageinstallation wird von dieser Version von Solaris nicht unterstützt. Aktualisieren Sie ohne die Option --be-name.
es: La asignación de nombres del entorno de inicio durante la instalación de paquetes no se admite en esta versión de Solaris. Realice la actualización sin la opción --be-name.
fr: L'attribution d'un nom à un environnement d'initialisation lors de l'installation d'un package n'est pas prise en charge dans cette version de Solaris. Veuillez effectuer la mise à jour sans l'option --be-name.
ja: このバージョンの Solaris では、パッケージのインストール中にブート環境の 名前を指定することはできません。--be-name オプションを指定せずに更新してください。

source: Unable to clone the current boot environment.
ca: No es pot clonar l'actual entorn d'arranc.
de: Die aktuelle Boot-Umgebung kann nicht geklont werden.
es: No es posible clonar el entorno de inicio actual.
fr: Impossible de cloner l'environnement d'initialisation actuel.
ja: 現在のブート環境を複製できません。
ru: Невозможно клонировать текущую среду загрузки.

source: A problem occurred while attempting to rename the boot environment currently named {orig} to {dest}.
de: Beim Versuch, die Boot-Umgebung von {orig} in {dest} umzubenennen, ist ein Fehler aufgetreten.
es: Se produjo un problema al intentar cambiar el nombre del entorno de inicio de {orig} a {dest}.
fr: Un problème est survenu lors de la tentative de renommage de l'environnement d'initialisation actuellement nommé {orig} en {dest}.
ja: ブート環境の名前を現在の {orig} から {dest} に 変更しようとしたときに問題が発生しました。

source: Unable to mount {name} at {mt}
de: {name} kann nicht in {mt} eingehängt werden
es: No es posible montar {name} en {mt}
fr: Impossible de monter {name} à {mt}
ja: {name} を {mt} にマウントできません

source: Naming a boot environment when operating on a non-live image is not allowed.
ca: Nombrar un entorn d'arranc quan esteu treballant amb una imatge no-live no està permès.
de: Das Benennen einer Boot-Umgebung beim Bearbeiten eines Nicht-Live-Abbilds ist unzulässig.
es: No se permite la asignación de un nombre a un entorno de inicio mientras se trabaja en una imagen que no está en tiempo real.
fr: L'attribution d'un nom à un environnement d'initialisation lorsqu'une opération est effectuée sur une image non live n'est pas autorisée.
ja: ライブ以外のイメージの操作中にブート環境の名前を指定することは 許可されていません
ru: Присвоение имени среде загрузки при работе с неактивным образом не допускается.

source: Info does not recognize the following options:
ca: Info no reconeix les següents opcions:
de: Info erkennt die folgenden Optionen nicht:
es: La información no reconoce las opciones siguientes:
fr: Info ne reconnaît pas les options suivantes :
ja: Info では次のオプションは認識されません:
ru: Команда info не распознает следующие параметры:

source: Publisher meta_root '{root}' is invalid; unable to complete operation: '{op}'.
de: Herausgeber meta_root '{root}' ist ungültig; Vorgang kann nicht abgeschlossen werden: '{op}'.
es: El editor meta_root '{root}' no es válido; no se puede completar la operación: '{op}'.
fr: La commande meta_root '{root}' de l'éditeur n'est pas valide ; impossible de terminer l'opération : '{op}'.
ja: パブリッシャーの meta_root '{root}' は無効です; 操作を完了できません: '{op}'。

source: '{0}' is not a valid publisher alias.
de: '{0}' ist kein gültiges Alias für einen Herausgeber.
es: '{0}' no es un alias de editor válido.
fr: '{0}' n'est pas un alias d'éditeur valide.
ja: '{0}' は有効なパブリッシャー別名ではありません。

source: '{0}' is not a valid publisher name.
de: '{0}' ist kein gültiger Name für einen Herausgeber.
es: '{0}' no es un nombre de editor válido.
fr: '{0}' n'est pas un nom d'éditeur valide.
ja: '{0}' は有効なパブリッシャー名ではありません。

source: '{pkg_pub}' is a reserved publisher and does not contain the requested package: pkg:/{pkg_name}
de: '{pkg_pub}' ist ein reservierter Herausgeber und enthält das angeforderte Package nicht: pkg:/{pkg_name}
es: '{pkg_pub}' es un editor reservado y no contiene el paquete solicitado: pkg:/{pkg_name}
fr: '{pkg_pub}' est un éditeur réservé et ne contient pas le package demandé : pkg:/{pkg_name}
ja: '{pkg_pub}' は、予約されたパブリッシャーであり、要求されたパッケージを含んでいません: pkg:/{pkg_name}

source: '{value}' is not a valid value for repository attribute '{attribute}'.
de: '{value}' ist kein gültiger Wert für Repository-Attribut '{attribute}'.
es: '{value}' no es un valor válido para el atributo de repositorio '{attribute}'.
fr: '{value}' n'est pas une valeur valide pour l'attribut de référentiel '{attribute}'.
ja: '{value}' はリポジトリ属性 '{attribute}' に有効な値ではありません。

source: '{0}' is not a valid repository collection type.
de: '{0}' ist kein gültiger Collection-Typ für das Repository.
es: '{0}' no es un tipo de recopilación de repositorio válido.
fr: '{0}' n'est pas un type de collection de référentiel valide.
ja: '{0}' は有効なリポジトリ収集タイプではありません。

source: '{0}' is not a valid URI.
de: '{0}' ist kein gültiger URI.
es: '{0}' no es un URI válido.
fr: '{0}' n'est pas un URI valide.
ja: '{0}' は有効な URI ではありません。

source: '{0}' is not a valid URI priority; integer value expected.
de: '{0}' ist keine gültige URI-Priorität. Es wird eine Ganzzahl erwartet.
es: '{0}' no es una prioridad URI válida; se esperaba un valor entero.
fr: '{0}' n'est pas une priorité d'URI valide. La valeur attendue est de type entier.
ja: '{0}' は有効な URI 優先順位ではありません。整数値が必要です。

source: '{0}' is not a valid repository URI sort policy.
de: '{0}' ist keine gültige Sortierrichtlinie für den Repository-URI.
es: '{0}' no es una directiva válida de clasificación de URI de repositorio.
fr: '{0}' n'est pas une règle de tri d'URI de référentiel valide.
ja: '{0}' は有効なリポジトリ URI ソートポリシーではありません。

source: Publisher '{0}' is disabled and cannot be used for packaging operations.
de: Herausgeber '{0}' ist deaktiviert und kann nicht für Paketvorgänge verwendet werden.
es: El editor '{0}' está desactivado y no se puede usar para operaciones de empaquetado.
fr: L'éditeur {0} a été désactivé et ne peut pas être utilisé pour les opérations d'empaquetage.
ja: パブリッシャー '{0}' は無効になっているため、パッケージ化の操作に使用することはできません。

source: A publisher with the same name or alias as '{0}' already exists.
de: Ein Herausgeber mit demselben Namen oder Alias wie '{0}' ist bereits vorhanden.
es: Ya existe un editor con el mismo nombre o alias que '{0}'.
fr: Un éditeur ayant le même nom ou alias que {0} existe déjà.
ja: '{0}' と同じ名前または同じ別名のパブリッシャーがすでに存在します。

source: A repository with the same name or origin URIs already exists for publisher '{0}'.
de: Ein Repository mit demselben Namen oder denselben URIs ist für Herausgeber '{0}' bereits vorhanden.
es: Ya existe un repositorio con el mismo nombre o URI de origen para el editor '{0}'.
fr: Un référentiel ayant le même nom ou les mêmes URI d'origine existe déjà pour l'éditeur {0}.
ja: パブリッシャー '{0}' には、同じ名前または同じ起点 URI のリポジトリがすでに存在します。

source: Mirror '{0}' already exists for the specified publisher.
de: Spiegel '{0}' ist für den angegebenen Herausgeber bereits vorhanden.
es: El reflejo '{0}' ya existe para el editor especificado.
fr: Une copie miroir '{0}' existe déjà pour l'éditeur spécifié.
ja: 指定されたパブリッシャーには、ミラー '{0}' がすでに存在します。

source: Mirror '{0}' is already accessible through the system repository.
de: Spiegel '{0}' ist bereits über das System-Repository verfügbar.
es: Ya se puede acceder al reflejo '{0}' mediante el repositorio del sistema.
fr: Le miroir '{0}' est déjà accessible par le biais du référentiel système.
ja: ミラー '{0}' はすでにシステムリポジトリからアクセス可能です。

source: Origin '{0}' already exists for the specified publisher.
de: Quelle '{0}' ist für diesen Herausgeber bereits vorhanden.
es: El origen '{0}' ya existe para el editor especificado.
fr: Une copie d'origine '{0}' existe déjà pour l'éditeur spécifié.
ja: 指定されたパブリッシャーには、起点 '{0}' がすでに存在します。

source: Origin '{0}' is already accessible through the system repository.
de: Ursprung '{0}' ist bereits über das System-Repository verfügbar.
es: Ya se puede acceder al origen '{0}' mediante el repositorio del sistema.
fr: L'origine '{0}' est déjà accessible par le biais du référentiel système.
ja: 起点 '{0}' はすでにシステムリポジトリからアクセス可能です。

source: Unable to remove origin '{0}' since it is provided by the system repository.
de: Ursprung '{0}' kann nicht entfernt werden, da er vom System-Repository bereitgestellt wird.
es: No se puede eliminar el origen '{0}' ya que es proporcionado por el repositorio del sistema.
fr: Impossible de supprimer l'origine '{0}' car elle est fournie par le référentiel système.
ja: 起点 '{0}' はシステムリポジトリによって提供されているため削除できません。

source: Unable to remove mirror '{0}' since it is provided by the system repository.
de: Spiegel '{0}' kann nicht entfernt werden, da er vom System-Repository bereitgestellt wird.
es: No se puede eliminar el reflejo '{0}' ya que es proporcionado por el repositorio del sistema.
fr: Impossible de supprimer le miroir '{0}' car il est fourni par le référentiel système.
ja: ミラー '{0}' はシステムリポジトリによって提供されているため削除できません。

source: The requested operation requires that one or more package repositories are configured for publisher '{0}'. Use 'pkg set-publisher' to add new package repositories or restore previously configured package repositories for publisher '{0}'.
de: Der angeforderte Vorgang erfordert, dass mindestens ein Package-Repository für Herausgeber '{0}' konfiguriert ist. Verwenden Sie 'pkg set-publisher', um neue Package-Repositorys hinzuzufügen, oder stellen Sie vorher konfigurierte Package-Repositorys für Herausgeber '{0}' wieder her.
es: La operación solicitada requiere que uno o más repositorios de paquetes se configuren para el editor '{0}'. Use 'pkg set-publisher' para agregar nuevos repositorios de paquetes o restaurar repositorios de paquetes configurados anteriormente para el editor '{0}'.
fr: L'opération requise nécessite qu'un ou plusieurs référentiels soient configurés pour l'éditeur '{0}'. Utilisez la commande 'pkg set-publisher' pour ajouter de nouveaux référentiels de package ou restaurer les référentiels de package configurés précédemment pour l'éditeur '{0}'.
ja: 要求された操作では、1 つまたは複数のパッケージリポジトリがパブリッシャー '{0}' 用に 構成されている必要があります。 'pkg set-publisher' を使用して新しいパッケージリポジトリを追加するか、以前構成したパッケージリポジトリを パブリッシャー '{0}' 用に復元してください。

source: Cannot search a repository before or after itself
ca: No es pot cercar a un repositori abans o després d'ell mateix
de: Repository kann nicht vor oder nach sich selbst durchsucht werden
es: No se puede buscar un repositorio anterior o posterior a sí mismo
fr: Impossible d'effectuer une recherche dans le référentiel avant ou après celui-ci
ja: リポジトリの前後でそのリポジトリ自体を検索することはできません
ru: Невозможно выполнить поиск по предыдущему или следующему хранилищу.

source: {0} is an unknown publisher; no other publishers can be ordered relative to it.
de: {0} ist ein unbekannter Herausgeber. Andere Herausgeber können nicht relativ zu diesem angeordnet werden.
es: {0} es un editor desconocido; no existen otros editores relacionados con él que se puedan ordenar.
fr: L'éditeur {0} est inconnu, les autres éditeurs ne peuvent pas être ordonnés par rapport à lui.
ja: {0} は不明なパブリッシャーです。それに関連してほかのパブリッシャーの順序を変更することはできません。

source: Cannot remove the selected repository for a publisher.
ca: No és pot eliminar el repositori seleccionat pel publicador.
de: Das für einen Herausgeber ausgewählte Repository kann nicht entfernt werden.
es: No se puede suprimir el repositorio seleccionado para un editor.
fr: Impossible de supprimer le référentiel sélectionné pour l'éditeur.
ja: パブリッシャーの選択されたリポジトリを削除できません。
ru: Удаление выбранного хранилища для издателя невозможно.

source: Unknown legal URI '{0}'.
de: Unbekannte zulässige URI '{0}'.
es: URI permitido desconocido '{0}'.
fr: URI admis inconnu '{0}'.
ja: 不明な正しい URI '{0}'。

source: Unknown publisher '{0}'.
de: Unbekannter Herausgeber '{0}'.
es: Editor desconocido '{0}'.
fr: Editeur inconnu '{0}'.
ja: 不明なパブリッシャー '{0}'。

source: The repository at {location} does not contain package data for {unknown}; only {known}. This is either because the repository location is not valid, or because the provided publisher does not match those known by the repository.
de: Das Repository in {location} enthält keine Packagedaten für {unknown}; {known}. Das liegt entweder daran, dass das Repository-Verzeichnis nicht gültig ist oder daran, dass der angegebene Herausgeber dem Repository nicht bekannt ist.
es: El repositorio ubicado en {location} no contiene los datos de paquete para {unknown}; solamente para {known}. Esto se debe a que la ubicación del repositorio no es válida o a que el editor proporcionado no coincide con los reconocidos por el repositorio.
fr: Le référentiel stocké dans {location} ne contient pas de données de package pour {unknown} ; uniquement {known}. L'emplacement de ce référentiel n'est pas valide ou l'éditeur fourni ne correspond pas à ceux connus par le référentiel.
ja: {location} にあるリポジトリには、{unknown} のパッケージデータが含まれていません。{known} だけです。 これは、リポジトリの場所が有効でないか、指定されたパブリッシャーがリポジトリで認識されているパブリッシャーと一致しないためです。

source: One or more of the repository origin(s) listed below contains package data for {known}; not {unknown}: {origins} This is either because one of the repository origins is not valid for this publisher, or because the list of known publishers retrieved from the repository origin does not match the client.
de: Mindestens einer der unten aufgeführten Repository-Ursprünge enthält Packagedaten für {known}; nicht {unknown}: {origins} Dies liegt entweder daran, dass ein Repository-Ursprung für diesen Herausgeber ungültig ist oder daran, dass die vom Repository-Ursprung abgerufene Liste der bekannten Herausgeber nicht mit dem Client übereinstimmt.
es: Uno o más de los orígenes de repositorio indicados a continuación contiene datos de paquete para {known}; no para {unknown}: {origins} Esto se debe a que uno de los orígenes de repositorio no es válido para este editor o a que la lista de editores conocidos recuperada del origen de repositorio no coincide con el cliente.
fr: Une ou plusieurs source(s) de référentiel listées ci-dessous contiennent des données de package pour {known} ; pas {unknown} : {origins} Une des sources de ce référentiel n'est pas valide pour cet éditeur ou la liste d'éditeurs connus qui est extraite du référentiel ne correspond pas à celle du client.
ja: 次に示すリポジトリの起点の 1 つ以上に、{known} のパッケージデータは含まれていますが {unknown} のものがありません: {origins} これは、リポジトリの起点のいずれかがこのパブリッシャーに有効でないか、リポジトリの起点から取得された既知のパブリッシャーのリストがクライアントと一致しないためです。

source: The specified publisher repository does not contain any package data for {unknown}; only {known}.
de: Das angegebene Herausgeber-Repository enthält keine Packagedaten für {unknown}; nur %{known}.
es: El repositorio del editor especificado no contiene datos de paquete para {unknown}; solamente para {known}.
fr: Le référentiel d'éditeurs spécifié ne contient aucune donnée de package pour {unknown} ; {known} uniquement.
ja: 指定されたパブリッシャーリポジトリには、{unknown} のパッケージデータが含まれていません。{known} だけです。

source: Unknown related URI '{0}'.
de: Unbekannte zugehörige URI '{0}'.
es: URI relacionado desconocido '{0}'.
fr: URI connexe inconnu '{0}'.
ja: 不明な関連 URI '{0}'。

source: Unknown repository '{0}'.
de: Unbekanntes Repository '{0}'.
es: Repositorio desconocido '{0}'.
fr: Référentiel inconnu '{0}'.
ja: 不明なリポジトリ '{0}'。

source: Unknown repository mirror '{0}'.
de: Unbekannter Repository-Spiegel '{0}'.
es: Reflejo de repositorio desconocido '{0}'.
fr: Référentiel miroir inconnu : {0}.
ja: 不明なリポジトリのミラー '{0}'。

source: Publisher '{pub}' has no repositories that support the '{op}' operation.
de: Herausgeber '{pub}' verfügt über keine Repositorys, die den '{op}'-Vorgang unterstützen.
es: El editor '{pub}' no tiene repositorios que admitan la operación '{op}'.
fr: L'éditeur {pub} ne dispose d'aucun référentiel prenant en charge l'opération '{op}'.
ja: パブリッシャー '{pub}' には、'{op}' 操作をサポートするリポジトリがありません。

source: The specified package repository does not provide publisher configuration information.
de: Das angegebene Paket-Repository enthält keine Informationen zur Herausgeberkonfiguration.
es: El repositorio del paquete especificado no proporciona información de configuración del editor.
fr: Le référentiel de package spécifié ne fournit aucune information de configuration des éditeurs.
ja: 指定されたパッケージリポジトリにはパブリッシャーの構成情報が含まれていません。
ru: Указанное хранилище пакета не предоставляет данные о настройках издателя.

source: The package repository at {0} does not provide publisher configuration information or the information provided is incomplete.
de: Das Paket-Repository in {0} enthält keine Informationen zur Herausgeberkonfiguration oder die vorhandenen Informationen sind unvollständig.
es: El repositorio del paquete ubicado en {0} no proporciona información de configuración del editor o la información proporcionada está incompleta.
fr: Le référentiel de package à {0} ne fournit aucune information de configuration des éditeurs ou les informations fournies sont incomplètes.
ja: {0} にあるパッケージリポジトリには、パブリッシャーの構成情報が含まれていないか、含まれている情報が不完全です。

source: One of the package repository origins for {0} does not provide publisher configuration information or the information provided is incomplete.
de: Einer der Ursprünge des Paket-Repositorys für {0} enthält keine Informationen zur Herausgeberkonfiguration oder die vorhandenen Informationen sind unvollständig.
es: Uno de los orígenes de repositorio del paquete para {0} no proporciona información de configuración del editor o la información proporcionada está incompleta.
fr: L'une des sources du référentiel de package pour {0} ne fournit aucune information de configuration des éditeurs ou les informations fournies sont incomplètes.
ja: {0} のパッケージリポジトリの起点の 1 つに、パブリッシャーの構成情報が含まれていないか、含まれている情報が不完全です。

source: Unknown repository origin '{0}'
de: Unbekannte Repository-Quelle '{0}'.
es: Origen de repositorio desconocido '{0}'
fr: Référentiel d'origine inconnu : {0}
ja: 不明なリポジトリの起点 '{0}'

source: The follwing URIs use unsupported schemes. Supported schemes are file://, http://, and https://.
de: Die folgenden URIs verwenden nicht unterstützte Schemas. Unterstützte Schemas sind: file://, http:// und https://.
fr: Les URI suivants utilisent des schémas non pris en charge. Les schémas pris en charge sont : file://, http://, et https://.
ja: 次の URI はサポートされていないスキームを使用しています。サポートされているスキームは file://、http://、および https:// です。

source: {uri} (scheme: {scheme})
es: {uri} (esquema: {scheme})
fr: {uri} (schéma : {scheme})
ja: {uri} (スキーム: {scheme})
