Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: The following packages are not on the avoid list, so they cannot be removed from it.
de: Folgende Pakete sind nicht auf der Ausschlussliste und können nicht daraus entfernt werden.
es: Los siguientes paquetes no están en la lista de exclusión; por lo tanto no se pueden eliminar de ella.
fr: Les packages suivants ne figurent pas dans la liste des packages à éviter, c'est pourquoi ils ne peuvent pas en être supprimés.
ja: 次のパッケージは回避リストに含まれていないため、リストか ら削除できません。

source: PUBLISHER
ca: PUBLICADOR
fr: EDITEUR
ja: パブリッシャー

source: non-sticky
es: no permanente
fr: non permanent
ja: 非固定的
ru: не клейкий

source: Invalid child image publisher configuration. Child image publisher configuration must be a superset of the parent image publisher configuration. Please update the child publisher configuration to match the parent. If the child image is a zone this can be done automatically by detaching and attaching the zone. The parent image has the following enabled publishers:
de: Ungültige Herausgeberkonfiguration des untergeordneten Abbilds. Die Herausgeberkonfiguration des untergeordneten Abbilds muss eine Obermenge der Herausgeberkonfiguration des übergeordneten Abbilds sein. Aktualisieren Sie die Herausgeberkonfiguration des untergeordneten Abbilds, um mit dem übergeordneten Abbild zu übereinstimmen. Wenn das untergeordnete Abbild eine Zone ist, kann dies automatisch erfolgen, indem die Zone zunächst getrennt und dann wiederverbunden wird. Das übergeordnete Abbild verfügt über die folgenden aktivierten Herausgeber:
es: Configuración no válida del editor de imágenes secundarias. La configuración del editor de imágenes secundarias debe ser un subconjunto de la configuración del editor de imágenes principales. Actualice la configuración del editor de imágenes secundarias para que coincida con la del editor de imágenes principales. Si la imagen secundaria es una zona, esto se puede realizar automáticamente desconectando y conectando la zona. La imagen principal tiene los siguientes editores activados:
fr: Configuration d'éditeur d'image enfant incorrecte. La configuration d'éditeur d'image enfant doit être un surensemble de la configuration d'éditeur d'image parente. Veuillez mettre à jour la configuration de l'éditeur d'enfant pour la mettre en conformité avec le parent. Si l'image enfant est une zone, cette opération peut être effectuée automatiquement en détachant et en attachant la zone. Les éditeurs suivants sont activés pour l'image parente :
ja: 子イメージのパブリッシャー設定が無効です。子イメージのパブリッシャー設定は、親イメージのパブリッシャー 設定の超集合である必要があります。 子のパブリッシャー設定を親と一致するように更新してください。子イメージがゾーンである 場合は、ゾーンの切り離しと接続によってこれが自動的に行われます。 親イメージには次の有効なパブリッシャーがあります:

source: The child image has the following enabled publishers:
de: Das untergeordnete Abbild verfügt über die folgenden aktivierten Herausgeber:
es: La imagen secundaria tiene los siguientes editores activados:
fr: Les éditeurs suivants sont activés pour l'image enfant :
ja: 子イメージには次の有効なパブリッシャーがあります:

source: The following publishers do not have any configured package repositories and cannot be used in package dehydration or rehydration operations:
de: Für folgende Publisher wurden keine Package-Repositorys konfiguriert. Sie können daher nicht für Dehydrier- und Rehydrier-Vorgänge von Packages verwendet werden:
es: Los siguientes editores no tienen ningún repositorio de paquetes configurado y no se pueden usar en operaciones de deshidratación o rehidratación de paquetes:
fr: Les éditeurs suivants ne disposent pas de référentiels de package configurés et ne peuvent pas être utilisés lors des opérations de mise en attente ou de réactivation de package :
ja: 次のパブリッシャーには構成済みのパッケージリポジトリがないため、パッケージのデハイドレーションまたはリハイドレーション操作で使用できません:

source: The following packages all deliver {action} actions to {kv}:
de: Die folgenden Packages stellen alle {action} Aktionen für {kv} bereit:
es: Los siguientes paquetes entregan acciones de {action} a {kv}:
fr: Tous les packages suivants distribuent des actions {action} vers {kv}:
ja: 次のパッケージはすべて {action} アクションを {kv} にもたらします。

source: These packages cannot be installed together. Any non-conflicting subset of the above packages can be installed.
de: Diese Packages können nicht gemeinsam installiert werden. Jeder vereinbare Teil der obigen Packages kann installiert werden.
es: Estos paquetes no se pueden instalar juntos. Se puede instalar cualquier subconjunto de los paquetes anteriores que no presente conflictos.
fr: Ces packages ne peuvent pas être installés ensemble. Tous les sous-ensembles compatibles des packages ci-dessus peuvent être installés.
ja: これらのパッケージは一緒にインストールできません。前述のパッケージの競合しない サブセットはインストールできます。

source: The package {pfmri} delivers multiple copies of {action} {kv}
de: Das Package {pfmri} stellt mehrere Kopien von {action} {kv} bereit
es: El paquete {pfmri} entrega varias copias de {action} {kv}
fr: Le package {pfmri} distribue plusieurs copies de {action} {kv}
ja: パッケージ {pfmri} は {action} {kv} の複数のコピーをもたらします

source: This package must be corrected before it can be installed.
de: Dieses Paket muss berichtigt werden, um es installieren zu können.
es: Se debe corregir este paquete para poder instalarlo.
fr: Ce package doit être corrigé avant d'être installé.
ja: このパッケージはインストールする前に修正する必要があります。

source: The following packages deliver conflicting action types to {0}:
de: Folgende Packages stellen widersprüchliche Aktionstypen in {0} bereit:
es: Los siguientes paquetes entregan tipos de acciones en conflicto a {0}:
fr: Les packages suivants distribuent des types d'action incompatibles vers {0}:
ja: 次のパッケージは競合するアクションタイプを {0} にもたらします:

source: The package {pfmri} delivers conflicting action types ({types}) to {kv}
de: Das Package {pfmri} stellt widersprüchliche Aktionstypen ({types}) für {kv} bereit
es: El paquete {pfmri} entrega tipos de acciones en conflicto ({types}) a {kv}
fr: Le package {pfmri} distribue des types d'action incompatibles ({types}) vers {kv}
ja: パッケージ {pfmri} は競合するアクションタイプ ({types}) を {kv} にもたらします

source: The requested change to the system attempts to install multiple actions for {a} '{k}' with conflicting attributes:
de: Aufgrund der angeforderten Änderung am System wird versucht, mehrere Aktionen für {a} '{k}' mit widersprüchlichen Attributen zu installieren:
es: El cambio solicitado en el sistema intenta instalar varias acciones para {a} '{k}' con atributos en conflicto:
fr: La modification du système demandée tente d'installer plusieurs actions pour {a} '{k}' avec des attributs incompatibles :
ja: 要求されたシステムへの変更によって、競合する属性を持つ複数のアクションを {a} '{k}' にインストールすることが試行されます:

source: {n:d} package delivers '{a}':
de: {n:d} Package stellt '{a}' bereit:
es: El paquete {n:d} entrega '{a}':
fr: Le package {n:d} distribue '{a}':
ja: {n:d} 個のパッケージが '{a}' をもたらします:

source: {n:d} packages deliver '{a}':
de: {n:d} Packages stellen '{a}' bereit:
es: Los paquetes {n:d} entregan '{a}':
fr: Les packages {n:d} distribuent '{a}':
ja: {n:d} 個のパッケージが '{a}' をもたらします:

source: {n:d} packages deliver '{a}', including:
de: {n:d} Pakete stellen '{a}' bereit, einschließlich:
es: {n:d} paquetes entregan '{a}', incluido:
fr: Les packages {n:d} distribuent '{a}', notamment :
ja: {n:d} 個のパッケージが '{a}' (次のものを含む) をもたらします:

source: The following items are outside the boundaries of the target image:
de: Die folgenden Elemente liegen außerhalb der Grenzen des Zielimages:
es: Los siguientes elementos están fuera de los límites de la imagen de destino:
fr: Les éléments suivants sont hors des limites de l'image cible :
ja: 次の項目はターゲットイメージの境界外にあります:

source: The following items are delivered outside the target boot environment:
de: Die folgenden Elemente werden außerhalb der Ziel-Boot-Umgebung bereitgestellt:
es: Los siguientes elementos se entregan fuera del entorno de inicio de destino:
fr: Les éléments suivants sont fournis en dehors de l'environnement d'initialisation cible :
ja: 次の項目はターゲットブート環境の外部に配布されます:

source: The following items are delivered to reserved directories:
de: Die folgenden Elemente werden für reservierte Verzeichnisse bereitgestellt:
es: Los siguientes elementos se entregan a directorios reservados:
fr: Les éléments suivants sont acheminés vers des répertoires réservés :
ja: 次の項目は予約済みディレクトリに配布されます:

source: The package {0} delivers items outside the boundaries of the target image and can not be installed.
de: Das Package {0} stellt Elemente außerhalb der Grenzen des Zielimages bereit und kann nicht installiert werden.
es: El paquete {0} entrega elementos fuera de los límites de la imagen de destino y no se puede instalar.
fr: Le package {0} fournit des éléments hors des limites de l'image cible et ne peut pas être installé.
ja: パッケージ {0} はターゲットイメージの境界外の項目を配布するため、インストールできません。

source: The following packages deliver items outside the boundaries of the target image and can not be installed:
de: Die folgenden Packages stellen Elemente außerhalb der Grenzen des Zielimages bereit und können nicht installiert werden:
es: Los siguientes paquetes entregan elementos fuera de los límites de la imagen de destino y no se pueden instalar:
fr: Les packages suivants fournissent des éléments hors des limites de l'image cible et ne peuvent pas être installés :
ja: 次のパッケージはターゲットイメージの境界外の項目を配布するため、インストールできません:

source: The following packages deliver items outside the target boot environment and can not be installed:
de: Die folgenden Packages stellen Elemente außerhalb der Ziel-Boot-Umgebung bereit und können nicht installiert werden:
es: Los siguientes paquetes entregan elementos fuera del entorno de inicio de destino y no se pueden instalar:
fr: Les packages suivants fournissent des éléments en dehors de l'environnement d'initialisation cible et ne peuvent pas être installés :
ja: 次のパッケージはターゲットブート環境外の項目を配布するため、インストールできません:

source: The following packages deliver items to reserved directories and can not be installed:
de: Die folgenden Packages stellen Elemente für reservierte Verzeichnisse bereit und können nicht installiert werden:
es: Los siguientes paquetes entregan elementos a directorios reservados y no se pueden instalar:
fr: Les packages suivants acheminent les éléments vers des répertoires réservés et peuvent pas être installés :
ja: 次のパッケージは予約済みディレクトリに項目を配布するため、インストールできません:

source: {penultimate} and {ultimate}
de: {penultimate} und {ultimate}
es: {penultimate} y {ultimate}
fr: {penultimate} et {ultimate}
ja: {penultimate} および {ultimate}

source: {list}and {tail}
de: {list} und {tail}
es: {list}y {tail}
fr: {list} et {tail}
ja: {list} および {tail}

source: Requested operation failed for action {action}: {details}
de: Angeforderter Vorgang war für Aktion {action} nicht erfolgreich: {details}
es: La operación solicitada falló para la acción {action}: {details}
fr: L'opération demandée a échoué pour l'action {action} : {details}
ja: 要求された操作はアクション {action} で失敗しました: {details}

source: Requested operation failed for package {fmri}: {details}
de: Angeforderter Vorgang war für Package {fmri} nicht erfolgreich: {details}
es: La operación solicitada falló para el paquete {fmri}: {details}
fr: L'opération demandée a échoué pour le package {fmri} : {details}
ja: 要求された操作はパッケージ {fmri} で失敗しました: {details}

source: The FMRI '{0}' does not contain publisher information and cannot be used for catalog operations.
de: Der FMRI '{0}' enthält keine Herausgeberinformationen und kann nicht für Katalogvorgänge verwendet werden.
es: El FMRI '{0}' no contiene información del editor y no se puede utilizar en operaciones del catálogo.
fr: Le FMRI '{0}' ne contient aucune information sur l'éditeur et ne peut pas être utilisé pour les opérations de catalogue.
ja: FMRI '{0}' にはパブリッシャー情報が含まれていないため、カタログ操作に使用できません。

source: Catalog meta_root '{root}' is invalid; unable to complete operation: '{op}'.
de: Katalog meta_root '{root}' ist ungültig; Vorgang kann nicht abgeschlossen werden: '{op}'.
es: El catálogo meta_root '{root}' no es válido; no se puede completar la operación: '{op}'.
fr: La commande meta_root '{root}' du catalogue n'est pas valide ; impossible de terminer l'opération : '{op}'.
ja: カタログの meta_root '{root}' は無効です; 操作を完了できません: '{op}'。

source: The following catalog files have incorrect permissions:
ca: Els següents fitxers de catàleg tenen permisos incorrectes:
de: Die folgenden Katalogdateien haben falsche Berechtigungen:
es: Los siguientes archivos del catálogo tienen permisos incorrectos:
fr: Les fichiers de catalogue suivants disposent d'autorisations incorrectes :
ja: 次のカタログファイルは不正なアクセス権を持っています:
ru: Следующие файлы каталога имеют некорректные полномочия:

source: {fname}: expected mode: {emode}, found mode: {fmode}
de: {fname}: Erwarteter Modus: {emode}, ermittelter Modus: {fmode}
es: {fname}: modo esperado: {emode}, modo encontrado: {fmode}
fr: {fname} : mode attendu : {emode}, mode trouvé : {fmode}
ja: {fname}: 期待されたモード: {emode}、現在のモード: {fmode}

source: The signature data for the '{0}' catalog file is not valid.
de: Die Signaturdaten für die Katalogdatei '{0}' sind nicht gültig.
es: Los datos de firma del archivo del catálogo '{0}' no son válidos.
fr: Les données de signature pour le fichier de catalogue '{0}' ne sont pas valides.
ja: '{0}' カタログファイルの署名日付は無効です。

source: Unable to determine the updates needed for the current catalog using the provided catalog update data in '{0}'.
de: Die benötigten Updates für den aktuellen Katalog können mithilfe der in '{0}' bereitgestellten Updatedaten nicht ermittelt werden.
es: No se pueden determinar las actualizaciones necesarias para el catálogo actual con los datos de actualización del catálogo proporcionados en '{0}'.
fr: Impossible de déterminer les mises à jour nécessaires pour le catalogue actuel à l'aide des données de mise à jour de catalogue fournies dans '{0}'.
ja: '{0}' で提供されているカタログの更新日付を使用して、現在のカタログに対する更新の必要性を決定できません。

source: Unable to perform '{op}' operation for catalog {name}; completion would result in a duplicate entry for package '{fmri}'.
de: Vorgang '{op}' für Katalog {name} kann nicht ausgeführt werden; Abschluss würde zu einem doppelten Eintrag für Package '{fmri}' führen.
es: No se puede realizar la operación '{op}' para el catálogo {name}; el proceso resultaría en una entrada duplicada del paquete '{fmri}'.
fr: Impossible d'effectuer l'opération '{op}' pour le catalogue {name} ; cela créerait une entrée dupliquée pour le package '{fmri}'.
ja: カタログ {name} に対する '{op}' 操作を実行できません; 完了時にパッケージ '{fmri}' のエントリが重複する可能性があります。

source: Catalog updates can only be applied to an on-disk catalog.
ca: Les actualitzacions de catàleg només es poden aplicar a catàlegs en disc.
de: Katalogaktualisierungen können nur auf einen Katalog auf Festplatte angewendet werden.
es: Las actualizaciones del catálogo sólo se pueden aplicar a un catálogo del disco.
fr: Les mises à niveau de catalogue peuvent uniquement être appliquées à un catalogue sur disque.
ja: カタログの更新は、ディスク上のカタログにのみ適用することができます。
ru: Обновления каталога могут быть применены только к каталогу на диске.

source: Catalog file '{0}' is invalid. Use 'pkgrepo rebuild' to create a new package catalog.
de: Die Katalogdatei "{0}" ist ungültig. Verwenden Sie "pkgrepo rebuild", um einen neuen Packagekatalog zu erstellen.
es: El archivo de catálogo '{0}' no es válido. Utilice 'pkgrepo rebuild' para crear un nuevo catálogo de paquete.
fr: Le fichier catalogue '{0}' n'est pas valide. Utilisez 'pkgrepo rebuild' pour créer un nouveau catalogue de package.
ja: カタログファイル '{0}' は無効です。 'pkgrepo rebuild' を使用して新しいパッケージカタログを作成してください。

source: The content of the catalog for publisher '{0}' doesn't match the catalog's attributes. This is likely the result of a mix of older and newer catalog files being provided for the publisher.
de: Der Inhalt des Katalogs von Herausgeber '{0}' entspricht nicht den Attributen des Katalogs. Dies liegt wahrscheinlich daran, dass für den Herausgeber eine Mischung aus älteren und neueren Katalogdateien bereitgestellt wurde.
es: El contenido del catálogo del editor '{0}' no coincide con los atributos del catálogo. Probablemente la causa sea una combinación de archivos de catálogo antiguos y nuevos proporcionados para el editor.
fr: Le contenu du catalogue de l'éditeur '{0}' ne correspond pas aux attributs du catalogue. Cela est probablement dû à un mélange d'anciens et de nouveaux fichiers de catalogue fournis par l'éditeur.
ja: パブリッシャー '{0}' のカタログの内容がカタログの属性と一致しません。これは、パブリッシャーに古いカタログファイルと新しいカタログファイルが混在して提供されていることが原因と考えられます。

source: Unable to determine the updates needed for the catalog using the provided catalog update data in '{0}'. The specified catalog updates are for an older version of the catalog and cannot be used.
de: Die benötigten Updates für den Katalog können mithilfe der in '{0}' bereitgestellten Updatedaten nicht ermittelt werden. Die angegebenen Katalogupdates gelten für eine ältere Version des Katalogs und können nicht verwendet werden.
es: No se pueden determinar las actualizaciones necesarias para el catálogo con los datos de actualización del catálogo proporcionados en '{0}'. Las actualizaciones del catálogo especificado son para una versión anterior del catálogo y no se pueden utilizar.
fr: Impossible de déterminer les mises à jour nécessaires au catalogue à l'aide des données de mise à jour de catalogue fournies dans '{0}'. Les mises à jour de catalogue spécifiées s'appliquent à une version antérieure du catalogue et ne peuvent être utilisées.
ja: '{0}' で提供されているカタログの更新日付を使用して、このカタログに対する更新の必要性を決定できません。指定されたカタログの更新は、古いバージョンのカタログに対するもので、使用できません。

source: '{0}' could not be found in the catalog.
de: '{0}' wurde im Katalog nicht gefunden.
es: No se pudo encontrar '{0}' en el catálogo.
fr: '{0}' introuvable dans le catalogue.
ja: カタログ内に '{0}' が見つかりませんでした。

source: Unknown catalog update type '{0}'
de: Unbekannter Katalogaktualisierungstyp '{0}'
es: Tipo de actualización de catálogo desconocido '{0}'
fr: Type de mise à jour de catalogue '{0}' inconnu
ja: 不明なカタログ更新タイプ '{0}' です

source: Unrecognized, unknown, or invalid CatalogPart '{0}'
de: Unerkannter, unbekannter oder ungültiger CatalogPart '{0}'
es: Parte del catálogo no reconocida, desconocida o no válida '{0}'
fr: Référence de catalogue '{0}' non reconnue, inconnue ou non valide
ja: 認識できない、不明、または無効な CatalogPart '{0}' です。

source: No matching package could be found for the following FMRIs in any of the catalogs for the current publishers:
ca: No es pot trobar paquets coincidents pel següents FMRIs a qualsevol d'aquests catàlegs pels publicadors actuals:
de: Für die folgenden FMRIs konnten keine Entsprechungen in den Katalogen der aktuellen Herausgeber gefunden werden:
es: No se ha encontrado ningún paquete que coincida con los siguientes FMRI en ninguno de los catálogos de los editores actuales:
fr: Aucun package correspondant n'a été trouvé dans l'un des catalogues des éditeurs actuels pour les FMRI suivants :
ja: 次の FMRI に一致するパッケージが、現在のパブリッシャーのどのカタログにも見つかりませんでした:
ru: Не удалось найти ни один соответствующий пакет для следующих FMRI ни в одном из каталогов для текущих издателей:

source: {0} (pattern did not match)
de: {0} (Muster stimmte nicht überein)
es: {0} (el modelo no coincide)
fr: {0} (le modèle ne correspond pas)
ja: {0} (パターンが一致しませんでした)

source: {0} (publisher did not match)
de: {0} (Herausgeber stimmte nicht überein)
es: {0} (el editor no coincide)
fr: {0} (l'éditeur ne correspond pas)
ja: {0} (パブリッシャーが一致しませんでした)

source: {0} (version did not match)
de: {0} (Version stimmte nicht überein)
es: {0} (la versión no coincide)
fr: {0} (la version ne correspond pas)
ja: {0} (バージョンが一致しませんでした)

source: The search at url {0} returned no results.
de: Die Suche unter der URL {0} ergab keine Ergebnisse.
es: La búsqueda en la URL {0} no devolvió resultados.
fr: La recherche sur l'URL {0} n'a donné aucun résultat.
ja: URL {0} の検索には結果が返されませんでした

source: Some repositories failed to respond appropriately:
de: Einige Repositorys haben nicht entsprechend reagiert:
es: Algunos repositorios no consiguen responder adecuadamente:
fr: Certains référentiels n'ont pas répondu correctement :
ja: 一部のリポジトリが適切に応答できませんでした:
ru: От некоторых хранилищ не получен соответствующий ответ:

source: {0} did not return a valid response.
de: {0} gab keine gültige Antwort zurück.
es: {0} no devolvió una respuesta válida.
fr: {0} n'a renvoyé aucune réponse valide.
ja: {0} は有効な応答を返しませんでした。

source: Some repositories don't support requested search operation:
de: Manche Repositorys unterstützen den angeforderten Suchvorgang nicht:
es: Algunos repositorios no admiten la operación de búsqueda solicitada:
fr: Certains référentiels ne prennent pas en charge l'opération de recherche demandée :
ja: 一部のリポジトリは、要求された検索操作をサポートしません:
ru: Несколько хранилищ не поддерживают запрошенную операцию поиска:

source: Search performance is degraded. Run 'pkg rebuild-index' to improve search speed.
ca: El rendiment de cerca està degradat. Executeu 'pkg rebuild-index' per a millorar la velocitat de la cerca.
de: Die Suchleistung ist reduziert. Führen Sie zum Erhöhen der Suchgeschwindigkeit 'pkg rebuild-index' aus.
es: El rendimiento de la búsqueda ha disminuido. Ejecute 'pkg rebuild-index' para mejorar la velocidad de la búsqueda.
fr: La performance de recherche s'est dégradée. Exécutez la commande 'pkg rebuild-index' pour améliorer la vitesse de recherche.
ja: 検索パフォーマンスが低下しています。 'pkg rebuild-index' を実行して検索スピードを改善してください。
ru: Производительность поиска понизилась. Выполните команду 'pkg rebuild-index' для увеличения скорости поиска.

source: Search repository does not support the requested protocol:
de: Die Repository-Suche unterstützt das angeforderte Protokoll nicht.
es: El repositorio de búsqueda no admite el protocolo solicitado:
fr: Le référentiel de recherche ne prend pas en charge le protocole requis :
ja: 検索リポジトリは、要求されたプロトコルをサポートしていません:
ru: Хранилище поиска не поддерживает запрошенный протокол:

source: The search index appears corrupted.
de: Der Suchindex scheint beschädigt zu sein.
es: El índice de búsqueda parece dañado.
fr: L'index de recherche semble corrompu.
ja: 検索インデックスが壊れているようです。

source: Unable to remove '{0}' due to the following packages that depend on it:
de: "{0}" kann aufgrund der folgenden davon abhängigen Packages nicht entfernt werden:
es: No se pudo eliminar '{0}' debido a los paquetes siguientes que dependen de este elemento:
fr: Impossible de supprimer '{0}' car il existe des packages dépendants :
ja: 次のパッケージが依存しているため、'{0}' を削除できません:

source: This is happening because the following packages needed to be repaired as part of this operation:
de: Die Ursache dafür sind folgende Pakete, die als Teil dieses Vorgangs repariert werden mussten:
es: Esto se produce porque los siguientes paquetes debían repararse como parte de esta operación:
fr: Cela est dû au fait que les packages suivants auraient dû être réparés dans le cadre de cette opération :
ja: これは、この操作の一部として次のパッケージを修復する必要があるために 発生します:

source: You will need to reestablish your access to the repository or remove the packages in the list above.
de: Sie müssen Ihren Zugang zum Repository neu einrichten oder die Pakete in der oben stehenden Liste entfernen.
es: Deberá restablecer el acceso al repositorio o eliminar los paquetes de la lista anterior.
fr: Vous devrez rétablir votre accès au référentiel ou supprimer les packages de la liste ci-dessus.
ja: リポジトリへのアクセスを再度確立するか、上記のリストにあるパッケージを 削除する必要があります。

source: Unable to contact valid package repository
de: Verbindung zum gültigen Paket-Repository kann nicht hergestellt werden
es: No se puede establecer contacto con un repositorio de paquetes válido
fr: Impossible de contacter un référentiel de package valide
ja: 有効なパッケージリポジトリに接続できません
