Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Usage: pkg [options] command [cmd_options] [operands] Basic subcommands: pkg install [-nvq] [--no-refresh] [--no-index] package... pkg uninstall [-nrvq] [--no-index] package... pkg list [-Hafnsuv] [--no-refresh] [package...] pkg update [-fnvq] [--be-name name] [--no-refresh] [--no-index] pkg refresh [--full] [publisher ...] pkg version Advanced subcommands: pkg info [-lr] [--license] [pkg_fmri_pattern ...] pkg search [-alprI] [-s server] query pkg verify [-Hqv] [pkg_fmri_pattern ...] pkg fix [pkg_fmri_pattern ...] pkg contents [-Hmr] [-a attribute=pattern ...] [-o attribute ...] [-s sort_key] [-t action_type ... ] [pkg_fmri_pattern ...] pkg image-create [-fFPUz] [--force] [--full|--partial|--user] [--zone] [-k ssl_key] [-c ssl_cert] [--no-refresh] [--variant <variant_spec>=<instance>] [--facet <facet_spec>=[True,False]] (-p|--publisher) name=uri dir pkg change-variant [-nvq] [--be-name name] <variant_spec>=<instance> [<variant_spec>=<instance> ...] pkg change-facet -nvq [--be-name name] <facet_spec>=[True|False|None] ... pkg variant -H [<variant_spec>] pkg facet -H [<facet_spec>] pkg set-property propname propvalue pkg unset-property propname ... pkg property [-H] [propname ...] pkg set-publisher [-Ped] [-k ssl_key] [-c ssl_cert] [-g origin_to_add | --add-origin=origin_to_add] [-G origin_to_remove | --remove-origin=origin_to_remove] [-m mirror_to_add | --add-mirror=mirror_to_add] [-M mirror_to_remove | --remove-mirror=mirror_to_remove] [--enable] [--disable] [--no-refresh] [--reset-uuid] [--non-sticky] [--sticky] [--search-after=publisher] [--search-before=publisher] publisher pkg unset-publisher publisher ... pkg publisher [-HPn] [publisher ...] pkg history [-Hl] pkg purge-history pkg rebuild-index Options: -R dir --help or -? Environment: PKG_IMAGE
ca: Ús: pkg [opcions] comanda [opcions_cmd] [operands] Subcomandes bàsiques: pkg install [-nvq] [--no-refresh] [--no-index] paquet... pkg uninstall [-nrvq] [--no-index] paquet... pkg list [-Hafnsuv] [--no-refresh] [paquet...] pkg update [-fnvq] [--be-name name] [--no-refresh] [--no-index] pkg refresh [--full] [publicador ...] pkg version Subcomandes avançades: pkg info [-lr] [--license] [patró_paquet_fmri ...] pkg search [-alprI] [-s servidor] consulta pkg verify [-Hqv] [patró_paquet_fmri ...] pkg fix [patró_paquet_fmri ...] pkg contents [-Hmr] [-a atribut=patró ...] [-o atribut ...] [-s clau_ordenació] [-t tipus_acció ... ] [patró_paquet_fmri ...] pkg image-create [-fFPUz] [--force] [--full|--partial|--user] [--zone] [-k clau_ssl] [-c certificat_ssl] [--no-refresh] [--variant <variant_spec>=<instància>] [--facet <facet_spec>=[True,False]] (-p|--publisher) nom=uri dir pkg change-variant [-nvq] [--be-name nom] <variant_spec>=<instància> [<variant_spec>=<instància> ...] pkg change-facet -nvq [--be-name nom] <facet_spec>=[True|False|None] ... pkg variant -H [<variant_spec>] pkg facet -H [<facet_spec>] pkg set-property nom_propietat valor_propietat pkg unset-property nom_propietat ... pkg property [-H] [nom_propietat ...] pkg set-publisher [-Ped] [-k clau_ssl] [-c certificat_ssl] [-g origen_a_afegir | --add-origin=origen_a_afegir] [-G origen_a_eliminar | --remove-origin=origen_a_eliminar] [-m rèplica_a_afegir | --add-mirror=rèplica_a_afegir] [-M rèplica_a_eliminar | --remove-mirror=rèplica_a_eliminar] [--enable] [--disable] [--no-refresh] [--reset-uuid] [--non-sticky] [--sticky] [--search-after=publicador] [--search-before=publicador] publicador pkg unset-publisher publicador ... pkg publisher [-HPn] [publicador ...] pkg history [-Hl] pkg purge-history pkg rebuild-index Opcions: -R dir --help o -? Entorn: PKG_IMAGE

source: No specified packages have newer versions available.
ca: Cap paquet especificat té noves versions disponibles.

source: No installed packages have newer versions available.
ca: Cap paquet instal·lat té noves versions disponibles.

source: known or installed
ca: conegut o instal·lat

source: no packages matching '%(pattern)s' %(state)s
ca: Cap paquet que coincideixi '%(pattern)s' %(state)s

source: pkg: no packages matching the following patterns you specified are installed on the system.
ca: pkg: cap paquet que coincideixi amb els patrons següents que heu especificat, està instal·lat al vostre sistema.

source: WARNING: pkg(5) appears to be out of date, and should be updated before running %s. Please update pkg(5) using 'pfexec pkg install SUNWipkg' and then retry the %s.
ca: AVÍS: pkg(5) sembla que estigui des-actualitzat, i hauria de ser actualitzat abans d'executar %s. Actualitzeu pkg(5) utilitzant 'pfexec pkg install SUNWipkg' i després torneu-ho a intentar %s.

source: The server returned a malformed result. The problematic structure:%r
ca: El servidor ha retornat un resultat dolent. L'estructura problemàtica: %r

source: The server returned an invalid action. %s
ca: El servidor ha retornat una acció no permesa. %s

source: %s is not a valid server URL.
ca: %s no és una URL de servidor vàlida.

source: The server returned a malformed result:%r
ca: El servidor ha retornat una resposta dolenta: %r

source: pkg: contents: '%s' matches multiple packages
ca: pkg: contents: '%s' coincideix amb diversos paquets

source: the -p and -d options may not be combined
ca: les opcions -p i-d no poden combinar-se

source: The origin URIs for '%(pubname)s' do not appear to point to a valid pkg server. Please check the server's address and client's network configuration. Additional details: %(details)s
ca: La URI origen per a '%(pubname)s' no sembla que apunti a un servidor pkg vàlid. Si us plau comproveu l'adreça del servidor i la configuració de la xarxa al client. Detalls addicionals: %(details)s

source: publisher argument must be of the form '<prefix>=<url>'.
ca: l'argument del publicador ha de ser de la forma '<prefix>=<url>'.

source: a publisher must be specified
ca: s'ha d'especificar un publicador

source: a publisher's prefix may not start with the text: %s
ca: el prefix d'un publicador no pot començar amb el text: %s

source: publisher prefix contains invalid characters
ca: el prefix del publicador conté caràcters no permesos

source: cannot create image at %(image_dir)s: %(reason)s
ca: no es pot crear l'imatge a %(image_dir)s: %(reason)s

source: The URI '%(pub_url)s' does not appear to point to a valid pkg server. Please check the server's address and client's network configuration. Additional details: %(error)s
ca: La URI '%(pub_url)s' no sembla que apunti a un servidor pkg vàlid. Si us plau comproveu l'adreça del servidor i la configuració de xarxa del client. Detalls addicionals: %(error)s

source: http_proxy: %s
ca: proxy_http: %s

source: https_proxy: %s
ca: proxy_https: %s

source: This is an internal error. Please let the developers know about this problem by filing a bug at http://defect.opensolaris.org and including the above traceback and this message. The version of pkg(5) is '%s'.
ca: Aquest és un error intern. Si us plau permeteu als desenvolupadors conèixer quan a aquest problema tot omplit l'error a http://defect.opensolaris.org i incloent el següent missatge de traçabilitat i aquest missatge. La versió de pkg(5) és '%s'.

source: Unable to contact a valid package depot. This may be due to a problem with the server, network misconfiguration, or an incorrect pkg client configuration. Please check your network settings and attempt to contact the server using a web browser.
ca: No es pot contactar amb un dipòsit de paquets vàlid. Aquest pot ser degut a un problema amb el servidor, xarxa mal configurada, o a una configuració de pkg incorrecta al client. Si us plau comproveu la xarxa i proveu de contactar amb el servidor mitjançant un navegador web.

source: The pkg command appears out of sync with the libraries provided by SUNWipkg. The client version is %(client)s while the library API version is %(api)s
ca: La comanda pkg sembla fora de sincronització amb les biblioteques proporcionades per SUNWipkg. La versió del client és %(client)s mentre que la versió de l'API de la biblioteca és %(api)s

source: Despite the error while indexing, the update, install, or uninstall has completed successfuly.
ca: Tot i l'error durant l'indexació, el update, l'instal·lació o la desinstal·lació ha estat completada correctament.

source: Trusted Extensions
ca: Extensions de confiança

source: A boolean which determines if the search is executed dynamically as user types or only when user hits the return key.
ca: Un booleà que determina si la cerca s'executa dinàmicament quant l'usuari escriu, o únicament quant es pressiona la tecla Enter.

source: Enable type ahead search
ca: Permetre la cerca mentre s'escriu

source: Start in serach mode
ca: Iniciar en mode cerca

source: <b>Update All completed successfully</b>
ca: <b>Actualitzar tot, s'ha completat de forma correcta</b>

source: Checking for latest SUNWipkg and SUNWipkg-gui, please wait...
ca: Comprovant per al últim SUNWipkg i SUNWipkg-gui, si us plau espereu...

source: Copyright 2010 Sun Microsystems, Inc. All rights reserved. Use is subject to license terms.
ca: Copyright 2010 Sun Microsystems, Inc. Reservats tots els drets. L'ús està subjecte als termes de la llicència.

source: Search Repositories Error
ca: Cercar errors repositoris

source: Specify the publisher name and URI
ca: Especificar el nom i l'URI del publicador

source: Start _Page
ca: _Pàgina d'inici

source: Update All Complete
ca: Actualitzar tot completat

source: _Name:
ca: _Nom:

source: GUI will not respond to any event! %s. Check beadmin.py signals
ca: La interfície gràfica d'usuari no està responent a cap event! %s. Comproveu les senyals de beadmin.py

source: %m/%d/%y %H:%M
ca: %d/%m/%y %H:%M

source: GUI will not respond to any event! %s. Check installupdate.py signals
ca: La interfície gràfica d'usuari no està responent a cap event! %s. Comproveu les senyals de installupdate.py

source: Update Confirmation
ca: Confirmació actualització

source: Please check the network connection. Is the repository accessible?
ca: Si us plau comproveu la connexió de xarxa. És accessible el repositori?

source: Unable to contact a valid package depot. Please check your network settings and attempt to contact the server using a web browser. %s
ca: No es pot contactar amb un magatzem de paquets vàlid. Comproveu les preferències de la vostra xarxa i intenteu contactar amb els servidor utilitzant un navegador web. %s

source: pkg(5) appears to be out of date and should be updated. Please update SUNWipkg package
ca: pkg(5) sembla que estigui desfasat i ha de ser actualitzat. Actualitzeu el paquet SUNWipkg

source: Failure of consistent use of pfexec or gksu when running %s is often a source of this problem.
ca: Error de consistència a l'utilitzar pfexec or gksu quan l'execució %s és sovint l'origen d'aquest problema.

source: There was an error during installation. The search index is corrupted. You might want try to fix this problem by running command: pfexec pkg rebuild-index
ca: S'ha produït un error durant l'instal·lació. L'índex de cerca està corrupte. Podeu provar de solucionar el problema utilitzant la comanda: pfexec pkg rebuild-index

source: This is an Live Image. The install operation can't be performed.
ca: Aquesta és una imatge Live. L'operació d'instal·lar es pot realitzar.

source: The requested operation would affect files that cannotbe modified in the Live Image. Please retry this operation on an alternate boot environment.
ca: L'operació sol·licitada podria afectar a fitxers que no poden ser modificats en l'imatge autònoma. Torneu a intentar aquesta operació en un entorn d'arranc alternatiu.

source: There was an error during installation. The Plan of the operation is missing and the operation can't be finished. You might want try to fix this problem by restarting %s
ca: Hi ha hagut un error durant l'instal·lació. Falta la planificació de l'operació i l'operació no pot finalitzar-se. És possible que vulgueu intentar solucionar aquest problema tot reiniciant %s

source: There was an error during installation. The State of the image is incorrect and the operation can't be finished. You might want try to fix this problem by restarting %s
ca: S'ha produït un error durant l'instal·lació. L'estat de l'imatge no és correcte i l'operació no pot finalitzar-se. Podeu provar de solucionar el problema tornant a iniciar %s

source: Selected package(s) cannot be updated on their own. Click Updates to update all packages.
ca: els paques seleccionats no poden ser actualitzats per ells mateixos Cliqueu a Actualitzacions per actualitzar tots els paquets.

source: Update All Confirmation
ca: Confirmació actualitzar tot

source: Review the package which will be affected by Update all
ca: Revisar el paquet el qual estarà afectat per Actualitzar tot

source: An unknown error occurred in the %s stage. Please let the developers know about this problem by filing a bug together with the error details listed below at:
ca: S'ha produït un error desconegut en l'etapa %s. Permeteu als desenvolupadors conèixer quant a aquest error tot emplenant l'error amb els seus detalls llistats a continuació:

source: API Error
ca: Error d'API

source: GUI will not respond to any event! %s. Check repository.py signals
ca: La interfície gràfica d'usuari no està responent a cap event! %s. Comproveu les senyals de repository.py

source: Name contains invalid characters
ca: El nom conté caràcters no vàlids

source: Name already in use
ca: El nom ja està en ús

source: Description:
ca: Descripció:

source: GUI will not respond to any event! %s. Check declare_signals()
ca: La GUI no respondrà a cap esdeveniment! %s. Comproveu declare_signals()

source: GUI will not respond to any event! %s. Check webinstall.py signals
ca: La interfície gràfica d'usuari no està responent a cap event! %s. Comproveu les senyals de webinstall.py

source: Could not complete the operation on %s: read-only filesystem
ca: No es pot completar l'operació en %s: sistema de fitxers de només-lectura

source: Package %s is missing a dependency: %s
ca: El paquet %s li falta la dependència: %s

source: Some servers failed to respond appropriately:
ca: Alguns servidors no han respost apropiadament:

source: Some servers don't support requested search operation:
ca: Alguns servidors no suporten l'operació de cerca sol·licitada:

source: Search server does not support the requested protocol:
ca: El servidor de cerca no suporta el protocol sol·licitat:

source: The specified file is in an unrecognized format or does not contain valid publisher information: %s
ca: El fitxer especificat té un format incorrecte o no conté informació vàlida quant al publicador: %s

source: The specified file is in an unrecognized format or does not contain valid publisher information.
ca: El fitxer especificat té un format incorrecte o no conté informació vàlida quant al publicador.

source: Unsupported pkg(5) publisher information data format.
ca: Format de dades de l'informació del publicador no suporades pkg(5).

source: pkg: unable to unmount %s
ca: pkg: no es puc desmuntar %s

source: SUNWipkg update check failed.
ca: Error al comprovar d'actualitzar SUNWipkg

source: Planning for %s failed: %s
ca: Error per a la planificació de %s: %s

source: Publisher differs from installed or specifed version
ca: El publicador diferix de la versió instal·lada o especificada

source: Not an absolute path.
ca: No és una ruta absoluta.

source: Unsupported or temporarily unavailable operation requested.
ca: L'operació sol·licitada no està suportada o bé no està disponible temporalment.

source: Unknown failure; no transaction ID provided in response: %s
ca: Error desconegut; cap ID transacció proporcionat en resposta a: %s

source: Got an empty unquote_list while indexing. split_chars was %(sc)s and line was %(l)s
ca: Obtingut un unquote_list buit mentre s'indexava. split_chars era %(sc)s i la línia era %(l)s

source: Had an empty line in the main dictionary. split_chars is %(sc)s and unquote_list is %(ul)s.%(s)s
ca: Tenia una línia buida en el diccionari principal. split_chars és %(sc)s i unquote_list és %(ul)s.%(s)s

source: No matching FMRI found in repository catalog.
ca: Cap coincidència FRI trobada en el catàleg de repositori.

source: The specified catalog file '%s', could not be found.
ca: El fitxer de catàleg especificat '%s', no pot ser trobat.

source: The specified repository root '%s' does not contain a valid repository.
ca: L'arrel del repositori especificat '%s' no conté un repositori vàlid.

source: The specified Transaction ID '%s' is invalid.
ca: El ID transacció especificat '%s' no és vàlid.

source: The format of the repository or its contents needs to be upgraded before it can be used to serve package data. However, it is currently read-only and cannot be upgraded. If using pkg.depotd, please restart the server without read-only so that the repository can be upgraded.
ca: El format del repositori o el seu contingut necessita ser actualitzat abans d'actualitzar-lo per poder utilitzar per servir les dades del paquet. Tanmateix, aquest actualment és de només-lectura i no pot ser actualitzat. Si esteu utilitzant pkg.depotd, reinicieu el servidor sense nomes-lectura aleshores aquest repositori podrà ser actualitzat.

source: Upgrading repository; this process will take some time.
ca: Actualitzant repositori; aquest procés prendrà algun temps.

source: repository directories incomplete
ca: directoris de repositori incomplets

source: repository directories not writeable by current user id or group and are incomplete
ca: als directoris de repositori no hi pot escriure l'id d'usuari o l'id de grup actual, i són incomplets.

source: Unable to locate or read the specified repository configuration file: '%s'.
ca: No es pot localitzar o llegir el fitxer de configuració del repositori especificat: '%s'.

source: All Publishers (Installed)
ca: Tots els publicadors (Instal·lats)

source: <html><head></head><body><H2>Welcome toPackageManager!</H2><br><font color='#0000FF'>Warning: Unable to load Start Page:<br>%s</font></body></html>
ca: <html><head></head><body><H2>Benvinguts al Gestor de Paquets!</H2><br><font color='#0000FF'>Avís: no s'ha pogut carregar la pàgina d'inici:<br>%s</font></body></html>

source: <html><head></head><body><font color='#000000'> <a href='stub'></a></font> <a href='pm?%s=internal&uri=%s'> <IMG SRC = '%s/startpage_star.png' style='border-style: none'></a> <br><br> <h2><font color='#0000FF'>Warning: Unable to load URL</font></h2><br>%s</body></html>
ca: <html><head></head><body><font color='#000000'> <a href='stub'></a></font> <a href='pm?%s=internal&uri=%s'> <IMG SRC = '%s/startpage_star.png' style='border-style: none'></a> <br><br> <h2><font color='#0000FF'>Advertència: No es pot carregar la URL</font></h2><br>%s</body></html>

source: View installed packages for %(s1)sAll Publishers%(e1)s
ca: Visualitzar els paquets per a %(s1)sTots els pùblicadors%(e1)s

source: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Search in All Publishers (Installed)</b></h3><TD></TD></TR><TR><TD></TD><TD> Search is <b>not</b> supported in All Publishers (Installed).</TD></TR>
ca: alt='[Informació]' title='Informació' ALIGN='bottom'></TD><TD><h3><b>Cercar en tots els publicadors (Instal·lats)</b></h3><TD></TD></TR><TR><TD></TD><TD> La cerca <b>no</b> està suportada en tots els publicadors (Instal·lats).</TD></TR>

source: <li style='padding-left:7px'>Return to view packages for All Publishers <a href='pm?pm-action=internal&search=%s'>(Installed)</a></li>
ca: <li style='padding-left:7px'>Torneu a visualitzar els paquets per a tots els publicadors <a href='pm?pm-action=internal&search=%s'>(Instal·lats)</a></li>

source: <table border='0' cellpadding='3' style='table-layout:fixed' ><TR><TD><IMG SRC = '%s/dialog-warning.png' style='border-style: none' alt='[Warning]' title='Warning' ALIGN='bottom'></TD><TD><h3><b>Search Warning</b></h3><TD></TD></TR><TR><TD></TD><TD>Search using only the wildcard character, <b>*</b>, is not supported in All Publishers</TD></TR>
ca: <table border='0' cellpadding='3' style='table-layout:fixed' ><TR><TD><IMG SRC = '%s/dialog-warning.png' style='border-style: none' alt='[Advertència]' title='Advertència' ALIGN='bottom'></TD><TD<h3><b>Advertència cerca</b></h3><TD></TD></TR><TR><TD></TD><TD>Cercar utilitzant únicament amb el caràcter comodí, <b>*</b>, no està suportat en tots els publicadors</TD></TR>

source: The latest version of %s cannot be installed. It may be possible to do so after updating your system. Run "Updates" to get your system up-to-date.
ca: L'última versió de %s no pot ser instal·lada. Això podria ser possible després de l'actualització del vostre sistema. Executeu "Actualitzacions" per tal que el vostre sistema estigui al dia.

source: Cannot upgrade to the latest version of %s. It may be possible to do so after updating your system. Run "Updates" to get your system up-to-date.
ca: No és pot actualitzar a l'última versió de %s. Això podria ser possible després de l'actualització del vostre sistema. Executeu "Actualitzacions" per tal que el vostre sistema estigui al dia.

source: Name Dependency Installed Version
ca: Nom Dependència Versió instal·lada

source: %(number)d packages found matching %(s1)s%(search_text)s%(e1)s
ca: Trobats %(number)d paquets que coincideixen amb %(s1)s%(search_text)s%(e1)s

source: Network problem.
ca: Problema de xarxa.

source: Details:
ca: Detalls:

source: %s/%s catalogs successfully updated:
ca: %s/%s catàlegs correctament actualitzats:

source: Please let the developers know about this problem by filing a bug together with the error details listed below at:
ca: Permeteu als desenvolupadors conèixer quant a aquest problema tot omplint un bug juntament amb els detalls de l'error llistats a continuació:

source: pkg version:
ca: versió pkg:

source: Save selected...
ca: Desar seleccionat...

source: Save selected packages...
ca: Desar paquets seleccionats...

source: The installed package(s) require a reboot before installation can be completed.
ca: Els paquets instal·lats necessiten reiniciar abans que l'instal·lació pugui ser completada.

source: Usage: pkgdepend [options] command [cmd_options] [operands] Subcommands: pkgdepend generate [-DIkMm] manifest proto_dir pkgdepend [options] resolve [-dMos] manifest ... Options: -R dir --help or -? Environment: PKG_IMAGE
ca: Ús: pkgdepend [opcions] comanda [opcions_cmd] [operands] Subcomandes: pkgdepend generate [-DIkMm] manifest dir_proto pkgdepend [options] resolve [-dMos] manifest ... Opcions: -R dir --help o -? Entorn: PKG_IMAGE

source: Generate only accepts exactly two arguments.
ca: Generar únicament accepta dos arguments.

source: The %(cmd)s command appears out of sync with the libraries provided by SUNWipkg. The client version is %(client)s while the library API version is %(api)s
ca: La comanda %(cmd)s sembla que estigui des-sincronitzada amb les biblioteques proporcionades per SUNWipkg. La versió del client és %(client)s mentre que la versió l'API de la biblioteca és %(api)s
