Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Unable to remove {0}; it is in use as a mountpoint. To continue, please unmount the filesystem at the target location and try again.
de: {0} kann nicht entfernt werden, da es als Einhängepunkt verwendet wird. Zum Fortsetzen hängen Sie das Dateisystem am Zielspeicherort aus und versuchen Sie es erneut.
es: No se puede eliminar {0}; está en uso como punto de montaje. Para continuar, desmonte el sistema de archivos en la ubicación de destino y vuelva a intentarlo.
fr: Impossible de supprimer {0} ; il est utilisé comme point de montage. Pour continuer, démontez le système de fichiers à l'emplacement cible, puis réessayez.
ja: {0} を削除できません。マウントポイントとして使用されています。続行するには、ターゲットの場所にあるファイルシステムのマウントを解除してから、やり直してください。

source: Unable to remove {0}; it is in use by the system, another process, or as a mountpoint.
de: {0}; kann nicht entfernt werden, da es vom System, einem anderen Prozess oder als Einhängepunkt verwendet wird.
es: No se puede eliminar {0}; está en uso por el sistema, otro proceso o un punto de montaje.
fr: Impossible de supprimer {0} ; il est utilisé par le système ou un autre processus ou, sert de point de montage.
ja: {0} を削除できません。システムまたは別のプロセスによって使用されているか、マウントポイントとして使用されています。

source: etc/name_to_major: more than one entry for '{0}' is present
de: etc/name_to_major: mehrere Einträge für '{0}' vorhanden
es: etc/name_to_major: existe más de una entrada para '{0}'
fr: etc/name_to_major : plusieurs entrées correspondant à '{0}' existent
ja: etc/name_to_major: '{0}' のエントリが複数存在します

source: etc/name_to_major: '{0}' entry not present
de: etc/name_to_major: Eintrag '{0}' nicht vorhanden
es: etc/name_to_major: la entrada '{0}' no existe
fr: etc/name_to_major : entrée '{0}' absente
ja: etc/name_to_major: '{0}' のエントリが存在しません

source: extra alias '{0}' found in etc/driver_aliases
de: Zusätzlicher Alias '{0}' gefunden in etc/driver_aliases
es: se ha encontrado el alias adicional '{0}' en etc/driver_aliases
fr: alias '{0}' supplémentaire trouvé dans etc/driver_aliases
ja: etc/driver_aliases に余分な別名 '{0}' が見つかりました

source: alias '{0}' missing from etc/driver_aliases
de: Alias '{0}' fehlt in etc/driver_aliases
es: falta el alias '{0}' en etc/driver_aliases
fr: alias '{0}' manquant dans etc/driver_aliases
ja: etc/driver_aliases に別名 '{0}' がありません

source: extra class '{0}' found in etc/driver_classes
de: Zusätzliche Klasse '{0}' gefunden in etc/driver_classes
es: se ha encontrado la clase '{0}' adicional en etc/driver_classes
fr: classe '{0}' supplémentaire trouvée dans etc/driver_classes
ja: etc/driver_classes に余分なクラス '{0}' が見つかりました

source: class '{0}' missing from etc/driver_classes
de: Klasse '{0}' fehlt in etc/driver_classes
es: falta la clase '{0}' en etc/driver_classes
fr: classe '{0}' manquante dans etc/driver_classes
ja: etc/driver_classes にクラス '{0}' がありません

source: extra minor node permission '{0}' found in etc/minor_perm
de: Zusätzliche untergeordnete Knotenberechtigung '{0}' gefunden in etc/minor_perm
es: se ha encontrado el permiso secundario de nodo '{0}' adicional en etc/minor_perm
fr: autorisation mineure de noeud supplémentaire '{0}' trouvée dans etc/minor_perm
ja: etc/minor_perm に余分なマイナーノードアクセス権 '{0}' が見つかりました

source: minor node permission '{0}' missing from etc/minor_perm
de: Untergeordnete Knotenberechtigung '{0}' fehlt in etc/minor_perm
es: falta el permiso secundario de nodo '{0}' en etc/minor_perm
fr: autorisation mineure de noeud '{0}' manquante dans etc/minor_perm
ja: etc/minor_perm にマイナーノードアクセス権 '{0}' がありません

source: extra device policy '{0}' found in etc/security/device_policy
de: Zusätzliche Geräterichtlinie '{0}' gefunden in etc/security/device_policy
es: se ha encontrado la directiva de dispositivos '{0}' adicional en etc/security/device_policy
fr: règle de périphérique supplémentaire '{0}' trouvée dans etc/security/device_policy
ja: etc/security/device_policy に余分なデバイスポリシー '{0}' が見つかりました

source: device policy '{0}' missing from etc/security/device_policy
de: Geräterichtlinie '{0}' fehlt in etc/security/device_policy
es: falta la directiva de dispositivos '{0}' en etc/security/device_policy
fr: règle de périphérique '{0}' manquante dans etc/security/device_policy
ja: etc/security/device_policy にデバイスポリシー '{0}' がありません

source: extra device privilege '{0}' found in etc/security/extra_privs
de: Zusätzliche Geräterichtlinie '{0}' gefunden in etc/security/extra_privs
es: se ha encontrado el privilegio de dispositivos '{0}' adicional en etc/security/extra_privs
fr: privilège de périphérique supplémentaire '{0}' trouvé dans etc/security/extra_privs
ja: etc/security/extra_privs に余分なデバイス特権 '{0}' が見つかりました

source: device privilege '{0}' missing from etc/security/extra_privs
de: Geräteberechtigung '{0}' fehlt in etc/security/extra_privs
es: falta el privilegio de dispositivos '{0}' en etc/security/extra_privs
fr: privilège de périphérique '{0}' manquant dans etc/security/extra_privs
ja: etc/security/extra_privs にデバイス特権 '{0}' がありません

source: Error decompressing payload: {0}
de: Fehler beim Dekomprimieren der Payload: {0}
es: Error de descompresión de carga útil: {0}
fr: Erreur lors de la décompression des données traitées : {0}
ja: ペイロードの圧縮解除時にエラーが発生しました: {0}

source: Action data hash verification failure: expected: {expected} computed: {actual} action: {action}
de: Fehler bei Prüfung von Aktionsdaten-Hash: Erwartet: {expected} berechnet: {actual} Aktion: {action}
es: Fallo de verificación de hash de datos de acción: esperado: {expected} calculado: {actual} acción: {action}
fr: Echec de la vérification du hachage des données d'actions : attendu : {expected} calculé : {actual} action : {action}
ja: アクションのデータハッシュ検証に失敗しました: 期待値: {expected} 計算値: {actual} アクション: {action}

source: System attributes are not supported on the target image filesystem; 'sysattr' ignored for {0}
de: Systemattribute werden im Zielimage-Dateisystem nicht unterstützt. 'sysattr' für {0} ignoriert
es: Los atributos del sistema no se admiten en el sistema de archivos de destino; se ignoró 'sysattr' para {0}
fr: Les attributs système ne sont pas pris en charge sur le système de fichiers cible. 'sysattr' ignoré pour {0}
ja: システム属性がターゲットのイメージファイルシステムでサポートされていません: {0} に対する 'sysattr' は無視されます

source: Could not set system attributes for {path}'{attrlist}': {err}
de: Systemattribute für {path}'{attrlist}' konnten nicht festgelegt werden: {err}
es: No se pudieron definir los atributos del sistema para {path}'{attrlist}': {err}
fr: Impossible de définir les attributs système pour {path}'{attrlist}' : {err}
ja: {path}'{attrlist}' にシステム属性を設定できませんでした: {err}

source: Timestamp: {found} should be {expected}
de: Zeitstempel: {found}, muss {expected} sein
es: Registro de hora: {found} debe ser {expected}
fr: Horodatage : {found} devrait être {expected}
ja: タイムスタンプ: {found} は {expected} である必要があります

source: Size: {found:d} bytes should be {expected:d}
de: Größe: {found:d} Byte muss {expected:d} sein
es: Tamaño: {found:d} bytes deben ser {expected:d}
fr: Taille : {found:d} octets devraient être {expected:d}
ja: サイズ: {found:d} バイトは {expected:d} である必要があります

source: ELF content hash: {found} should be {expected}
de: ELF-Inhalts-Hash: {found} muss {expected} sein
es: Hash de contenido ELF {found} debe ser {expected}
fr: Hachage du contenu ELF : {found} devrait être {expected}
ja: ELF コンテンツハッシュ: {found} は {expected} である必要があります

source: editable file has been changed
de: bearbeitbare Datei wurde geändert
es: se ha cambiado el archivo editable
fr: le fichier modifiable a été modifié
ja: 編集可能なファイルが変更されています

source: Hash: {found} should be {expected}
de: Hash: {found}, muss {expected} sein
es: Hash: {found} debe ser {expected}
fr: Hachage : {found} devrait être {expected}
ja: ハッシュ: {found} は {expected} である必要があります

source: System attribute '{0}' not set
de: Systemattribut "{0}" nicht festgelegt
es: Atributo de sistema '{0}' no definido
fr: L'attribut système '{0}' n'est pas défini
ja: システム属性 '{0}' が設定されていません

source: Skipping: Permission Denied
de: Übersprungen: Berechtigung abgelehnt
es: Omitiendo: Permiso denegado
fr: Opération ignorée : autorisation refusée
ja: スキップしています: アクセス権がありません
ru: Пропуск: нет полномочий

source: Unexpected Error: {0}
de: Unerwarteter Fehler: {0}
es: Error inesperado: {0}
fr: Erreur inattendue : {0}
ja: 予期しないエラー: {0}

source: Unexpected Exception: {0}
de: Unerwartete Ausnahme: {0}
es: Excepción inesperada: {0}
fr: Exception inattendue : {0}
ja: 予期しない例外: {0}

source: No such file: '{0}'.
de: Datei nicht vorhanden: '{0}'.
es: No existe tal archivo: '{0}'.
fr: Pas de fichier : '{0}'.
ja: ファイルがありません: '{0}'。

source: '{0}' is not a file.
de: '{0}' ist keine Datei.
es: '{0}' no es un archivo.
fr: '{0}' n'est pas un fichier.
ja: '{0}' はファイルではありません。

source: Unable to create {path}; a parent directory {p} has been replaced with a file or link. Please restore the parent directory and try again.
de: {path} kann nicht erstellt werden; ein übergeordnetes Verzeichnis {p} wurde durch eine Datei oder einen Link ersetzt. Stellen Sie das übergeordnete Verzeichnis wieder her, und versuchen Sie es erneut.
es: No se puede crear {path}; se reemplazó un directorio principal {p} por un archivo o enlace. Restaure el directorio principal y vuelva a intentarlo.
fr: Impossible de créer {path} ; un répertoire parent {p} a été remplacé par un fichier ou un lien. Restaurez le répertoire parent, puis réessayez.
ja: {path} を作成できません。親ディレクトリ {p} がファイルまたはリンクで置き換えられています。親ディレクトリを復元してからやり直してください。

source: mode is required; value must be of the form '644', '0644', or '04755'.
de: Modus ist erforderlich; Wert muss die Form '644', '0644' oder '04755' aufweisen.
es: se requiere un modo; el valor debe estar en el formato '644', '0644' o '04755'.
fr: le mode est requis ; la valeur doit être une valeur du type '644', '0644' ou '04755'.
ja: モードが必要です。値は '644'、'0644'、または '04755' の形式になっている必要があります。
ru: режим необходим; значение должно иметь форму '644', '0644' или '04755'.

source: mode may only be specified once
de: Modus darf nur einmal angegeben werden
es: el modo sólo se puede especificar una vez
fr: le mode ne peut être spécifié qu'une seule fois
ja: モードは 1 回だけ指定できます

source: '{0}' is not a valid mode; value must be of the form '644', '0644', or '04755'.
de: '{0}' ist kein gültiger Modus; Wert muss die Form '644', '0644' oder '04755' aufweisen.
es: '{0}' no es un modo válido; el valor debe estar en el formato '644', '0644' o '04755'.
fr: '{0}' n'est pas un mode valide ; la valeur doit être une valeur du type '644', '0644' ou '04755'.
ja: '{0}' は有効なモードではありません。値は '644'、'0644'、または '04755' の形式になっている必要があります。

source: owner may only be specified once
de: Eigentümer darf nur einmal angegeben werden
es: el propietario sólo se puede especificar una vez
fr: le propriétaire ne peut être spécifié qu'une seule fois
ja: 所有者は 1 回だけ指定できます

source: group may only be specified once
de: Gruppe darf nur einmal angegeben werden
es: el grupo sólo se puede especificar una vez
fr: le groupe ne peut être spécifié qu'une seule fois
ja: グループは 1 回だけ指定できます

source: '{path}' cannot be installed; the owner '{owner}' was removed by '{src_fmri}'.
de: '{path}' kann nicht berechnet werden, der Eigentümer '{owner}' wurde von '{src_fmri}' entfernt.
es: '{path}' no se puede instalar; el propietario '{owner}' se eliminó mediante '{src_fmri}'.
fr: '{path}' ne peut pas être installé ; le propriétaire '{owner}' a été supprimé par '{src_fmri}'.
ja: '{path}' をインストールできません。所有者 '{owner}' は '{src_fmri}' によって削除されました。

source: '{path}' cannot be installed; '{owner}' is an unknown or invalid user.
de: '{path}' kann nicht installiert werden; '{owner}' ist ein unbekannter oder ungültiger Benutzer.
es: '{path}' no se puede instalar; '{owner}' es un usuario desconocido o no válido.
fr: '{path}' ne peut pas être installé ; '{owner}' est un utilisateur inconnu ou non valide.
ja: '{path}' をインストールできません。'{owner}' は不明または無効なユーザーです。

source: '{path}' cannot be installed; the group '{group}' was removed by '{src_fmri}'.
de: '{path}' kann nicht installiert werden; die Gruppe '{group}' wurde von '{src_fmri}' entfernt.
es: '{path}' no se puede instalar; el grupo '{group}' se eliminó mediante '{src_fmri}'.
fr: '{path}' ne peut pas être installé ; le groupe '{group}' a été supprimé par '{src_fmri}'.
ja: '{path}' をインストールできません。グループ '{group}' は '{src_fmri}' によって削除されました。

source: '{path}' cannot be installed; '{group}' is an unknown or invalid group.
de: '{path}' kann nicht installiert werden; '{group}' ist eine unbekannte oder ungültige Gruppe.
es: '{path}' no se puede instalar; '{group}' es un grupo desconocido o no válido.
fr: '{path}' ne peut pas être installé ; '{group}' est un groupe inconnu ou non valide.
ja: '{path}' をインストールできません。'{group}' は不明または無効なグループです。

source: Owner: {0} is unknown
de: Eigentümer: {0} ist unbekannt
es: Propietario: {0} es desconocido
fr: Propriétaire : {0} est inconnu
ja: 所有者: {0} が不明です

source: Group: {0} is unknown
de: Gruppe: {0} ist unbekannt
es: Grupo: {0} es desconocido
fr: Groupe : {0} est inconnu
ja: グループ: {0} が不明です

source: Missing: {0} does not exist
de: Fehlt: {0} ist nicht vorhanden
es: Falta: {0} no existe
fr: Manquant : {0} n'existe pas
ja: 見つかりません: {0} が存在しません

source: Skipping: Permission denied
de: Übersprungen: Berechtigung verweigert
es: Omitiendo: Permiso denegado
fr: Opération ignorée : autorisation refusée
ja: スキップしています: アクセス権がありません
ru: Пропуск: нет полномочий

source: File Type: '{found}' should be '{expected}'
de: Dateityp: '{found}' muss '{expected}' sein
es: Tipo de archivo: '{found}' debe ser '{expected}'
fr: Type de fichier : '{found}' devrait être '{expected}'
ja: ファイルタイプ: '{found}' は '{expected}' である必要があります

source: Owner: '{found_name} ({found_id:d})' should be '{expected_name} ({expected_id:d})'
de: Eigentümer: '{found_name} ({found_id:d})' muss '{expected_name} ({expected_id:d})' sein
es: Propietario: '{found_name} ({found_id:d})' debe ser '{expected_name} ({expected_id:d})'
fr: Propriétaire : '{found_name} ({found_id:d})' devrait être '{expected_name} ({expected_id:d})'
ja: 所有者: '{found_name} ({found_id:d})' は '{expected_name} ({expected_id:d})' である必要があります

source: Group: '{found_name} ({found_id})' should be '{expected_name} ({expected_id})'
de: Gruppe: '{found_name} ({found_id})' muss '{expected_name} ({expected_id})' sein
es: Grupo: '{found_name} ({found_id})' debe ser '{expected_name} ({expected_id})'
fr: Groupe : '{found_name} ({found_id})' devrait être '{expected_name} ({expected_id})'
ja: グループ: '{found_name} ({found_id})' は '{expected_name} ({expected_id})' である必要があります

source: Mode: {found} should be {expected}
de: Modus: {found}, muss {expected} sein
es: Modo: {found} debe ser {expected}
fr: Mode : {found} devrait être {expected}
ja: モード: {found} は {expected} である必要があります

source: Unable to remove {0}; it is in use as a mountpoint. To continue, please unmount the filesystem at the target location and try again.
de: {0} kann nicht entfernt werden, da es als Einhängepunkt verwendet wird. Zum Fortsetzen hängen Sie das Dateisystem am Zielspeicherort aus und versuchen Sie es erneut.
es: No se puede eliminar {0}; está en uso como punto de montaje. Para continuar, desmonte el sistema de archivos en la ubicación de destino y vuelva a intentarlo.
fr: Impossible de supprimer {0} ; il est utilisé comme point de montage. Pour continuer, démontez le système de fichiers à l'emplacement cible, puis réessayez.
ja: {0} を削除できません。マウントポイントとして使用されています。続行するには、ターゲットの場所にあるファイルシステムのマウントを解除してから、やり直してください。

source: {0} may only be specified once
de: {0} darf nur einmal angegeben werden
es: {0} sólo se puede especificar una vez
fr: {0} ne peut être spécifié qu'une seule fois
ja: {0} は 1 回だけ指定できます

source: {0} must be an integer
de: {0} muss eine Ganzzahl sein
es: {0} debe ser un número entero
fr: {0} doit être un nombre entier
ja: {0} は整数である必要があります

source: {0} is required
de: {0} ist erforderlich
es: {0} es necesario
fr: {0} est requis
ja: {0} が必要です

source: Cannot install '{final_path}'; parent directory {parent_dir} is a link to {parent_target}. To continue, move the directory to its original location and try again.
de: '{final_path}' kann nicht installiert werden; übergeordnetes Verzeichnis {parent_dir} ist ein Link zu {parent_target}. Um fortzufahren, verschieben Sie das Verzeichnis in den ursprünglichen Speicherort und wiederholen den Vorgang.
es: No se puede instalar '{final_path}'; el directorio principal {parent_dir} es un enlace a {parent_target}. Para continuar, mueva el directorio a la ubicación original e inténtelo nuevamente.
fr: Impossible d'installer '{final_path}' ; le répertoire parent {parent_dir} est un lien vers {parent_target}. Pour continuer, remettez le répertoire à son emplacement d'origine, puis réessayez.
ja: '{final_path}' をインストールできません。親ディレクトリ {parent_dir} は {parent_target} へのリンクです。続行するには、ディレクトリを元の場所に移動してから、やり直してください。

source: Group cannot be installed. Updating related user entries failed.
de: Gruppe kann nicht installiert werden. Aktualisierung der zugehörigen Benutzereinträge war nicht erfolgreich.
es: No se puede instalar el grupo. Falló la actualización de las entradas de usuario relacionadas.
fr: Le groupe ne peut pas être installé. La mise à jour des entrées utilisateur connexes a échoué.
ja: グループをインストールできません。関連するユーザーエントリの更新に失敗しました。

source: Group cannot be installed without group database files present.
de: Gruppe kann nicht ohne Gruppendatenbankdateien installiert werden.
es: El grupo no se puede instalar si no están presentes los archivos de base de datos del grupo.
fr: Le groupe ne peut pas être installé en l'absence des fichiers de base de données du groupe.
ja: グループデータベースファイルが存在しないとグループをインストールできません。
ru: Невозможно установить группу без файлов базы данных группы.

source: {entry}: '{found}' should be '{expected}'
de: {entry}: '{found}' muss '{expected}' sein
es: {entry}: '{found}' debe ser '{expected}'
fr: {entry} : '{found}' devrait être '{expected}'
ja: {entry}: '{found}' は '{expected}' である必要があります

source: Unable to create hard link {path}; target {target} is missing.
de: Hard-Link {path} kann nicht erstellt werden; Ziel {target} fehlt.
es: No se puede crear el enlace físico {path}; falta el destino {target}.
fr: Impossible de créer un lien physique {path} ; la cible {target} est manquante.
ja: ハードリンク {path} を作成できません。ターゲット {target} がありません。

source: Target '{0}' does not exist
de: Ziel '{0}' ist nicht vorhanden
es: El destino '{0}' no existe
fr: La cible '{0}' n'existe pas
ja: ターゲット '{0}' が存在しません

source: Broken: Path and Target ({0}) inodes not the same
de: Fehler: Inodes von Pfad und Ziel ({0}) stimmen nicht überein
es: Interrumpido: los inode de la ruta y del destino ({0}) no son los mismos
fr: Corrompu : L'inode du chemin et l'inode de la cible ({0}) ne sont pas identiques
ja: 壊れています: パスとターゲット ({0}) の i ノードが異なっています

source: Missing directory var/sadm/pkg/{0}
de: Verzeichnis var/sadm/pkg/{0} fehlt
es: Falta el directorio var/sadm/pkg/{0}
fr: Répertoire var/sadm/pkg/{0} manquant
ja: ディレクトリ var/sadm/pkg/{0} がありません

source: Missing file var/sadm/pkg/{0}/pkginfo
de: Datei var/sadm/pkg/{0}/pkginfo fehlt
es: Falta el archivo var/sadm/pkg/{0}/pkginfo
fr: Fichier var/sadm/pkg/{0}/pkginfo manquant
ja: ファイル var/sadm/pkg/{0}/pkginfo がありません

source: License file {0} does not exist.
de: Lizenzdatei {0} ist nicht vorhanden.
es: El archivo de licencia {0} no existe.
fr: Le fichier de licence {0} n'existe pas.
ja: ライセンスファイル {0} が存在しません。

source: Hash: '{found}' should be '{expected}'
de: Hash: '{found}', muss '{expected}' sein
es: Hash: '{found}' debe ser '{expected}'
fr: Hachage : '{found}' devrait être '{expected}'
ja: ハッシュ: '{found}' は '{expected}' である必要があります

source: Target: '{found}' should be '{expected}'
de: Ziel: '{found}', muss '{expected}' sein
es: Destino: '{found}' debe ser '{expected}'
fr: Cible : '{found}' devrait être '{expected}'
ja: ターゲット: '{found}' は '{expected}' である必要があります

source: a mediator must be provided when mediator-version, mediator-implementation, or mediator-priority is specified
de: Es muss ein Vermittler angegeben werden, wenn mediator-version, mediator-implementation oder mediator-priority angegeben wurde.
es: se debe proporcionar un mediador cuando se especifica el atributo mediator-version, mediator-implementation o mediator-priority
fr: un médiateur doit être indiqué lorsque mediator-version, mediator-implementation ou mediator-priority sont spécifiés
ja: mediator-version、mediator-implementatio、または mediator-priority を指定した場合は、メディエータを指定する必要があります

source: a mediator-version or mediator-implementation must be provided if a mediator is specified
de: Es muss mediator-version oder mediator-implementation angegeben werden, wenn ein Vermittler angegeben wurde.
es: si se especifica un mediador, se debe proporcionar el atributo mediator-version o mediator-implementation
fr: mediator-version ou mediator-implementation doit être indiqué lorsqu'un médiateur est spécifié
ja: メディエータを指定した場合は、mediator-version または mediator-implementation を指定する必要があります

source: Missing algorithm attribute
de: Fehlendes Algorithmusattribut
es: Falta el atributo de algoritmo
fr: Attribut d'algorithme manquant
ja: アルゴリズム属性がありません
ru: Отсутствует атрибут алгоритма

source: The signature value did not match the expected value. action: {0}
de: Der Signaturwert entspricht nicht dem erwarteten Wert. Aktion: {0}
es: El valor de firma no coincide con el valor esperado. Acción: {0}
fr: La valeur de signature ne correspond pas à la valeur attendue. Action : {0}
ja: 署名の値が期待された値と一致しませんでした。アクション: {0}

source: The signature value did not match the expected value.
de: Der Signaturwert entspricht nicht dem erwarteten Wert.
es: El valor de firma no coincide con el valor esperado.
fr: La valeur de signature ne correspond pas à la valeur attendue.
ja: 署名の値が期待された値と一致しませんでした。

source: {0} was expected to be a RSA key but could not be read correctly.
de: Es wurde erwartet, dass {0} ein RSA-Schlüssel ist, das Element konnte jedoch nicht ordnungsgemäß eingelesen werden.
es: Se esperaba que {0} fuera una clave RSA pero no se ha podido leer correctamente.
fr: {0} devait être une clé RSA mais elle n'a pu être lue correctement.
ja: {0} は RSA キーのはずでしたが、正しく読み取れませんでした。

source: User cannot be installed without user database files present.
de: Benutzer kann nicht ohne Benutzerdatenbankdateien installiert werden.
es: El usuario no se puede instalar si no están presentes los archivos de base de datos del usuario.
fr: L'utilisateur ne peut pas être installé en l'absence des fichiers de base de données de l'utilisateur.
ja: ユーザーデータベースファイルが存在しないとユーザーをインストールできません。
ru: Невозможно установить пользователя без файлов базы данных пользователя.

source: {group} is an unknown or invalid group
de: {group} ist eine unbekannte oder ungültige Gruppe
es: {group} es un grupo no válido o desconocido
fr: {group} est un groupe inconnu ou non valide.
ja: {group} は不明または無効なグループです

source: Path outside alternate root: root={root}, path={path}
de: Pfad außerhalb des alternativen Root-Verzeichnisses: root={root}, path={path}
es: Ruta fuera de la raíz alternativa: root={root}, path={path}
fr: Chemin non compris dans la racine de rechange : racine={root}, chemin={path}
ja: パスが代替ルートの外部にあります: ルート={root}, パス={path}

source: Multi-package datastreams are not supported. Please use pkgtrans(1) to convert this bundle to multiple filesystem format packages.
de: Datenströme mit mehreren Paketen werden nicht unterstützt. Verwenden Sie pkgtrans(1), um dieses Bundle in mehrere Dateisystemformatpakete zu konvertieren.
es: No se admite la secuencia de datos de varios paquetes. Use pkgtrans(1) para convertir este paquete en varios paquetes con formato del sistema de archivos.
fr: Les flux de données multi-packages ne sont pas pris en charge. Utilisez pkgtrans(1) pour convertir ce lot en plusieurs packages de formats de systèmes de fichiers.
ja: マルチパッケージのデータストリームはサポートされていません。 pkgtrans(1) を使用してこのバンドルを複数のファイルシステム形式のパッケージに 変換してください。
