Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: '%(op)s' failed for transaction ID '%(trans_id)s'; status '%(status)s': %(msg)s
ca: '%(op)s' error pel ID transacció '%(trans_id)s'; estat '%(status)s': %(msg)s
ru: '%(op)s' не удалось выполнить для идентификатора транзакции '%(trans_id)s'; статус '%(status)s': %(msg)s

source: '%(op)s' failed for transaction ID '%(trans_id)s': %(msg)s
ca: '%(op)s' error pel ID transacció '%(trans_id)s': %(msg)s
ru: '%(op)s' не удалось выполнить для идентификатора транзакции '%(trans_id)s': %(msg)s

source: '%(op)s' failed; unable to initiate transaction: %(msg)s
ca: '%(op)s' error; no es pot iniciar la transacció: %(msg)s
ru: '%(op)s' не удалось выполнить; невозможно инициировать транзакцию: %(msg)s

source: Unable to initiate transaction: %s
ca: No es pot inicialitzar la transacció: %s
ru: Невозможно инициировать транзакцию: %s

source: Unsupported operation '%(op)s' for the specified repository type '%(type)s'.
ca: Operació no suportada '%(op)s' pel tipus '%(type)s' de repositori especificat.
ru: Неподдерживаемая операция '%(op)s' для указанного типа хранилища '%(type)s'.

source: The file to be added is not a file. The path given was %s.
ru: Добавляемый элемент не является файлом. Указан следующий путь: %s.

source: An error occurred while trying to initialize the repository directory structures: %s
ca: S'ha produït un error mentre s'intentava inicialitzar l'estructura dels directoris del repositori: %s
ru: Ошибка произошла при попытке инициализации структур каталога хранилища: %s

source: An unparseable character in query at position : %d
ca: Un caràcter in-analitzable en la posició de la consulta : %d
ru: Неанализируемый символ в запросе в позиции: %d

source: In query %(query)s, %(name)s had a bad value of '%(bv)s'.
ca: En la consulta %(query)s, %(name)s tenia un valor dolent de '%(bv)s'.
ru: В запросе %(query)s, %(name)s было неправильное значение '%(bv)s'.

source: A query is expected to have five fields: case sensitivity, return type, number of results to return, the number at which to start returning results, and the text of the query. The query provided lacked at least one of those fields: %s
ca: S'espera que una consulta tingui cinc camps: distinció de majúscules i de minúscules, tipus a retornar, nombre de resultats a retornar, en nombre amb el qual iniciar el retorn de resultats, i el text d'una consulta. La consulta proporcionada necessita com a mínim d'un d'aquest camps: %s
ru: Для запроса предполагалось наличие пяти полей: учет регистра, тип возврата, число возвращаемых результатов, число начала возврата результатов и текст запроса. В предоставленном запросе отсутствует как минимум одно из этих полей: %s

source: Problem occurred with: %s
ca: S'ha produït un problema amb: %s
ru: Произошла проблема с: %s

source: The search index cannot be modified as it is currently in use by another process: pid %(pid)s on %(host)s.
ru: Невозможно изменить индекс поиска, поскольку в настоящее время он используется другим процессом: pid %(pid)s на %(host)s.

source: Info does not recognize the following options: %s
ca: Info no reconeix les següents opcions: %s
ru: Команда info не распознает следующие параметры: %s

source: The specified Action Type, '%s', is not valid.
ca: El tipus d'acció especificada, '%s', no ès vàlida.
ru: Указанный тип действия, '%s', является недопустимым.

source: A package repository (or a directory with content) already exists at '%s'.
ru: Хранилище пакета (или каталог с содержимым) уже существует в '%s'.

source: No file could be found for the specified hash name: '%s'.
ca: Cap fitxer pot ser trobat pel nom hash especificat: '%s'.
ru: Не удалось найти файл для указанного имени хэша: '%s'.

source: The path '%s' does not contain a valid package repository.
ru: Путь '%s' не содержит действительное хранилище пакета.

source: This operation requires that a default publisher has been set or that a publisher be specified in the FMRI '%s'.
ru: Для этой операции требуется установить издателя по умолчанию или указать издателя в FMRI '%s'.

source: No transaction matching '%s' could be found.
ru: Не удалось найти транзакции, соответствующие '%s'.

source: The repository cannot be modified as it is currently in use by another process: pid %(pid)s on %(host)s.
ru: Невозможно изменить хранилище, поскольку в настоящее время оно используется другим процессом: pid %(pid)s на·%(host)s.

source: No manifest could be found for the FMRI: '%s'.
ca: No s'ha pogut trobar cap manifest pel FMRI: '%s'.
ru: Не удалось найти манифест для FMRI: '%s'.

source: No such file '%s'.
ru: Файл '%s' отсутствует.

source: The specified search token '%s' is invalid.
ca: La senyal de cerca especificada '%s' no és vàlida.
ru: Указанный маркер поиска '%s' является недопустимым.

source: Publisher '%s' already exists.
ru: Издатель '%s' уже существует.

source: No publisher matching '%s' could be found.
ru: Не удалось найти издателя, соответствующего '%s'.

source: Skipping %(fmri)s; invalid manifest: %(error)s
ca: Omitint %(fmri)s; manifest no vàlid: %(error)s
ru: Пропуск %(fmri)s; недопустимый манифест: %(error)s

source: Transforming repository catalog; this process will take some time.
ru: Преобразование каталога хранилища; этот процесс займет некоторое время.

source: Index corrupted or out of date. Removing old index directory (%s) and rebuilding search indexes.
ca: L'Índex està corrupte o fora de data. Eliminant l'antic directori d'índex (%s) i tornant a construir els índexs de cerca.
ru: Индекс поврежден или устарел. Удаляется старый каталог индекса (%s) и выполняется перестроение поисковых индексов.

source: Unrecognized or malformed data in operation payload: '%s'.
ca: Dades no reconegudes o mal-formades en l'operació payload: '%s'.
ru: Нераспознанные или недопустимые данные в полезной нагрузке операции: '%s'.

source: The specified client_release is invalid: '%s'
ca: El client_release especificat no és vàlid: '%s'
ru: Указанная client_release является недопустимой: '%s'

source: 'The specified FMRI, '%s', has an invalid version.
ca: 'El FMRI especificat, '%s', no té una versió vàlida.
ru: Указанный FMRI, '%s', имеет недопустимую версию.

source: The specified FMRI, '%s', already exists or has been restricted.
ca: El FMRI especificat, '%s', ja existeix o bé ha estat restringit.
ru: Указанный FMRI, '%s', уже существует или ограничен.

source: The specified FMRI, '%s', must include the publisher prefix as the repository contains package data for more than one publisher or a default publisher has not been defined.
ca: El FMRI especificat, '%s', ha d'incloure el prefix del publicador de fet el repositori conté dades de paquet per més d'un publicador o el publicador predeterminat no ha estat definit.
ru: Указанный FMRI, '%s', должен включать в себя префикс издателя, так как хранилище содержит данные пакета для более чем одного издателя, или не определен издатель по умолчанию.

source: Need an existing instance of %s to exist to append to it
ru: Для добавления необходимо существование экземпляра %s

source: The specified FMRI, '%s', is invalid.
ca: El FMRI especificat, '%s', no és vàlid.
ru: Указанный FMRI, '%s', является недопустимым.

source: No Transaction matching ID '%s' could be found.
ru: Не удалось найти транзакцию, соответствующую идентификатору '%s'.

source: Transaction ID '%s' is already open.
ca: El ID transacció '%s' ja està obert.
ru: Идентификатор транзакции '%s' уже открыт.

source: An obsolete package cannot contain actions other than 'set'.
ca: Un paquet obsolet no pot contenir accions que no siguin altres que 'set'.
ru: Устаревший пакет не может содержать иных действий кроме действия 'set'.

source: A renamed package cannot contain actions other than 'set' and 'depend'.
ca: Un paquet reanomenat no pot contenir accions que no siguin altres que 'set' o 'depend'.
ru: Переименованный пакет не может содержать иных действий, кроме действий 'set' и 'depend'.

source: A '%s' action cannot be present in an obsolete package: %s
ca: Una acció '%s' no pot estar present en un paquet obsolet: %s
ru: Действие '%s' не может быть в устаревшем пакете: %s

source: A '%s' action cannot be present in a renamed package: %s
ca: Una acció '%s' no pot estar present en un paquet reanomenat: %s
ru: Действие '%s' не может быть в переименованном пакете: %s

source: All Publishers
ca: Tots els publicadors
ru: Все издатели

source: All Installed Packages
ru: Все установленные пакеты

source: All Publishers (Search)
ca: Tots els publicadors (Cerca)
ru: Все издатели (поиск)

source: Add...
ca: Afegir...
ru: Добавить...

source: Type text to search for the package.
ca: Escriviu el text per a cercar el paquet.
ru: Введите текст для поиска пакета.

source: Refresh list of packages and package status
ca: Refrescar el llistat i estat dels paquets
ru: Обновить список пакетов и статус пакета

source: Select packages by marking the checkbox and click to Install/Update
ca: Seleccioneu els paquets tot marcant la casella de selecció i cliqueu a Instal·lar/Actualitzar
ru: Выберите пакеты путем установки соответствующих флажков, и нажмите кнопку "Установка/обновление".

source: Select packages by marking the checkbox and click to Remove selected
ca: Seleccioneu els paquets tot marcant la casella de selecció i cliqueu a Treure seleccionats
ru: Выберите пакеты путем установки соответствующих флажков, и нажмите кнопку "Удалить" для удаления выбранных пакетов.

source: Checks if updates are available
ca: Comprova si hi han actualitzacions disponibles
ru: Проверка наличия обновлений

source: Cancel current operation
ca: Cancel·lar operació actual
ru: Отменить текущую операцию

source: Click to toggle selections
ca: Cliqueu a commutar seleccions
ru: Нажмите для переключения выбранных параметров

source: All Packages
ca: Tots els paquets
ru: Все пакеты

source: Installed Packages
ca: Paquets instal·lats
ru: Установленные пакеты

source: Not Installed Packages
ca: Paquets no instal·lats
ru: Неустановленные пакеты

source: Selected Packages
ca: Paquets seleccionats
ru: Выбранные пакеты

source: failed to respond
ca: error al respondre
ru: не удалось ответить

source: invalid response
ca: resposta no permesa
ru: неверный ответ

source: A valid response was not returned.
ca: No s'ha retornat una resposta vàlida.
ru: Допустимый ответ не вернулся.

source: unsupported search
ca: cerca no suportada
ru: неподдерживаемый поиск

source: Search Errors: click to view
ca: Errors de cerca: clicar per a visualitzar
ru: Поиск ошибок: щелкните для просмотра

source: Status
ca: Estat
ru: Статус

source: all selection toggle
ca: Commutar tota la sel·lecció
ru: переключатель "Выбрать все"

source: Updates Available
ca: Actualitzacions disponibles
ru: Доступны обновления

source: All Categories
ca: Totes les categories
ru: Все категории

source: Meta Packages
ca: Meta paquets
ru: Метапакеты

source: Applications
ca: Aplicacions
ru: Приложения

source: Desktop (GNOME)
ca: Escriptori (GNOME)
ru: Рабочий стол (GNOME)

source: Development
ca: Desenvolupament
ru: Разработка

source: Distributions
ca: Distribucions
ru: Дистрибутивы

source: Drivers
ca: Controladors
ru: Драйверы

source: Web Services
ca: Serveis Web
ru: Веб-службы

source: Search all publishers
ca: Cercar a tots els publicadors
ru: Поиск по всем издателям

source: Search current publisher
ca: Cercar al publicador actual
ru: Поиск по текущему издателю

source: Search cleared
ca: Cerca netejada
ru: Поиск сброшен

source: Refreshing package catalog information
ca: Refrescant l'informació del catàleg de paquets
ru: Обновление информации о каталоге пакетов

source: All
ca: Tots
ru: Все

source: Selected for Removal:
ca: Seleccionat per a eliminar:
ru: Выбрано для удаления:

source: Selected for Install/Update:
ca: Seleccionat per a instal·lar/actualitzar:
ru: Выбрано для установки/обновления:

source: Select packages by marking the checkbox and click to Install/Update.
ca: Seleccionar paquets tot marcant-los a la casella i clicar a instal·lar/actualitzar.
ru: Выберите пакеты, отмечая флажок, и нажмите кнопку "Установка/обновление".

source: Select packages by marking the checkbox and click to Remove selected.
ca: Seleccionar paquets tot marcant-los a la casella i clicar a eliminar.
ru: Выберите пакеты, отмечая флажок, и нажмите кнопку "Удалить выбранное".

source: Loading package list
ca: Carregant llista de paquets
ru: Загрузка списка пакетов

source: Selected publisher does not contain any packages.
ca: El publicador seleccionat no conté cap paquet.
ru: Выбранный издатель не содержит пакеты.

source: Recent Searches
ca: Cerques recents
ru: Недавние результаты поиска

source: Total: %(total)s Selected: %(selected)s
ca: Total: %(total)s Seleccionats: %(selected)s
ru: Итого: %(total)s Выбрано: %(selected)s

source: Searching %(s1)s%(active_pub)s%(e1)s for %(s1)s%(search_text)s%(e1)s ...
ca: Cercant a %(s1)s%(active_pub)s%(e1)s per %(s1)s%(search_text)s%(e1)s ...
ru: Поиск %(s1)s%(active_pub)s%(e1)s для %(s1)s%(search_text)s%(e1)s...

source: Searching for %(s1)s%(search_text)s%(e1)s ...
ca: Cercant %(s1)s%(search_text)s%(e1)s ...
ru: Поиск %(s1)s%(search_text)s%(e1)s...

source: %(number)d package found matching %(s1)s%(search_text)s%(e1)s
ru: Найден пакет %(number)d, соответствующий %(s1)s%(search_text)s%(e1)s

source: Unable to initialize gtk
ca: No es pot inicialitzar gtk
ru: Невозможно инициализировать gtk

source: Usage: pkgdepend [options] command [cmd_options] [operands] Subcommands: pkgdepend generate [-IMm] -d dir [-d dir] [-D name=value] [-k path] manifest_path pkgdepend [options] resolve [-dmosv] manifest ... Options: -R dir --help or -? Environment: PKG_IMAGE
ru: Использование: pkgdepend [options] command [cmd_options] [operands] Подкоманды: pkgdepend generate [-IMm] -d dir [-d dir] [-D name=value] [-k path] manifest_path pkgdepend [options] resolve [-dmosv] manifest ... Параметры: -R dir --help or -? Среда: PKG_IMAGE

source: The proto directory %s could not be found.
ca: No s'ha pogut trobar el directori proto %s.
ru: Не удалось найти каталог proto '%s'.

source: The manifest file %s could not be found.
ca: No s'ha pogut trobar el fitxer manifest %s.
ru: Не удалось найти указанный файл манифеста '%s'.

source: Could not parse manifest %(manifest)s because of the following line: %(line)s
ca: No es pot analitzar el manifest %(manifest)s a causa de la següent línia: %(line)s
ru: Не удалось проанализировать манифест %(manifest)s из-за следующей строки: %(line)s

source: The output directory %s is not a directory.
ca: El directori de sortida %s no és un directori.
ru: Выходной каталог %s не является каталогом.

source: '%s' is not an install image
ca: '%s' no és una imatge d'instal·lació
ru: '%s' не является образом установки

source: Could not parse one or more manifests because of the
ca: No es poden analitzar un o més manifests a causa de
ru: Не удалось проанализировать один или несколько манифестов из-за

source: Could not open %s to echo manifest
ca: No es pot obrir el manifest %s per a repetir el manifest
ru: Не удалось открыть %s для эхо-тестирования манифеста

source: Could not open output file %s for writing
ca: No es pot obrir el fitxer de sortida %s per escriptura
ru: Не удалось открыть выходной файл %s для записи

source: Out dir %s does not exist and could not be created. Error is: %s
ca: El directori de sortida %s no existeix i no pot ser creat. L'error és: %s
ru: Выходной каталог %s не существует, и его не удалось создать. Ошибка: %s

source: The %(cmd)s command appears out of sync with the libraries provided by pkg:/package/pkg. The client version is %(client)s while the library API version is %(api)s
ru: Команда %(cmd)s не синхронизирована с библиотеками, предоставленными в pkg:/package/pkg. Версия клиента – %(client)s, в то время как версия API библиотеки – %(api)s

source: Usage: pkgrepo [options] command [cmd_options] [operands] Subcommands: pkgrepo create [--version] uri_or_path pkgrepo add-signing-ca-cert [-p publisher ...] [-s repo_uri_or_path] path ... pkgrepo add-signing-intermediate-cert [-p publisher ...] [-s repo_uri_or_path] path ... pkgrepo get [-p publisher ...] [-s repo_uri_or_path] [section/property ...] pkgrepo info [-F format] [-H] [-p publisher ...] [-s repo_uri_or_path] pkgrepo rebuild [-s repo_uri_or_path] [--no-catalog] [--no-index] pkgrepo refresh [-s repo_uri_or_path] [--no-catalog] [--no-index] pkgrepo remove-signing-ca-cert [-p publisher ...] [-s repo_uri_or_path] hash ... pkgrepo remove-signing-intermediate-cert [-p publisher ...] [-s repo_uri_or_path] hash ... pkgrepo set [-p publisher ...] [-s repo_uri_or_path] section/property[+|-]=[value] ... or section/property[+|-]=([value]) ... pkgrepo help pkgrepo version Options: --help or -? Displays a usage message.
ru: Использование: pkgrepo [options] command [cmd_options] [operands] Подкоманды: pkgrepo create [--version] uri_or_path pkgrepo add-signing-ca-cert [-p publisher ...] [-s repo_uri_or_path] path ... pkgrepo add-signing-intermediate-cert [-p publisher ...] [-s repo_uri_or_path] path ... pkgrepo get [-p publisher ...] [-s repo_uri_or_path] [section/property ...] pkgrepo info [-F format] [-H] [-p publisher ...] [-s repo_uri_or_path] pkgrepo rebuild [-s repo_uri_or_path] [--no-catalog] [--no-index] pkgrepo refresh [-s repo_uri_or_path] [--no-catalog] [--no-index] pkgrepo remove-signing-ca-cert [-p publisher ...] [-s repo_uri_or_path] hash ... pkgrepo remove-signing-intermediate-cert [-p publisher ...] [-s repo_uri_or_path] hash ... pkgrepo set [-p publisher ...] [-s repo_uri_or_path] section/property[+|-]=[value] ... or section/property[+|-]=([value]) ... pkgrepo help pkgrepo version Параметры: --help or -? Отображает сообщение об использовании.

source: At least one path to a certificate must be provided.
ru: Необходимо предоставить минимум один путь к сертификату.

source: Unable to add signing ca certificates for publisher '%(pfx)s': %(details)s
ru: Невозможно добавить подпись сертификатов CA для издателя '%(pfx)s': %(details)s

source: Unable to add signing intermediate certificates for publisher '%(pfx)s': %(details)s
ru: Невозможно добавить подпись промежуточных сертификатов для издателя '%(pfx)s': %(details)s

source: Unable to add signing intermediate certificates: %(details)s
ru: Невозможно добавить подпись промежуточных сертификатов: %(details)s

source: At least one certificate hash must be provided.
ru: Необходимо предоставить минимум один сертификат.

source: Unable to remove signing ca certificates for publisher '%(pfx)s': %(details)s
ru: Невозможно удалить подпись сертификатов CA для издателя '%(pfx)s': %(details)s

source: Unable to remove signing intermediate certificates for publisher '%(pfx)s': %(details)s
ru: Невозможно удалить подпись промежуточных сертификатов для издателя '%(pfx)s': %(details)s

source: Unable to remove signing intermediate certificates: %(details)s
ru: Невозможно удалить подпись промежуточных сертификатов: %(details)s

source: unknown property section '%s'
ru: неизвестный раздел свойства '%s'

source: '%s' may not be set using this command
ru: невозможно установить '%s' с использованием этой команды

source: unknown property '%s'
ru: неизвестное свойство '%s'

source: Unable to set properties for publisher '%(pfx)s': %(details)s
ru: Невозможно установить свойства для издателя '%(pfx)s': %(details)s

source: The pkgrepo command appears out of sync with the libraries provided by pkg:/package/pkg. The client version is %(client)s while the library API version is %(api)s.
ru: Команда pkgrepo не синхронизирована с библиотеками, предоставленными в pkg:/package/pkg. Версия клиента – %(client)s, а версия API библиотеки – %(api)s.

source: Usage: pkgsend [options] command [cmd_options] [operands] Packager subcommands: pkgsend open [-en] pkg_fmri pkgsend add action arguments pkgsend import [-T pattern] [--target file] bundlefile ... pkgsend include [-d basedir] ... [-T pattern] [manifest] ... pkgsend close [-A | [--no-index] [--no-catalog]] pkgsend publish [-d basedir] ... [-T pattern] [--no-index] [--fmri-in-manifest | pkg_fmri] [--no-catalog] [manifest] ... pkgsend generate [-T pattern] [--target file] bundlefile ... pkgsend refresh-index Options: -s repo_uri target repository URI --help or -? display usage message Environment: PKG_REPO
ru: Использование: pkgsend [options] command [cmd_options] [operands] Подкоманды упаковщика: pkgsend open [-en] pkg_fmri pkgsend add action arguments pkgsend import [-T pattern] [--target file] bundlefile ... pkgsend include [-d basedir] ... [-T pattern] [manifest] ... pkgsend close [-A | [--no-index] [--no-catalog]] pkgsend publish [-d basedir] ... [-T pattern] [--no-index] [--fmri-in-manifest | pkg_fmri] [--no-catalog] [manifest] ... pkgsend generate [-T pattern] [--target file] bundlefile ... pkgsend refresh-index Параметры: -s repo_uri target repository URI --help or -? display usage message Среда: PKG_REPO

source: invalid action for publication: %s
ru: недействительное действие для публикации: %s

source: No fmri argument specified for subcommand
ca: Cap argument frmi especificat per a la sub-comanda
ru: Не указан аргумент fmri для субкоманды

source: File %s line %s: %s
ca: Fitxer %s línia %s: %s
ru: Файл %s строка %s: %s

source: Manifest does not set fmri and
ca: El manifest no té establert l'fmri i
ru: В манифесте не установлено значение fmri и

source: pkgsend: illegal global option -- %s
ca: pkgsend: opció global il·legal -- %s
ru: pkgsend: недопустимый глобальный параметр -- %s

source: illegal %s option -- %s
ca: opció %s il·legal -- %s
ru: недопустимый параметр %s -- %s
