Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: {forv} '{v}' specified multiple times
de: {forv} '{v}' mehrfach angegeben
es: {forv} '{v}' especificada varias veces
fr: {forv} '{v}' indiqué plusieurs fois
ja: {forv} '{v}' が複数回指定されました

source: '{0}' is not a valid mediator; only alphanumeric characters are allowed
de: '{0}' ist kein gültiger Vermittler. Nur alphanumerische Zeichen sind zulässig.
es: '{0}' no es un mediador válido; sólo se permiten caracteres alfanuméricos
fr: '{0}' n'est pas un médiateur valide ; seuls les caractères alphanumériques sont autorisés
ja: '{0}' は有効なメディエータではありません。英数字だけを使用できます。

source: '{value}' is not a valid mediator-version: {error}
de: '{value}' ist keine gültige Vermittlerversion: {error}
es: '{value}' no es un valor válido para el atributo mediator-version: {error}
fr: '{value}' n'est pas une valeur mediator-version valide : {error}
ja: '{value}' は有効な mediator-version ではありません: {error}

source: '{0}' is not a valid mediator-version
de: '{0}' ist keine gültige Vermittlerversion.
es: '{0}' no es un valor válido para el atributo mediator-version
fr: '{0}' n'est pas une valeur mediator-version valide
ja: '{0}' は有効な mediator-version ではありません

source: '{value}' is not a valid mediator-implementation; only alphanumeric characters and a version dot-sequence following a single '@' are allowed: {error}
de: '{value}' ist keine gültige Vermittlerimplementierung; nur alphanumerische Zeichen und eine Punktesequenz-Version mit einem einzigen angeschlossenen '@' sind zulässig: {error}
es: '{value}' no es un valor válido para el atributo mediator-implementation; solo se permiten caracteres alfanuméricos y una secuencia de versiones separadas por puntos después de una sola '@': {error}
fr: '{value}' n'est pas une valeur mediator-implementation valide ; seuls des caractères alphanumériques et une séquence version-point après un caractère '@' unique sont autorisés : {error}
ja: '{value}' は有効な mediator-implementation ではありません。英数字と、単一の '@' に続くバージョンドットシーケンスだけを使用できます: {error}

source: '{0}' is not a valid mediator-implementation; only alphanumeric characters and a version dot-sequence following a single '@' are allowed
de: '{0}' ist keine gültige Vermittlerimplementierung; nur alphanumerische Zeichen und eine Punktesequenz-Version mit einem einzigen angeschlossenen '@' sind zulässig
es: '{0}' no es un valor válido para el atributo mediator-implementation; sólo se permiten caracteres alfanuméricos y una secuencia de versiones separadas por puntos después de una sola '@'
fr: '{0}' n'est pas une valeur mediator-implementation valide ; seuls des caractères alphanumériques et une séquence version-point après un caractère '@' unique sont autorisés
ja: '{0}' は有効な mediator-implementation ではありません。英数字と、単一の '@' に続くバージョンドットシーケンスだけを使用できます

source: '{0}' is not a valid mediator-priority; valid values are 'site' or 'vendor'
de: '{0}' ist keine gültige Vermittlerpriorität. Gültige Werte sind 'site' oder' vendor'.
es: '{0}' no es un valor válido para el atributo mediator-priority; los valores válidos son 'site' o 'vendor'
fr: '{0}' n'est pas une valeur mediator-priority valide ; des valeurs correctes sont 'site' ou 'vendor'
ja: '{0}' は有効な mediator-priority ではありません。有効な値は 'site' または 'vendor' です

source: This is an internal error in pkg(7) version {version}. Please log a Service Request about this issue including the information above and this message.
de: Dies ist ein interner Fehler in pkg(7) Version {version}. Erstellen Sie eine a Serviceanforderung wegen dieses Vorfalls, und geben Sie dazu die oben stehenden Informationen und diese Meldung an.
es: Este es un error interno en pkg(7) versión {version}. Registre una solicitud de servicio sobre este problema e incluya la información anterior y este mensaje.
fr: Il s'agit d'une erreur interne dans pkg(7) version {version}. Consignez une demande d'assistance à propos de ce problème et mentionnez les informations ci-dessus et le présent message.
ja: これは pkg(7) バージョン {version} の内部エラーです。上の情報 とこのメッセージを含め、この問題に関するサービス要求を記録 してください。

source: unable to set open file limit to {0}; please increase the open file limit using 'ulimit -n' and try the requested operation again: {1}
de: Grenzwert für geöffnete Dateien kann nicht auf {0} gesetzt werden. Erhöhen Sie den Grenzwert für geöffnete Dateien mit 'ulimit -n', und wiederholen Sie den angeforderten Vorgang: {1}
es: no se pudo definir el límite de archivos abiertos en {0}; aumente el límite de archivos abiertos mediante 'ulimit -n' y vuelva a intentar la operación solicitada: {1}
fr: impossible de régler le nombre limite de fichiers ouverts à {0}; augmentez cette limite en utilisant 'ulimit -n' puis réessayez l'opération : {1}
ja: オープンファイル制限を {0} に設定できません。'ulimit -n' を使用してオープンファイル制限を増やし、要求された操作を再試行してください: {1}

source: Missing -> in transform
de: -> fehlt in Umwandlung
es: Faltante -> en transformación
fr: -> manquant dans transform
ja: 欠落 -> 変換中

source: transform ({transform}) has regexp error ({err}) in matching clause
de: Umwandlung ({transform}) verursacht regexp-Fehler ({err}) in entsprechender Klausel
es: la transformación ({transform}) tiene el error regexp ({err}) en la cláusula coincidente
fr: transform ({transform}) contient une erreur regexp ({err}) dans la clause correspondante
ja: 変換 ({transform}) は一致する節に regexp エラー ({err}) があります

source: transform ({0}) has 'drop' operation syntax error
de: Umwandlung ({0}) verursacht Syntaxfehler in 'drop'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'drop'
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'drop'
ja: 変換 ({0}) には 'drop' 操作の構文エラーがあります

source: transform ({0}) has 'set' operation syntax error
de: Umwandlung ({0}) verursacht Syntaxfehler in 'set'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'set'
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'set'
ja: 変換 ({0}) には 'set' 操作の構文エラーがあります

source: transform ({0}) has 'default' operation syntax error
de: Umwandlung ({0}) verursacht Syntaxfehler in 'default'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'default'
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'default'
ja: 変換 ({0}) には 'default' 操作の構文エラーがあります

source: transform ({0}) has 'abort' operation syntax error
de: Umwandlung ({0}) verursacht Syntaxfehler in 'abort'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'abort'
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'abort'
ja: 変換 ({0}) には 'abort' 操作の構文エラーがあります

source: transform ({0}) has 'exit' operation syntax error: illegal exit value
de: Umwandlung ({0}) verursacht Syntaxfehler in 'exit'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'exit': valor de salida no válido
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'exit' : valeur de sortie illégale
ja: 変換 ({0}) には 'exit' 操作の構文エラーがあります: 不正な exit 値

source: transform ({0}) has 'add' operation syntax error
de: Umwandlung ({0}) verursacht Syntaxfehler in 'add'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'add'
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'add'
ja: 変換 ({0}) には 'add' 操作の構文エラーがあります

source: transform ({0}) has 'edit' operation syntax error
de: Umwandlung ({0}) verursacht Syntaxfehler in 'edit'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'edit'
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'edit'
ja: 変換 ({0}) には 'edit' 操作の構文エラーがあります

source: transform ({transform}) has 'edit' operation with malformed regexp ({err})
de: Umwandlung ({transform}) enthält 'edit'-Vorgang mit regexp in falschem Format ({err})
es: la transformación ({transform}) tiene la operación 'edit' con regexp incorrecto ({err})
fr: transform ({transform}) inclut une opération 'edit' contenant une expression régulière mal formée ({err})
ja: 変換 ({transform}) には不正な形式の正規表現 ({err}) を含む 'edit' 操作があります

source: transform ({transform}) has edit operation with replacement string regexp error {err}
de: Umwandlung ({transform}) enthält 'edit'-Vorgang mit regexp-Fehler in Ersetzungszeichenfolge {err}
es: la transformación ({transform}) tiene una operación de edición con el error de la cadena de sustitución regexp {err}
fr: transform ({transform}) inclut une opération 'edit' contenant une erreur d'expression régulière dans la chaîne de remplacement {err}
ja: 変換 ({transform}) には置換文字列の正規表現エラー {err} を含む編集操作があります

source: transform ({0}) has 'delete' operation syntax error
de: Umwandlung ({0}) verursacht Syntaxfehler in 'delete'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'delete'
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'delete'
ja: 変換 ({0}) には 'delete' 操作の構文エラーがあります

source: transform ({transform}) has 'delete' operationwith malformed regexp ({err})
de: Umwandlung ({transform}) enthält 'delete'-Vorgang mit regexp in falschem Format ({err})
es: la transformación ({transform}) tiene una operación 'delete' con regexp incorrecto ({err})
fr: transform ({transform}) inclut une opération 'delete' contenant une expression régulière mal formée ({err})
ja: 変換 ({transform}) には不正な形式の正規表現 ({err}) を含む 'delete' 操作があります

source: transform ({transform}) has delete operation with replacement string regexp error {err}
de: Umwandlung ({transform}) enthält 'delete'-Vorgang mit regexp-Fehler in Ersetzungszeichenfolge {err}
es: la transformación ({transform}) tiene una operación de supresión con el error de la cadena de sustitución regexp {err}
fr: transform ({transform}) inclut une opération 'delete' contenant une erreur d'expression régulière dans la chaîne de remplacement {err}
ja: 変換 ({transform}) には置換文字列の正規表現エラー {err} を含む削除操作があります

source: transform ({0}) has 'print' operation syntax error
de: Umwandlung ({0}) verursacht Syntaxfehler in 'print'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'print'
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'print'
ja: 変換 ({0}) には 'print' 操作の構文エラーがあります

source: transform ({0}) has 'emit' operation syntax error
de: Umwandlung ({0}) verursacht Syntaxfehler in 'emit'-Vorgang
es: la transformación ({0}) tiene el error de sintaxis de operación 'emit'
fr: transform ({0}) contient une erreur de syntaxe dans l'opération 'emit'
ja: 変換 ({0}) には 'emit' 操作の構文エラーがあります

source: unknown transform operation '{0}'
de: Unbekannter Umwandlungsvorgang '{0}'
es: operación de transformación desconocida '{0}'
fr: opération de transformation inconnue '{0}'
ja: 不明な変換操作 '{0}'

source: attribute '{0}' not found
de: Attribut '{0}' nicht gefunden
es: no se encontró el atributo '{0}'
fr: attribut '{0}' introuvable
ja: 属性 '{0}' が見つかりません

source: no match group {group:d} (max {maxgroups:d})
de: Keine entsprechende Gruppe {group:d} (max {maxgroups:d})
es: ningún grupo de coincidencias {group:d} (máx. {maxgroups:d})
fr: aucun groupe correspondant {group:d} (max {maxgroups:d})
ja: グループ {group:d} は一致しません (最大 {maxgroups:d})

source: Error Invalid backreference: %<{ref}> refers to an unmatched string
de: Fehler Ungültiger Rückverweis: %<{ref}> referenziert eine nicht übereinstimmende Zeichenfolge
es: Error Referencia hacia atrás no válida: %<{ref}> hace referencia a una cadena no coincidente
fr: Erreur Référence arrière non valide : %<{ref}> fait référence à une chaîne sans correspondance
ja: エラー 無効な後方参照: %<{ref}> は一致していない文字列を参照しています

source: Cannot open file: {0}
de: Datei kann nicht geöffnet werden: {0}
es: No se puede abrir el archivo: {0}
fr: Impossible d'ouvrir le fichier : {0}
ja: ファイルを開くことができません: {0}

source: File not found: '{0}'
de: Datei nicht gefunden: '{0}'
es: No se encontró el archivo: '{0}'
fr: Fichier introuvable : '{0}'
ja: ファイルが見つかりません: '{0}'

source: unknown command {0}
de: Unbekannter Befehl {0}
es: comando desconocido {0}
fr: commande inconnue {0}
ja: 不明なコマンド {0}

source: File {file}, line {line:d}: {exception}
de: Datei: {file}, Zeile {line:d}: {exception}
es: Archivo {file}, línea {line:d}: {exception}
fr: Fichier {file}, ligne {line:d} : {exception}
ja: ファイル {file}、行 {line:d}: {exception}

source: Error processing input arguments: {0}
de: Fehler beim Verarbeiten von Eingabeargumenten: {0}
es: Error al procesar argumentos de entrada: {0}
fr: Erreur lors du traitement des arguments d'entrée : {0}
ja: 入力引数の処理中にエラーが発生しました: {0}

source: missing version
ca: falta versió
de: Fehlende Version
es: versión que falta
fr: version manquante
ja: 不足しているバージョン
ru: отсутствующая версия

source: invalid version
ca: versió no permesa
de: Ungültige Version
es: versión no válida
fr: version incorrecte
ja: 無効なバージョン
ru: недопустимая версия

source: {0} is not in a supported or recognizable archive index format.
de: {0} ist kein unterstütztes oder erkennbares Indexformat zur Archivierung.
es: {0} no es un formato de índice de contenedor admitido ni reconocible.
fr: {0} n'est pas un format d'index d'archive pris en charge ni reconnu.
ja: {0} はサポートされていないか、認識できないアーカイブインデックス形式です。

source: Archive {0} is missing, unsupported, or corrupt.
de: Archiv {0} fehlt, wird nicht unterstützt oder ist beschädigt.
es: Falta el contenedor {0}, no se admite o está dañado.
fr: L'archive {0} est manquante, non prise en charge ou endommagée.
ja: アーカイブ {0} は存在しないか、サポートされていないか、壊れています。

source: Package archive {arc_name} contains corrupt entries for the requested package file(s): {files}.
de: Packagearchiv {arc_name} enthält beschädigte Einträge für die angeforderten Packagedateien: {files}.
es: El archivo de paquetes {arc_name} contiene entradas dañadas para los archivos de paquete solicitados: {files}.
fr: L'archive de package {arc_name} contient des entrées endommagées pour le(s) fichier(s) de package demandé(s) : {files}.
ja: パッケージアーカイブ {arc_name} には、要求されたパッケージファイルの壊れたエントリが含まれています: {files}。

source: Package archive {arc_name} does not contain the requested package file(s): {files}.
de: Packagearchiv {arc_name} enthält die angeforderten Packagedateien nicht: {files}.
es: El archivo de paquetes {arc_name} no contiene los archivos de paquete solicitados: {files}.
fr: L'archive de package {arc_name} ne contient pas le(s) fichier(s) de package demandé(s) : {files}.
ja: パッケージアーカイブ {arc_name} には、要求されたパッケージファイルが含まれていません: {files}。

source: No package manifest for package '{pfmri}' exists in archive {arc_name}.
de: Es ist kein Packagemanifest für Package '{pfmri}' in Archiv {arc_name} vorhanden.
es: No existe un manifiesto para el paquete '{pfmri}' en el archivo {arc_name}.
fr: Aucun package de manifeste pour le package '{pfmri}' n'existe dans l'archive {arc_name}.
ja: パッケージ '{pfmri}' のパッケージマニフェストがアーカイブ {arc_name} に存在しません。

source: WARNING: package {0} was ignored as it cannot satisfy all dependencies: {1}
de: WARNING: Package {0} wurde ignoriert, weil es nicht alle Abhängigkeiten erfüllen kann: {1}
es: ADVERTENCIA: El paquete {0} se omitió porque no puede satisfacer todas las dependencias: {1}
fr: AVERTISSEMENT : le package {0} a été ignoré car toutes les dépendances ne peuvent pas être satisfaites : {1}
ja: 警告: すべての依存関係を満たすことができなかったため、パッケージ {0} は無視されました: {1}

source: {pth} has unresolved dependency '{dep}' under the following combinations of variants: {combo}
de: {pth} enthält nicht aufgelöste Abhängigkeit '{dep}' unter den folgenden Variantenkombinationen: {combo}
es: {pth} tiene dependencias sin resolver '{dep}' en las siguientes combinaciones de variantes: {combo}
fr: {pth} entretient une dépendance non résolue avec '{dep} sous les combinaisons de variantes suivantes : {combo}
ja: {pth} には次のバリアントの組み合わせで、未解決の依存関係 '{dep}' があります: {combo}

source: {pth} has unresolved dependency '{dep}'.
de: {pth} enthält nicht aufgelöste Abhängigkeit '{dep}'.
es: {pth} tiene dependencias sin resolver '{dep}'.
fr: {pth} entretient une dépendance non résolue avec '{dep}'.
ja: {pth} には未解決の依存関係 '{dep}' があります。

source: The action delivering {path} is tagged with a variant type or value not tagged on the package. Dependencies on this file may fail to be reported. The action's variants are: {act} The package's variants are: {pkg}
de: Die Aktion, die {path} bereitstellt, ist durch einen Variantentyp oder Wert markiert, der kein Package kennzeichnet. Abhängigkeiten von dieser Datei können möglicherweise nicht gemeldet werden. Die Varianten der Aktion sind: {act} Die Varianten des Packages sind: {pkg}
es: La acción que entrega {path} está etiquetada con un tipo o un valor de variante no etiquetado en el paquete. Es posible que no se puedan informar las dependencias de este archivo. Las variantes de la acción son: {act} Las variantes del paquete son: {pkg}
fr: La distribution de l'action {path} est marquée par un type de variante ou par une valeur non marquée dans le package. Les dépendances de ce fichier peuvent ne pas être signalées. Les variantes de l'action sont les suivantes : {act} Les variantes du package sont : {pkg}
ja: {path} をもたらすアクションは、パッケージでタグ付けされていないバリアントタイプまたは値でタグ付けされています。このファイルの依存関係は報告されない 可能性があります。 アクションのバリアント: {act} パッケージのバリアント: {pkg}

source: The manifest '{path}' has an invalid package FMRI: {exc}
de: Das Manifest '{path}' enthält ein ungültiges Package FMRI: {exc}
es: El manifiesto '{path}' tiene un FMRI de paquete no válido: {exc}
fr: Le fichier manifeste '{path}' contient un FMRI de package erroné : {exc}
ja: マニフェスト '{path}' には無効なパッケージ FMRI があります: {exc}

source: {r:15} Variant '{kind}' is not declared.
de: {r:15} Variante '{kind}' ist nicht deklariert.
es: {r:15} Variante '{kind}' no declarada.
fr: {r:15} La variante '{kind}' n'est pas déclarée.
ja: {r:15} バリアント '{kind}' は宣言されていません。

source: {r:15} Variant '{kind}' is not declared to have value '{val}'.
de: {r:15} Für Variante '{kind}' ist der Wert '{val}' nicht deklariert.
es: {r:15} Variante '{kind}' no declarada con el valor '{val}'.
fr: {r:15} La variante '{kind}' n'est pas déclarée comme ayant la valeur '{val}'.
ja: {r:15} バリアント '{kind}' は値 '{val}' を持つように宣言されていません。

source: The package '{pkg}' contains actions with the paths seen below which have variants set on them which are not set on the package. These variants must be set on the package or removed from the actions. {rvs}
de: Das Package '{pkg} enthält Aktionen für die nachstehenden Pfade, für die Varianten festgelegt sind, die ihrerseits nicht für das Package festgelegt sind. Diese Varianten müssen für das Package festgelegt oder aus den Aktionen entfernt werden. {rvs}
es: El paquete '{pkg}' contiene acciones con las rutas que se muestran a continuación, que tienen variantes establecidas que no están establecidas en el paquete. Estas variantes se deben establecer en el paquete o se deben eliminar de las acciones. {rvs}
fr: Le package '{pkg}' contient des actions dont les chemins sont indiqués ci-dessous et sur lesquelles sont définies des variantes qui ne sont pas définies sur le package. Ces variantes doivent être définies sur le package ou supprimées des actions. {rvs}
ja: パッケージ '{pkg}' では、パッケージには設定されていない バリアントが設定されたアクションが次のパスに含まれています。 これらのバリアントをパッケージに設定するか、アクションから削除する必要があります。 {rvs}

source: The package '{pkg}' contains manually specified dependencies which have variants set on them which are not set on the package. These variants must be set on the package or removed from the actions. {rvs}
de: Das Package {pkg}' enthält manuell angegebene Abhängigkeiten, für die Varianten festgelegt sind, die ihrerseits nicht für das Package festgelegt sind. Diese Varianten müssen für das Package festgelegt oder aus den Aktionen entfernt werden. {rvs}
es: El paquete '{pkg}' contiene dependencias especificadas manualmente que tienen variantes establecidas que no están establecidas en el paquete. Estas variantes se deben establecer en el paquete o se deben eliminar de las acciones. {rvs}
fr: Le package '{pkg}' contient des dépendances spécifiées manuellement et sur lesquelles sont définies des variantes qui ne sont pas définies sur le package. Ces variantes doivent être définies sur le package ou supprimées des actions {rvs}
ja: パッケージ '{pkg}' では、パッケージには設定されていない バリアントが設定された、手動で指定された依存関係が含まれています。 これらのバリアントをパッケージに設定するか、アクションから削除する必要があります。 {rvs}

source: pkgdepend has inferred conditional dependencies with different targets but which share a predicate. pkg(7) can not represent these dependencies. This issue can be resolved by changing the packaging of the links which generated the conditional dependencies so that they have different predicates or share the same FMRI. Each pair of problematic conditional dependencies follows:
de: pkgdepend hat bedingte Abhängigkeiten in unterschiedlichen Zielen festgestellt, die sich aber ein Prädikat teilen. pkg(7) kann diese Abhängigkeiten nicht darstellen. Dieses Problem kann gelöst werden, indem das Packaging der Verknüpfungen geändert wird, das die bedingten Abhängigkeiten generiert hat, sodass diese unterschiedliche Prädikate haben oder sich dieselbe FMRI teilen. Jedes Paar problematischer bedingter Abhängigkeiten folgt:
es: pkgdepend ha detectado dependencias condicionales de destinos diferentes, pero que comparten un predicado. pkg(7) no puede representar estas dependencias. Este problema se puede resolver cambiando el paquete de los enlaces que generaron las dependencias condicionales para que tengan distintos predicados o compartan el mismo FMRI. A continuación, se presenta cada par de dependencias condicionales problemáticas:
fr: pkgdepend a déduit des dépendances conditionnelles avec des cibles différentes mais partageant un même prédicat. pkg(7) ne peut pas représenter ces dépendances. Ce problème peut être résolu en modifiant l'empaquetage des liens ayant généré les dépendances conditionnelles de manière à ce qu'elles aient des prédicats différents ou qu'elles partagent le même FMRI. Les paires de dépendances conditionnelles posant problème sont énumérées ci-dessous :
ja: pkgdepend によって、述語を共有する異なるターゲットとの条件付き依存関係 が推測されました。pkg(7) はこれらの依存関係を表現できません。この 問題を解決するには、条件付き依存関係を生成したリンクのパッケージ化の方法を変更することで 、それらが異なる述語を持つようにするか 同じ FMRI を共有するようにします。問題のある条件付き依存関係の各ペアを次に示します:

source: Pair {0}
de: Paar {0}
es: Par {0}
fr: Paire {0}
ja: ペア {0}

source: Pair {0} is only problematic in the listed variant combinations:
de: Pärchen {0} ist nur problematisch in den aufgelisteten Variantenkombinationen:
es: El par {0} sólo es problemático en las combinaciones de variantes mencionadas:
fr: La paire {0} pose uniquement problème dans les combinaisons de variantes énumérées :
ja: ペア {0} で問題が発生するのは、一覧表示したバリアントの組み合わせの場合だけです:

source: Manifest specified multiple values for {0} rather than a single colon-separated string.
de: Manifest gab mehrere Werte für {0} an anstelle einer durch Doppelpunkt getrennten Zeichenfolge.
es: El manifiesto especificó varios valores para {0} en lugar de una única cadena separada por dos puntos.
fr: Le manifeste a spécifié des valeurs multiples pour {0} plutôt qu'unechaîne simple séparée par des points-virgules.
ja: マニフェストでコロンで区切られた単一の文字列ではなく複数の値が {0} に指定されました。

source: Manifest did not specify any entries for {0}, expecting a colon-separated string.
de: Manifest gab keine Einträge für {0} an, und erwartete eine durch Doppelpunkt getrennte Zeichenfolge.
es: El manifiesto no especificó ninguna entrada para {0}; se esperaba una cadena separada por dos puntos.
fr: Le manifeste n'a spécifié aucune entrée pour {0}, en attente d'une chaîne séparée par des points-virgules.
ja: マニフェストに (コロンで区切られた文字列が予期される) {0} のエントリが指定されていません。

source: Unsupported scheme '{scheme}' in URL: '{url}'.
de: Nicht unterstütztes Schema '{scheme}' in URL: '{url}'.
es: Esquema no admitido '{scheme}' en la URL: '{url}'.
fr: Plan '{scheme}' non pris en charge dans l'URL : '{url}'.
ja: URL '{url}' のスキーム '{scheme}' はサポートされていません。

source: Malformed URL: '{0}'.
de: Fehlerhafte URL: '{0}'.
es: URL incorrecta: '{0}'.
fr: URL erronée : '{0}'.
ja: 不正な形式の URL: '{0}'。
