Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Usage: pkgsend [options] command [cmd_options] [operands] Packager subcommands: pkgsend create-repository --set-property <section.property>=<value> pkgsend open [-en] pkg_fmri pkgsend add action arguments pkgsend import [-T file_pattern] bundlefile ... pkgsend include [-d basedir] .. [manifest] ... pkgsend close [-A | [--no-index] [--no-catalog]] pkgsend publish [ -d basedir] ... [--no-index] [--fmri-in-manifest | pkg_fmri] [--no-catalog] [manifest] ... pkgsend generate [-T file_pattern] bundlefile .... pkgsend refresh-index Options: -s repo_uri target repository URI --help or -? display usage message Environment: PKG_REPO
ca: Ús: pkgsend [opcions] comanda [opcions_cmd] [operands] Subcomandes empaquetador: pkgsend create-repository --set-property <secció.propietat>=<valor> pkgsend open [-en] pkg_fmri pkgsend add acció arguments pkgsend import [-T patró_fitxer] bundlefile ... pkgsend include [-d dirbase] .. [manifest] ... pkgsend close [-A | [--no-index] [--no-catalog]] pkgsend publish [ -d dirbase] ... [--no-index] [--fmri-in-manifest | frmi_pkg] [--no-catalog] [manifest] ... pkgsend generate [-T patró_fitxer] bundlefile .... pkgsend refresh-index Opcions: -s repo_uri URI repositori objectiu --help or -? mosta el missatge d'ús Entorn: PKG_REPO

source: Usage: pkgrecv [-s src_repo_uri] [-d (path|dest_uri)] [-k] [-m] [-n] [-r] (fmri|pattern) ... pkgrecv [-s src_repo_uri] -n Options: -d path_or_uri The path of a directory to save the retrieved package to, or the URI of a repository to republish it to. If not provided, the default value is the current working directory. If a directory path is provided, then package content will only be retrieved if it does not already exist in the target directory. If a repository URI is provided, a temporary directory will be created and all of the package data retrieved before attempting to republish it. -h Display this usage message. -k Keep the retrieved package content compressed, ignored when republishing. Should not be used with pkgsend. -m match Controls matching behaviour using the following values: all-timestamps includes all matching timestamps, not just latest (implies all-versions) all-versions includes all matching versions, not just latest -n List the most recent versions of the packages available from the specified repository and exit (all other options except -s will be ignored). -r Recursively evaluates all dependencies for the provided list of packages and adds them to the list. -s src_repo_uri A URI representing the location of a pkg(5) repository to retrieve package data from. Environment: PKG_DEST Destination directory or repository URI PKG_SRC Source repository URI
ca: Usage: pkgrecv [-s src_repo_uri] [-d (path|dest_uri)] [-k] [-m] [-n] [-r] (fmri|pattern) ... pkgrecv [-s src_repo_uri] -n Options: -d path_or_uri The path of a directory to save the retrieved package to, or the URI of a repository to republish it to. If not provided, the default value is the current working directory. If a directory path is provided, then package content will only be retrieved if it does not already exist in the target directory. If a repository URI is provided, a temporary directory will be created and all of the package data retrieved before attempting to republish it. -h Display this usage message. -k Keep the retrieved package content compressed, ignored when republishing. Should not be used with pkgsend. -m match Controls matching behaviour using the following values: all-timestamps includes all matching timestamps, not just latest (implies all-versions) all-versions includes all matching versions, not just latest -n List the most recent versions of the packages available from the specified repository and exit (all other options except -s will be ignored). -r Recursively evaluates all dependencies for the provided list of packages and adds them to the list. -s src_repo_uri A URI representing the location of a pkg(5) repository to retrieve package data from. Environment: PKG_DEST Directori destí o URI repositori PKG_SRC URI repositori font

source: Unable to load manifest '%(mpath)s' for package '%(pfmri)s'.
ca: No es pot carregar el manifest'%(mpath)s' pel paquet '%(pfmri)s'

source: Unable to write manifest '%(mpath)s' for package '%(pfmri)s'.
ca: No es pot escriure el manifest '%(mpath)s' pel paquet '%(pfmri)s'.

source: Unable to retrieve manifest %s from %s: %s
ca: No es pot recuperar el manifest %s de %s: %s

source: Error occurred while reading from: %s
ca: S'ha produït un error mentre s'estava llegint de: %s

source: Unable to retrieve content from: %s
ca: No es pot recuperar el contingut de %s

source: Unable to extract file: %s
ca: No es pot extraure el fitxer: %s

source: Unable to download catalog from: %s
ca: No es pot descarregar el catàleg de: %s

source: Error: %s while reading from: %s
ca: Error: %s mentre es llegia des de: %s

source: Refreshing repository search indices ...
ca: Refrescant els índexs de cerca de repositori ...

source: <b>Evaluate</b>
ca: <b>Avaluar</b>

source: <b>Updates are available for the following packages</b>
ca: <b>Hi han actualitzacions disponibles pels següents paquets</b>

source: <b>_Details</b>
ca: <b>_Detalls</b>

source: Close dialog when _finished
ca: Tancar el diàleg quant _finalitzi

source: Index
ca: Índex

source: Install Update
ca: Instal·lar actualització

source: Select the packages you want to update and click Install.
ca: Seleccioneu els paquets que voleu actualitzar i cliqueu a Instal·lar.

source: _Cancel
ca: _Cancel·lar

source: _Install Updates
ca: _Instal·lar actualització

source: _OK
ca: _Acceptar

source: _Select all Updates
ca: _Seleccionar totes les actualitzacions

source: _Update All
ca: _Actualitzar tot

source: GUI will not respond to any event! %s. Check updatemanager.py signals
ca: La interfície gràfica d'usuari no està responent a cap event! %s. Comproveu les senyals de updatemanager.py

source: Click Update All to create a new boot environment and install all packages into it.
ca: Cliqueu a Actualitzar tot per a crear un nou entorn, i a dintre d'ell, instal·lar totes les actualitzacions.

source: Current Version
ca: Versió actual

source: Size (Meg)
ca: Mida (Meg)

source: count: %d
ca: comptador: %d

source: <b>You do not have sufficient permissions</b>
ca: <b>No teniu permisos suficients</b>

source: Please restart pm-updatemanager using pfexec.
ca: Reinicieu pm-updatemanager utilitzant pfexec.

source: <b>No Updates available</b>
ca: <b>No hi han actualitzacions disponibles</b>

source: Fetching details for %s ...
ca: Obtenint detalls per %s ...

source: No details available
ca: Sense detalls disponibles

source: Not enough disc space, the Update All action cannot be performed. Click OK to manage your existing BEs and free up disk space or Cancel to cancel Update All.
ca: No hi ha prou espai de disc disponible, l'acció d'Actualitzar tot no pot ser realitzada. Cliqueu a Acceptar per a gestionar els vostres entorns d'arranc i allibereu espai de disc o Cancel·lar per cancel·lar Actualitzar tot.

source: Not Enough Disc Space
ca: No hi ha prou espai al disc

source: Checking for new software
ca: Comprovant per a nou programari

source: Updates are available
ca: Hi han actualitzacions disponibles

source: Updates available Please click on icon to update.
ca: Actualitzacions disponibles Si us plau cliqueu a l'icona per a actualitzar.
