Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: -i and -o options may not be used at the same time.
de: Optionen -i und -o dürfen nicht gleichzeitig verwendet werden.
es: Las opciones -i y -o no se pueden utilizar al mismo tiempo.
fr: les options -i et -o ne peuvent pas être utilisées simultanément.
ja: -i オプションと -o オプションは同時に使用できません。

source: For any variant, only one value may be specified.
de: Für jede Variante kann nur ein Wert festgelegt werden.
es: Para cualquier variante, se puede especificar un solo valor.
fr: Pour toute variante, une seule valeur doit être spécifiée.
ja: バリアントの場合、指定できる値は 1 つだけです。

source: unknown action types: {0}
de: Unbekannte Aktionstypen: {0}
es: tipos de acción desconocidos: {0}
fr: Types d'actions inconnus : {0}
ja: 不明なアクションタイプ: {0}

source: Action error in file {p}: {e}
de: Aktionsfehler in Datei {p}: {e}
es: Error de acción en el archivo {p}: {e}
fr: Erreur d'action dans le fichier {p} : {e}
ja: ファイル {p} でアクションエラーが発生しました: {e}

source: Manifest {path} doesn't support variant {vname}={filt}
de: Manifest {path} unterstützt Variante {vname}={filt} nicht
es: El manifiesto {path} no admite la variante {vname}={filt}
fr: Le manifeste {path} ne prend pas en charge la variante {vname}={filt}
ja: マニフェスト {path} はバリアント {vname}={filt} をサポートしません

source: Manifests support different variants {v1} {v2}
de: Manifest unterstützt andere Varianten {v1} {v2}
es: Los manifiestos admiten diferentes variantes {v1} {v2}
fr: Les manifestes prennent en charge plusieurs variantes {v1} {v2}
ja: マニフェストは別のバリアント {v1} {v2} をサポートしています

source: Usage: pkgfmt [-cdu] [file1] ...
de: Syntax: pkgfmt [-cdu] [file1] ...
es: Sintaxis: pkgfmt [-cdu] [file1] ...
fr: Utilisation : pkgfmt [-cdu] [file1] ...
ja: 使用方法: pkgfmt [-cdu] [file1] ...

source: only one of [cdu] may be specified
de: Es darf nur ein [cdu] angegeben werden
es: se puede especificar una sola instancia de [cdu]
fr: un seul [cdu] peut être spécifié
ja: 指定できるのは [cdu] のいずれかだけです

source: unsupported format '{0}'
de: Nicht unterstütztes Format '{0}'
es: formato no admitido '{0}'
fr: format non pris en charge '{0}'
ja: 形式 '{0}' はサポートされていません

source: manifest is not in pkgfmt form
de: Manifest ist nicht im pkgfmt-Format
es: el manifiesto no está en formato pkgfmt
fr: le manifeste n'est pas au format pkgfmt
ja: マニフェストは pkgfmt 形式ではありません

source: {0} is not in pkgfmt form; run pkgfmt on file without -c or -d to reformat manifest in place
de: {0}: ist nicht im pkgfmt-Format. Führen Sie pkgfmt für die Datei ohne Option -c oder -d aus, um das vorhandene Manifest neu zu formatieren.
es: {0} no está en formato pkgfmt; ejecute pkgfmt en el archivo sin -c o -d para dar nuevo formato al manifiesto establecido
fr: {0} n'est pas au format pkgfmt ; exécutez pkgfmt sur le fichier sans -c ou -d pour reformater le manifeste en place
ja: {0} は pkgfmt 形式ではありません。-c または -d オプションを指定せずに pkgfmt をファイルに対して実行して、対象のマニフェストを再フォーマットします

source: Error: {0}
de: Fehler: {0}
fr: Erreur : {0}
ja: エラー: {0}

source: build to use from lint and reference repositories
de: Zu verwendender Build aus den Lint- und Referenz-Repositorys
es: compilación que utilizar de los repositorios de lint y de referencia
fr: version à utiliser à partir des référentiels Lint et de référence
ja: lint リポジトリおよび参照リポジトリから使用するビルド
ru: сборка для использования в хранилищах lint и ссылочных хранилищах

source: directory to use as a repository cache
de: Als Repository-Cache zu verwendendes Verzeichnis
es: directorio que usar como memoria caché de repositorio
fr: répertoire à utiliser en tant que cache de référentiel
ja: リポジトリキャッシュとして使用するディレクトリ
ru: каталог для использования в качестве кэша хранилища

source: specify an alternative pkglintrc file
de: Alternative pkglintrc-Datei angeben
es: especifique un archivo pkglintrc alternativo
fr: spécifiez un autre fichier pkglintrc
ja: 別の pkglintrc ファイルを指定します
ru: указание альтернативного файла pkglintrc

source: lint repository URI
de: URI für Lint-Repository
es: URI de repositorio de lint
fr: URI de référentiel Lint
ja: lint リポジトリ URI
ru: идентификатор URI хранилища lint

source: list checks configured for this session and exit
de: Für diese Sitzung konfigurierte Überprüfungen auflisten und beenden
es: lista de comprobaciones configuradas para esta sesión y salir
fr: répertoriez les vérifications configurées pour cette session puis fermez la session
ja: このセッションに構成されているチェックを一覧表示し、終了します
ru: вывод списка проверок, настроенных для данного сеанса, и выход

source: pattern to match FMRIs in lint URI
de: Muster zum Abgleichen von FMRIs in Lint-URI
es: patrón que debe coincidir con los FMRI en el URI de lint
fr: forme correspondant aux FMRI dans l'URI Lint
ja: lint URI の FMRI と照合するパターン
ru: шаблон для сопоставления FMRI и URI lint

source: reference repository URI
de: URI für Referenz-Repository
es: URI del repositorio de referencia
fr: URI du référentiel de référence
ja: 参照リポジトリ URI
ru: URI ссылочного хранилища

source: produce verbose output, overriding settings in pkglintrc
de: Verbose-Ausgabe erzeugen, Einstellungen in pkglintrc werden überschrieben
es: genera un resultado detallado, ignorando la configuración de pkglintrc
fr: produit un résultat détaillé remplaçant les paramètres de pkglintrc
ja: pkglintrc の設定を上書きして、詳細情報を出力します
ru: вывод verbose с переопределением параметров настройки в pkglintrc

source: Required -c option missing, no local manifests provided.
de: Erforderliche Option -c fehlt, keine lokalen Manifeste angegeben.
es: Falta la opción necesaria -c, no se ha proporcionado ningún manifiesto local.
fr: L'option -c requise est manquante ; aucun manifeste local n'est fourni.
ja: 必須の -c オプションがなく、ローカルマニフェストが指定されていません。
ru: Необходимый параметр -c отсутствует, локальные манифесты не предоставлены.

source: Lint engine setup...
de: Lint-Engine-Einrichtung ...
es: Configuración del motor lint...
fr: Configuration du moteur Lint...
ja: Lint エンジンのセットアップ...
ru: Установка механизма lint...

source: Required -c option missing when using repositories.
de: Erforderliche Option -c fehlt bei der Verwendung von Repositorys.
es: Opción -c requerida ausente al usar los repositorios.
fr: L'option -c requise est manquante lors de l'utilisation des référentiels.
ja: リポジトリを使用するときに必須の -c オプションがありません。
ru: Необходимый параметр -c отсутствует при использовании хранилищ.

source: Fatal error in manifest - exiting.
de: Schwerwiegender Fehler in Manifest - Ausführung wird beendet.
es: Error grave en el manifiesto - exiting.
fr: Une erreur fatale s'est produite dans le manifeste ; l'opération va se terminer.
ja: マニフェストの致命的エラーです - 終了しています。
ru: Фатальная ошибка в манифесте - выход.

source: Starting lint run...
de: Lint-Ausführung wird gestartet ...
es: Iniciando la ejecución de lint...
fr: Lancement de l'exécution de Lint...
ja: lint の実行を開始しています...
ru: Запуск прогона lint...

source: METHOD
fr: METHODE
ja: メソッド

source: Excluded checks:
de: Ausgeschlossene Überprüfungen:
es: Comprobaciones excluidas:
fr: Vérifications exclues :
ja: 除外されているチェック:
ru: Исключенные проверки:

source: Invalid file {file}: manifest not encoded in UTF-8: {err}
de: Ungültige Datei {file}: Manifest nicht mittels UTF-8 codiert: {err}
es: Archivo no válido {file}: el manifiesto no está codificado en UTF-8: {err}
fr: Fichier non valide {file} : le manifeste n'est pas codé en UTF-8 : {err}
ja: 無効なファイル {file}: マニフェストが UTF-8 でエンコードされていません: {err}

source: Unable to read manifest file {file}: {err}
de: Manifestdatei {file} kann nicht gelesen werden: {err}
es: No se puede leer el archivo de manifiesto {file}: {err}
fr: Impossible de lire le fichier manifeste {file} : {err}
ja: マニフェストファイル {file} を読み取ることができません: {err}

source: Error in {file} line: {ln}: {err}
de: Fehler in {file} Zeile: {ln}: {err}
es: Error en la línea {file}: {ln}: {err}
fr: Erreur à la ligne {file} : {ln} : {err}
ja: {file} の行 {ln} でエラーが発生しました: {err}

source: Error in file {file}: {err}
de: Fehler in Datei {file}: {err}
es: Error en el archivo {file}: {err}
fr: Erreur dans le fichier {file} : {err}
ja: ファイル {file} でエラーが発生しました: {err}

source: Error in file {0}: pkg.fmri does not include a version string
de: Fehler in Datei {0}: pkg.fmri enthält keine Versionszeichenfolge
es: Se produjo un error en el archivo {0}: pkg.fmri no incluye una cadena de versión
fr: Erreur dans le fichier {0} : pkg.fmri ne contient pas de chaîne de version
ja: ファイル {0} のエラー: pkg.fmri にはバージョン文字列が含まれていません

source: Manifest {0} does not declare fmri.
de: Manifest {0} enthält keine FMRI-Deklaration.
es: El manifiesto {0} no declara ningún fmri.
fr: Le manifeste {0} ne déclare pas le fmri.
ja: マニフェスト {0} は FMRI を宣言していません。

source: Usage: pkgmerge [-n] -d dest_repo -s variant=value[,...],src_repo ... [-p publisher_prefix ... ] [pkg_fmri_pattern ...] Options: -d dest_repo The filesystem path or URI of the target repository to publish the merged packages to. The target repository must already exist; new repositories can be created using pkgrepo(1). -n Perform a trial run with no changes made to the target repository. -s variant=value,src_repo The variant name and value to use for packages from this source, followed by the filesystem path or URI of the source repository or package archive to retrieve packages from. Multiple variants may be specified separated by commas. The same variants must be named for all sources. This option may be specified multiple times. -p publisher_prefix The name of the publisher we should merge packages from. This option may be specified multiple times. If no -p option is used, the default is to merge packages from all publishers in all source repositories. --help or -? Displays a usage message. Environment: TMPDIR, TEMP, TMP The absolute path of the directory where temporary data should be stored during program execution.
de: Syntax: pkgmerge [-n] -d dest_repo -s variant=value[,...],src_repo ... [-p publisher_prefix ... ] [pkg_fmri_pattern ...] Options: -d dest_repo Der Dateisystempfad oder URI des Ziel-Repositorys, in dem die zusammengeführten Packages veröffentlicht werden sollen. Das Ziel-Repository muss bereits vorhanden sein. Neue Repositorys können mit pkgrepo(1) erstellt werden. -n Führen Sie einen Probelauf aus, ohne Änderungen am Ziel- Repository vorzunehmen. -s variant=value,src_repo Variantenname und -wert für die Packages aus dieser Quelle gefolgt vom Dateisystempfad oder URI des Quell-Repositorys oder Packagearchivs, aus dem Packages abgerufen werden sollen. Mehrere Varianten müssen durch Kommas getrennt werden. Für alle Quellen müssen dieselben Varianten angegeben werden. Diese Option kann mehrfach festgelegt werden. -p publisher_prefix Der Name des Herausgebers, von dem Packages zusammengeführt werden sollen. Diese Option kann mehrmals angegeben werden. Wenn die Option -p nicht verwendet wird, werden standardmäßig Packages von allen Herausgebern in allen Quell-Repositorys zusammengeführt. --help or -? Zeigt Verwendungshinweise an. Umgebung: TMPDIR, TEMP, TMP Der absolute Pfad des Verzeichnisses, in dem temporäre Daten beim Ausführen des Programms gespeichert werden sollen.
es: Sintaxis: pkgmerge [-n] -d dest_repo -s variant=value[,...],src_repo ... [-p publisher_prefix ... ] [pkg_fmri_pattern ...] Opciones: -d dest_repo El URI o la ruta del sistema de archivos del repositorio de destino donde se publicarán los paquetes fusionados. El repositorio de destino debe existir con anterioridad; se pueden crear repositorios nuevos mediante pkgrepo(1). -n Llevar a cabo una ejecución de prueba sin realizar cambios en el repositorio de destino. -s variant=value,src_repo El nombre y el valor de variante para utilizar con paquetes de este origen, seguidos del URI o la ruta del sistema de archivos del repositorio de origen o del contenedor de paquetes de donde se pueden recuperar paquetes. Se pueden especificar varias variantes separadas por comas. Las mismas variantes deben tener un nombre asignado para todos los orígenes. Esta opción se puede especificar varias veces. -p publisher_prefix El nombre del editor desde el cual se debe fusionar los paquetes. Esta opción puede especificarse varias veces. Si no se usa ninguna opción –p, por defecto se fusionan paquetes de todos los editores en todos los repositorios de origen. --help or -? Muestra un mensaje de uso. Entorno: TMPDIR, TEMP, TMP La ruta absoluta del directorio donde se deben almacenar los datos temporales durante la ejecución del programa.
fr: Syntaxe : pkgmerge [-n] -d dest_repo -s variant=value[,...],src_repo ... [-p publisher_prefix ... ] [pkg_fmri_pattern ...] Options : -d dest_repo Chemin du système de fichiers ou URI du référentiel cible où publier les packages fusionnés. Le référentiel cible doit déjà exister ; de nouveaux référentiels peuvent être créés à l'aide de pkgrepo(1). -n Effectuez une série de tests sans apporter de modifications au référentiel cible. -s variant=value,src_repo Nom et valeur de la variante à utiliser pour les packages de cette source, suivis du chemin du système de fichiers ou de l'URI du référentiel source ou de l'archive de récupération des packages. Vous devez spécifier plusieurs variantes et les séparer par des virgules. Les variantes identiques doivent être nommées pour toutes les sources. Cette option peut être spécifiée plusieurs fois. -p publisher_prefix Nom de l'éditeur à partir duquel des packages doivent être fusionnés. Cette option peut être spécifiée plusieurs fois. Si l'option -p n'est pas utilisée, les packages de tous les éditeurs dans tous les référentiels source sont fusionnés. --help ou -? Affiche un message relatif à la syntaxe. Environnement : TMPDIR, TEMP, TMP Chemin absolu du répertoire où les données temporaires doivent être stockées durant l'exécution du programme.
ja: 使用方法: pkgmerge [-n] -d dest_repo -s variant=value[,...],src_repo ... [-p publisher_prefix ... ] [pkg_fmri_pattern ...] オプション: -d dest_repo マージしたパッケージを発行する先のターゲットリポジトリの ファイルシステムパスまたは URI。ターゲットリポジトリはすでに 存在している必要があります。新しいリポジトリを作成するには、pkgrepo(1) を使用します。 -n ターゲットリポジトリに変更を加えずに、試験実行を 行います。 -s variant=value,src_repo このソースのパッケージに使用するバリアント名および値。 パッケージを取得する元のソースリポジトリまたはパッケージ アーカイブのファイルシステムパスまたは URI が後ろに続きます。複数のバリアントを コンマで区切って指定できます。すべてのソースに対して 同じバリアントを指定する必要があります。このオプションは複数回 指定できます。 -p publisher_prefix パッケージのマージ元にするべきパブリッシャーの名前。この オプションは複数回指定できます。-p オプションを使用しない場合、 デフォルトではすべてのソースリポジトリ内のすべてのパブリッシャーから パッケージをマージします。 --help または -? 使用方法のメッセージを表示します。 環境: TMPDIR、TEMP、TMP プログラムの実行中に一時データが格納されるディレクトリの 絶対パス。

source: At least one variant name, value, and package source must be provided using -s.
de: Es müssen mindestens ein Variantenname, Wert und eine Paketquelle mithilfe der Option -s angegeben werden.
es: Se debe proporcionar al menos un nombre, un valor y un origen de paquete de variante mediante -s.
fr: Au moins un nom de variante, une valeur et une source de package doivent être indiqués à l'aide de -s.
ja: 少なくとも 1 つのバリアント名、値、およびパッケージソースを -s を使用して指定する必要があります。

source: A destination package repository must be provided using -d.
de: Ein Ziel-Repository für ein Paket muss mithilfe der Option -d angegeben werden.
es: Se debe proporcionar un repositorio de paquete de destino mediante -d.
fr: Un référentiel de package de destination doit être fourni à l'aide de -d.
ja: 保存先のパッケージリポジトリを -d を使用して指定する必要があります。

source: Source {source} missing values for variants: {missing}
de: In Quelle {source} fehlen Werte für Varianten: {missing}
es: Valores faltantes de origen {source} para variantes: {missing}
fr: Valeurs de source {source} manquantes pour les variantes : {missing}
ja: ソース {source} にバリアントの値がありません: {missing}

source: No source was specified for variant combination {combo}.
de: Für Variantenkombination {combo} wurde keine Quelle angegeben.
es: No se especificó ningún origen para la combinación de variantes {combo}.
fr: Aucune source spécifiée pour la combinaison {combo} de variantes.
ja: バリアントの組み合わせ {combo} にソースが指定されていません。

source: no publishers from source repositories match the given -p options.
de: Keine Herausgeber aus den Quell-Repositorys entsprechen den angegebenen -p-Optionen.
es: no hay editores de los repositorios de origen que coincidan con las opciones de -p dadas.
fr: aucun éditeur des référentiels sources ne correspond aux options -p indiquées.
ja: 指定された -p オプションに一致する、ソースリポジトリからのパブリッシャーはありません。

source: The following pattern(s) did not match any packages in any of the specified repositories for publisher {pub_name}: {patterns}
de: Die folgenden Muster entsprechen keinem der Packages in den angegebenen Repositorys für Herausgeber {pub_name}: {patterns}
es: Los siguientes modelos no coinciden con ningún paquete de ninguno de los repositorios especificados para el editor {pub_name}: {patterns}
fr: Le ou les modèles suivants ne correspondaient aux packages d'aucun des référentiels spécifiés pour l'éditeur {pub_name} : {patterns}
ja: 次のパターンは、パブリッシャー {pub_name} の指定されたどのリポジトリのどのパッケージにも一致しませんでした: {patterns}

source: fmris matching the following patterns do not have matching versions across all repositories for publisher {pubs}: {patterns}
de: FMRIs mit folgendem Muster haben nicht in allen Repositorys für Herausgebern {pubs} entsprechende Versionen: {patterns}
es: Los FMRI que coinciden con los siguientes modelos no tienen versiones que coincidan en todos los repositorios para el editor {pubs}: {patterns}
fr: Les FMRI correspondant aux modèles suivants n'ont pas de versions correspondantes dans tous les référentiels pour l'éditeur {pubs} : {patterns}
ja: 次のパターンに一致する FMRI には、一致するバージョンがパブリッシャー {pubs} のどのリポジトリにもありません: {patterns}

source: the following publishers were not found in source repositories: {0}
de: Die folgenden Herausgeber wurden nicht in den Quell-Repositorys gefunden: {0}
es: no se encontraron los siguientes editores en los repositorios de origen: {0}
fr: les éditeurs suivants sont introuvables dans les référentiels sources : {0}
ja: 次のパブリッシャーがソースリポジトリに見つかりませんでした: {0}

source: package {pkg} is tagged as not supporting {var_name} {var_value}
de: Tag von Package {pkg} bedeutet, dass {var_name} {var_value} nicht unterstützt wird
es: el paquete {pkg} está etiquetado como no compatible con {var_name} {var_value}
fr: Le package {pkg} est marqué comme ne prenant pas en charge {var_name} {var_value}
ja: パッケージ {pkg} は {var_name} {var_value} を未サポートとしてタグ付けされます

source: Usage: pkgmogrify [-vi] [-I includedir ...] [-D macro=value ...] [-O outputfile] [-P printfile] [inputfile ...]
de: Syntax: pkgmogrify [-vi] [-I includedir ...] [-D macro=value ...] [-O outputfile] [-P printfile] [inputfile ...]
es: Sintaxis: pkgmogrify [-vi] [-I includedir ...] [-D macro=value ...] [-O outputfile] [-P printfile] [inputfile ...]
fr: Syntaxe : pkgmogrify [-vi] [-I includedir ...] [-D macro=value ...] [-O outputfile] [-P printfile] [inputfile ...]
ja: 使用方法: pkgmogrify [-vi] [-I includedir ...] [-D macro=value ...] [-O outputfile] [-P printfile] [inputfile ...]

source: macros must be of form name=value
de: Makros müssen die Form Name=Wert haben.
es: las macros deben tener el formato nombre=valor
fr: les macros doivent être sous la forme name=value
ja: マクロは name=value の形式である必要があります

source: Cannot write output {0}
de: Ausgabe {0} kann nicht geschrieben werden
es: No se puede escribir la salida {0}
fr: Impossible d'écrire une sortie {0}
ja: 出力 {0} を書き込めません

source: The target repository has been modified but the operation did not finish successfully. It is now in an inconsistent state. To re-try the operation, run the following commands: /usr/bin/pkgrepo rebuild -s {repo} --no-index {argv}
de: Das Ziel-Repository wurde geändert, aber der Vorgang wurde nicht erfolgreich abgeschlossen. Der Status ist nun inkonsistent. Um den Vorgang zu wiederholen, führen Sie die folgenden Befehle aus: /usr/bin/pkgrepo rebuild -s {repo} --no-index {argv}
es: El repositorio de destino se modificó, pero la operación no finalizó correctamente. Ahora tiene un estado incoherente. Para volver a intentar la operación, ejecute los siguientes comandos: /usr/bin/pkgrepo rebuild -s {repo} --no-index {argv}
fr: Le référentiel cible a été modifié mais l'opération ne s'est pas terminée correctement. Il se trouve maintenant dans un état incohérent. Pour retenter l'opération, exécutez les commandes suivantes : /usr/bin/pkgrepo rebuild -s {repo} --no-index {argv}
ja: ターゲットリポジトリは変更されましたが、操作が正常に終了しません でした。現在は一貫性のない状態になっています。 操作を再試行するには、次のコマンドを実行します: /usr/bin/pkgrepo rebuild -s {repo} --no-index {argv}

source: Usage: pkgsurf -s target_path -r ref_uri [-n] [-p publisher ...] [-i name ...] [-c pattern ...] Options: -c pattern Treat every package whose FMRI matches 'pattern' as changed and do not reversion it. Can be specified multiple times. -i name Ignore set actions with the name field set to 'name' for determination of content change. Can be specified multiple times. -n Perform a trial run with no changes made. -p publisher Only operate on given publisher. Can be specified multiple times. -r ref_uri URI of reference repository. -s target_path Path to target repository. Repository should only contain one version of each package. Must be a filesystem-based repository. -?/--help Print this message.
de: Verwendung: pkgsurf -s target_path -r ref_uri [-n] [-p publisher ...] [-i name ...] [-c pattern ...] Optionen: -c pattern Behandelt jedes Package, bei dem FMRI mit 'pattern' übereinstimmt, als geändert und führt keine Reversionierung aus. Kann mehrmals angegeben werden. -i name Ignoriert set-Aktionen mit dem Namensfeld 'name' zur Bestimmung der Inhaltsänderung. Kann mehrmals angegeben werden. -n Führt einen Probelauf aus, ohne Änderungen vorzunehmen -p publisher Führt den Vorgang nur mit dem angegebenen Herausgeber aus. Kann mehrmals angegeben werden. -r ref_uri URI des Referenz-Repositorys. -s target_path Pfad zum Ziel-Repository. Repository darf nur eine Version jedes Packages enthalten. Muss ein dateisystembasiertes Repository sein. -?/--help Druckt diese Meldung.
es: Sintaxis: pkgsurf -s target_path -r ref_uri [-n] [-p publisher ...] [-i name ...] [-c pattern ...] Opciones: -c pattern Trata todos los paquetes cuyo FMRI coincida con 'pattern' como cambiado y no realiza una reversión. Se puede especificar varias veces. -i name Ignora las acciones de configuración con el campo de nombre definido en 'name' para la determinación de cambio de contenido. Se puede especificar varias veces. -n Realiza una ejecución de prueba sin cambios realizados. -p publisher Solo funciona en el editor especificado. Se puede especificar varias veces. -r ref_uri URI de repositorio de referencia. -s target_path Ruta para el repositorio de destino. El repositorio solo debe contener una versión de cada paquete. Debe ser un repositorio basado en sistema de archivos. -?/--help Imprime este mensaje.
fr: Utilisation : pkgsurf -s target_path -r ref_uri [-n] [-p publisher ...] [-i name ...] [-c pattern ...] Options : -c pattern Traiter chaque package dont le FMRI correspond à 'pattern' comme modifié et ne pas en modifier le versionnage. Peut être spécifié plusieurs fois. -i name Ignorer les actions définies dont le champ de nom est réglé à 'name' lors de la détermination de la modification du contenu. Peut être spécifié plusieurs fois. -n Effectuer une série de tests sans avoir apporté de modifications. -p publisher Appliquer uniquement à l'éditeur spécifié. Peut être spécifié plusieurs fois. -r ref_uri URI du référentiel de référence. -s target_path Chemin d'accès au référentiel cible. Le référentiel ne doit contenir qu'une version de chaque package. Il doit être basé sur un système de fichiers. -?/--help Imprimer ce message.
ja: 使用方法: pkgsurf -s target_path -r ref_uri [-n] [-p publisher ...] [-i name ...] [-c pattern ...] オプション: -c pattern 変更時に 'pattern' と一致し、それを復元しない FMRI を持 つすべてのパッケージを処理します。複数回指定できます。 -i name 名前フィールドが内容の変更を決めるための 'name' に設定さ れている設定アクションを無視します。複数回指定できます。 -n 変更を加えずに試験実行を行います。 -p publisher 指定されたパブリッシャーのみを操作します。複数回指定でき ます。 -r ref_uri 参照リポジトリの URI。 -s target_path ターゲットリポジトリへのパス。リポジトリには各パッケージ のバージョンを 1 つだけ含めるようにします。ファイルシス テムベースのリポジトリである必要があります。 -?/--help このメッセージを出力します。
