Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: To continue, execute 'pkg update-format' as a privileged user and then try again. Please note that updating the format of the image will render it unusable with older versions of the pkg(7) system.
de: Führen Sie zum Fortfahren 'pkg update-format' als privilegierter Benutzer aus und versuchen Sie es danach erneut. Beachten Sie, dass durch das Aktualisieren des Abbildformats das Abbild nicht mehr mit älteren Versionen des Systems pkg(7) verwendet werden kann.
es: Para continuar, ejecute 'pkg update-format' como usuario con privilegios y vuelva a intentarlo. Tenga en cuenta que, si actualiza el formato de la imagen, no podrá utilizarla con versiones más antiguas del sistema pkg(7).
fr: Pour continuer, exécutez 'pkg update-format' en tant qu'utilisateur privilégié, puis réessayez. Notez que la mise à jour du format de l'image la rendra inutilisable avec d'anciennes versions du système pkg(7).
ja: 続行するには、特権ユーザーとして 'pkg update-format' を実行してから再試行します。イメージの形式を更新すると、古いバージョンの pkg(7) システムでは使用できない形式になります。

source: Usage:
de: Verwendung:
es: Sintaxis:
fr: Utilisation :
ja: 使用方法:

source: Private subcommand usage, options subject to change at any time:
de: Private Unterbefehlssyntax; Optionen können jederzeit geändert werden:
es: Uso de subcomando privado, opciones sujetas a cambio en cualquier momento:
fr: Syntaxe des sous-commandes privées, les options sont susceptibles de modification à tout moment :
ja: プライベートサブコマンドの使用方法、オプション (いつでも変更される可能性があります):

source: Did you mean: {0}
de: Haben Sie Folgendes gemeint: {0}
es: ¿Quiso decir lo siguiente?: {0}
fr: Vous vouliez dire : {0}
ja: もしかして: {0}

source: For a full list of subcommands, run: pkg help
de: Für eine vollständige Liste der Unterbefehle führen Sie pkg help aus
es: Para obtener una lista completa de los subcomandos, ejecute: pkg help
fr: Pour obtenir une liste complète des sous-commandes, exécutez : pkg help
ja: サブコマンドの全一覧には次を実行します: pkg help

source: Usage: pkg [options] command [cmd_options] [operands]
de: Syntax: pkg [options] command [cmd_options] [operands]
es: Sintaxis: pkg [options] command [cmd_options] [operands]
fr: Utilisation : pkg [options] commande [cmd_options] [operands]
ja: 使用方法: pkg [options] command [cmd_options] [operands]
ru: Использование: pkg [options] command [cmd_options] [operands]

source: Basic subcommands:
de: Grundlegende Unterbefehle:
es: Subcomandos básicos:
fr: Sous-commandes de base :
ja: 基本的なサブコマンド:
ru: Основные подкоманды:

source: Advanced subcommands:
de: Erweiterte Unterbefehle:
es: Subcomandos avanzados:
fr: Sous-commandes avancées :
ja: 高度なサブコマンド:
ru: Расширенные подкоманды:

source: Options: -R dir --no-network-cache --help or -? Environment: PKG_IMAGE
de: Optionen: -R dir --no-network-cache --help oder -? Umgebung: PKG_IMAGE
es: Opciones: -R dir --no-network-cache --help or -? Entorno: PKG_IMAGE
fr: Options : -R dir --no-network-cache --help or -? Environnement : PKG_IMAGE
ja: オプション: -R dir --no-network-cache --help または -? 環境: PKG_IMAGE

source: Usage: pkg [options] command [cmd_options] [operands]
de: Verwendung: pkg [options] command [cmd_options] [operands]
es: Sintaxis: pkg [options] command [cmd_options] [operands]
fr: Syntaxe : pkg [options] commande [cmd_options] [operands]
ja: 使用方法: pkg [options] command [cmd_options] [operands]

source: The following commands are supported:
de: Die folgenden Befehle werden unterstützt:
es: Se admiten los siguientes comandos:
fr: Les commandes suivantes sont prises en charge :
ja: 次のコマンドがサポートされています:

source: Package Information : list search info contents Package Transitions : update install uninstall history exact-install Package Maintenance : verify fix revert Publishers : publisher set-publisher unset-publisher Package Configuration: mediator set-mediator unset-mediator facet change-facet variant change-variant Image Constraints : avoid unavoid freeze unfreeze Image Configuration : refresh rebuild-index purge-history property set-property add-property-value unset-property remove-property-value Miscellaneous : image-create dehydrate rehydrate For more info, run: pkg help <command>
de: Packageinformationen: list search info contents Packageübergang : update install uninstall history exact-install Packagewartung : verify fix revert Herausgeber : publisher set-publisher unset-publisher Packagekonfiguration: mediator set-mediator unset-mediator facet change-facet variant change-variant Image-Constraints : avoid unavoid freeze unfreeze Imagekonfiguration : refresh rebuild-index purge-history property set-property add-property-value unset-property remove-property-value Sonstige : image-create dehydrate rehydrate Für weitere Informationen führen Sie pkg help <command> aus
es: Información de paquete : list search info contents Transiciones de paquete : update install uninstall history exact-install Mantenimiento de paquete: verify fix revert Editores : publisher set-publisher unset-publisher Configuración de paquete: mediator set-mediator unset-mediator facet change-facet variant change-variant Restricciones de imagen : avoid unavoid freeze unfreeze Configuración de imagen : refresh rebuild-index purge-history property set-property add-property-value unset-property remove-property-value Varios : image-create dehydrate rehydrate Para obtener más información, ejecute: pkg help <command>
fr: Informations sur le package: list search info contents Transitions de package : update install uninstall history exact-install Maintenance du package : verify fix revert Editeurs : publisher set-publisher unset-publisher Configuration du package : mediator set-mediator unset-mediator facet change-facet variant change-variant Contraintes de l'image : avoid unavoid freeze unfreeze Configuration de l'image : refresh rebuild-index purge-history property set-property add-property-value unset-property remove-property-value Divers : image-create dehydrate rehydrate Pour plus d'informations, exécutez : pkg help <command>
ja: パッケージ情報 : list search info contents パッケージ移行 : update install uninstall history exact-install パッケージメンテナンス: verify fix revert パブリッシャー : publisher set-publisher unset-publisher パッケージ構成 : mediator set-mediator unset-mediator facet change-facet variant change-variant イメージ制約 : avoid unavoid freeze unfreeze イメージ構成 : refresh rebuild-index purge-history property set-property add-property-value unset-property remove-property-value その他 : image-create dehydrate rehydrate 詳細は、pkg help <command> を実行してください

source: WARNING: The boot environment being modified is not the active one. Changes made in the active BE will not be reflected on the next boot.
de: WARNUNG: Die Boot-Umgebung, die derzeit geändert wird, ist nicht die aktive Umgebung. Änderungen an der aktiven BU werden beim nächsten Boot-Vorgang nicht umgesetzt.
es: ADVERTENCIA: El entorno de inicio que se está modificando no es el activo. Los cambios realizados en el entorno de inicio activo no se reflejarán en el próximo inicio.
fr: AVERTISSEMENT : l'environnement d'initialisation en cours de modification n'est pas le BE actif. Les modifications effectuées dans le BE actif ne seront pas répercutées sur le prochain démarrage.
ja: 警告: 変更されているブート環境はアクティブなものではありません。アクティブな ブート環境に行われた変更は、次のブートに反映されません。

source: WARNING: The boot environment being modified is not the active one. Changes made will not be reflected on the next boot.
de: WARNUNG: Die Boot-Umgebung, die derzeit geändert wird, ist nicht die aktive Umgebung. Änderungen werden beim nächsten Boot-Vorgang nicht umgesetzt.
es: ADVERTENCIA: El entorno de inicio que se está modificando no es el activo. Los cambios realizados no se reflejarán en el próximo inicio.
fr: AVERTISSEMENT : l'environnement d'initialisation en cours de modification n'est pas le BE actif. Les modifications effectuées ne seront pas répercutées sur le prochain démarrage.
ja: 警告: 変更されているブート環境はアクティブなものではありません。行われた変更 は、次のブートに反映されません。

source: Yes
ca: Si
de: Ja
es: Sí
fr: Oui
ja: はい
ru: Да

source: No
de: Nein
fr: Non
ja: いいえ
ru: Нет

source: Packages to remove:
de: Zu entfernende Packages:
es: Paquetes que eliminar:
fr: Packages à supprimer :
ja: 削除するパッケージ:

source: Packages to install:
de: Zu installierende Packages:
es: Paquetes que instalar:
fr: Packages à installer :
ja: インストールするパッケージ:

source: Packages to update:
de: Zu aktualisierende Packages:
es: Paquetes que actualizar:
fr: Packages à mettre à jour :
ja: 更新するパッケージ:

source: Packages to change:
de: Zu ändernde Packages:
es: Paquetes que cambiar:
fr: Packages à modifier :
ja: 変更するパッケージ:

source: Packages to fix:
de: Zu reparierende Packages:
es: Paquetes que corregir:
fr: Packages à réparer :
ja: 修正するパッケージ:

source: Mediators to change:
de: Zu ändernde Vermittler:
es: Mediadores que cambiar:
fr: Médiateurs à modifier :
ja: 変更するメディエータ:

source: Variants/Facets to change:
de: Zu ändernde Varianten/Facetten:
es: Variantes/facetas que cambiar:
fr: Variantes/facettes à modifier :
ja: 変更するバリアント/ファセット:

source: Services to change:
de: Zu ändernde Services:
es: Servicios que cambiar:
fr: Services à modifier :
ja: 変更するサービス:

source: Estimated space available:
de: Geschätzter verfügbarer Speicherplatz:
es: Espacio disponible calculado:
fr: Espace disponible estimé :
ja: 推定使用可能容量:

source: Estimated space to be consumed:
de: Geschätzter Speicherplatzverbrauch:
es: Espacio para utilizar calculado:
fr: Espace à consommer estimé :
ja: 推定消費容量:

source: Create boot environment:
de: Boot-Umgebung erstellen:
es: Crear entorno de inicio:
fr: Créer un environnement d'initialisation :
ja: ブート環境の作成:

source: Activate boot environment:
de: Boot-Umgebung aktivieren:
es: Activar entorno de inicio:
fr: Activer l'environnement d'initialisation :
ja: ブート環境のアクティブ化:

source: Create backup boot environment:
de: Sicherung der Boot-Umgebung erstellen:
es: Crear copia de seguridad de entorno de inicio:
fr: Créer un environnement d'initialisation de sauvegarde :
ja: バックアップブート環境の作成:

source: Rebuild boot archive:
de: Boot-Archiv neu erstellen:
es: Volver a generar archivo de inicio:
fr: Reconstruire l'archive d'initialisation :
ja: ブートアーカイブの再構築:

source: Changed mediators:
de: Geänderte Vermittler:
es: Mediadores cambiados:
fr: Médiateurs modifiés :
ja: 変更されたメディエータ:

source: Changed variants/facets:
de: Geänderte Varianten/Facetten:
es: Variantes/facetas cambiadas:
fr: Variantes/facettes modifiées :
ja: 変更されたバリアント/ファセット:
ru: Измененные варианты/грани:

source: Solver dependency errors:
de: Solver-Abhängigkeitsfehler:
es: Errores de dependencia de optimizador:
fr: Erreurs de dépendance du solveur :
ja: ソルバーの依存関係エラー:

source: Changed packages:
de: Geänderte Packages:
es: Paquetes cambiados:
fr: Packages modifiés :
ja: 変更されたパッケージ:

source: Package-triggered Operations:
de: Durch Package ausgelöste Vorgänge:
es: Operaciones activadas por paquete:
fr: Opérations déclenchées par le package :
ja: パッケージによってトリガーされた操作:

source: Services:
es: Servicios:
ja: サービス:
ru: Службы:

source: Move:
de: Verschieben:
es: Mover:
fr: Déplacer :
ja: 移動:

source: Remove:
de: Entfernen:
es: Eliminar:
fr: Supprimer :
ja: 削除:

source: Install:
de: Installieren:
es: Instalar:
fr: Installer :
ja: インストール:

source: Update:
de: Aktualisieren:
es: Actualizar:
fr: Mettre à jour :
ja: 更新:

source: Editable files to change:
de: Bearbeitbare zu ändernde Dateien:
es: Archivos editables para cambiar:
fr: Fichiers modifiables à modifier :
ja: 変更する編集可能なファイル:

source: Actions:
de: Aktionen:
es: Acciones:
ja: アクション:

source: Release Notes:
de: Versionshinweise:
es: Notas de la versión:
fr: Notes de version :
ja: リリースノート:

source: Release notes can be viewed with 'pkg history -n 1 -N'
de: Versionshinweise können mit 'pkg history -n 1 -N' angezeigt werden.
es: Las notas de la versión se pueden visualizar con 'pkg history -n 1 -N'
fr: Les notes de version peuvent être affichées à l'aide de 'pkg history -n 1 -N'
ja: リリースノートは 'pkg history -n 1 -N' で表示できます

source: Release notes can be found in {0} before rebooting.
de: Vor dem Neustart befinden sich die Versionshinweise in {0}.
es: Las notas de la versión se pueden encontrar en {0} antes del reinicio.
fr: Les notes de version sont disponibles à l'emplacement {0} avant la réinitialisation.
ja: リブート前は {0} でリリースノートを参照できます。

source: After rebooting, use 'pkg history -n 1 -N' to view release notes.
de: Verwenden Sie 'pkg history -n 1 -N' nach dem Neustart, um die Versionshinweise anzuzeigen.
es: Después del reinicio, utilice 'pkg history -n 1 -N' para ver las notas de la versión.
fr: Après la réinitialisation, utilisez 'pkg history -n 1 -N' pour afficher les notes de version.
ja: リブート後は 'pkg history -n 1 -N' を使用してリリースノートを表示します。

source: Package: {0}
es: Paquete: {0}
ja: パッケージ: {0}

source: License: {0}
de: Lizenz: {0}
es: Licencia: {0}
fr: Licence : {0}
ja: ライセンス: {0}

source: No updates available for this image.
ca: No hi han actualitzacions disponibles per a aquesta imatge.
de: Keine Updates für dieses Abbild verfügbar.
es: No hay actualizaciones para esta imagen.
fr: Aucune mise à jour n'est disponible pour cette image.
ja: このイメージで使用可能な更新は存在しません。
ru: Для данного образа нет доступных обновлений.

source: No updates necessary for this image.
ca: Sense actualitzacions necessàries per a aquesta imatge.
de: Für dieses Abbild sind keine Updates erforderlich.
es: No hay actualizaciones para esta imagen.
fr: Aucune mise à jour n'est nécessaire pour cette image.
ja: このイメージは更新の必要はありません。
ru: Для данного образа не требуются обновления.

source: Could not repair: {0:50}
de: Instandsetzung nicht möglich: {0:50}
es: No se pudo reparar: {0:50}
fr: L'élément suivant n'a pas pu être réparé : {0:50}
ja: 修復できませんでした: {0:50}

source: Repairing: {0:50}
de: {0:50} wird repariert
es: Reparando: {0:50}
fr: Réparation : {0:50}
ja: 修復しています: {0:50}

source: PACKAGE
es: PAQUETE
ja: パッケージ
ru: ПАКЕТ

source: STATUS
ca: ESTAT
es: ESTADO
fr: STATUT
ja: ステータス

source: UNPACKAGED CONTENTS
de: UNVERPACKTE INHALTE
es: CONTENIDOS SIN EMPAQUETAR
fr: CONTENUS NON PACKAGES
ja: パッケージ解除された内容

source: WARNING: {0}
de: WARNUNG: {0}
es: ADVERTENCIA: {0}
fr: AVERTISSEMENT : {0}
ja: 警告: {0}

source: ERROR: {0}
de: FEHLER: {0}
fr: ERREUR : {0}
ja: エラー: {0}

source: The following packages require their licenses to be accepted before they can be installed or updated:
ca: Els següents paquets necessiten que s'acceptin les seves llicències abans que puguin ser instal·lats o actualitzats:
de: Die Lizenzen für die folgenden Pakete müssen akzeptiert werden, bevor sie installiert oder aktualisiert werden können:
es: Los siguientes paquetes necesitan licencia para ser aceptados antes de proceder a su instalación o actualización:
fr: Il est nécessaire que les licences des packages suivants soient acceptées pour qu'ils puissent être installés ou mis à jour :
ja: 次のパッケージはインストールないし更新する前にライセンスに同意する必要があります。
ru: Перед установкой или обновлением следующих пакетов необходимо принять условия соответствующих лицензий:

source: To indicate that you agree to and accept the terms of the licenses of the packages listed above, use the --accept option. To display all of the related licenses, use the --licenses option.
ca: Per tal d'indicar que esteu d'acord i acceptar els termes de la llicència dels paquets llistats a continuació, utilitzeu l'opció --accept. Per a mostrar totes les llicències relacionades, utilitzeu l'opció --licenses.
de: Um anzugeben, dass Sie die Lizenzbedingungen der oben aufgeführten Pakete anerkennen, verwenden Sie die Option --accept. Verwenden Sie zum Anzeigen aller zugehörigen Lizenzen die Option --licenses.
es: Para indicar que acepta las condiciones de las licencias de los paquetes anteriormente indicados, utilice la opción --accept. Para mostrar todas las licencias relacionadas, utilice la opción --licenses.
fr: Pour indiquer votre acceptation des conditions des licences des packages répertoriés ci-dessus, utilisez l'option --accept. Pour afficher l'ensemble des licences liées, utilisez l'option --licenses.
ja: 上に表示されているパッケージのライセンス契約書の条項に同意し受諾することを示すには、「--accept」オプションを使用します。全ての関連ライセンスを表示するには、「--licenses」オプションを使用します。
ru: Для подтверждения согласия с условиями лицензий пакетов из списка, приведенного выше, воспользуйтесь параметром --accept. Для вывода всех соответствующих лицензий воспользуйтесь параметром --licenses.

source: An unexpected error happened while preparing for {0}:
de: Bei der Vorbereitung von {0} ist ein unerwarteter Fehler aufgetreten:
es: Un error inesperado ha ocurrido mientras se preparaba para {0}:
fr: Une erreur inattendue s'est produite lors de la préparation de la commande {0} :
ja: {0} の準備中に予期しないエラーが発生しました:

source: {operation} failed: {err}
de: {operation} Fehler: {err}
es: Se produjo un error en {operation}: {err}
fr: Echec de {operation} : {err}
ja: {operation} 失敗しました: {err}

source: {operation} failed (linked image exception(s)): {err}
de: {operation} fehlgeschlagen (verknüpfte Abbildausnahme(n)): {err}
es: Se produjo un error en {operation} (excepción de imagen enlazada): {err}
fr: Echec de {operation} (exception(s) d'image(s) liée(s)) : {err}
ja: {operation} が失敗しました (リンクされたイメージの例外): {err}

source: {0} cannot be done on live image
de: {0} ist bei einem Live-Abbild nicht möglich.
es: {0} no se puede ejecutar en una imagen activa
fr: Impossible d'exécuter {0} sur une image live
ja: ライブイメージに {0} を実行することはできません

source: Requested "{0}" operation would affect files that cannot be modified in live image. Please retry this operation on an alternate boot environment.
de: Angeforderter "{0}"-Vorgang würde sich auf Dateien auswirken, die im Live-Abbild nicht geändert werden können. Versuchen Sie diesen Vorgang in einer alternativen Boot-Umgebung erneut.
es: La operación "{0}" solicitada podría afectar a archivos que no pueden modificarse en una imagen activa. Vuelva a intentar esta operación en un entorno de inicio alternativo.
fr: L'opération "{0}" demandée risque d'affecter des fichiers qui ne peuvent pas être modifiés dans l'image live. Retentez l'opération dans un autre environnement d'initialisation.
ja: 要求された "{0}" 操作は、ライブイメージ内で変更できないファイルに影響を及ぼします。 操作を代替ブート環境で再試行してください。

source: (Failure to consistently execute pkg commands as a privileged user is often a source of this problem.)
de: (Dieses Problem wird häufig dadurch verursacht, dass pkg-Befehle nicht konsequent durch einen privilegierten Benutzer ausgeführt werden.)
es: (El error en la ejecución coherente de los comandos pkg como usuario con privilegios es con frecuencia el origen de este problema).
fr: (Une exécution incohérente des commandes pkg en tant qu'utilisateur privilégié est souvent la cause de ce problème.)
ja: (多くの場合、常に特権ユーザーとして pkg コマンドを実行していないことがこの問題の原因です)。

source: An unexpected error happened during {operation}: {err}
de: Während des Vorgangs {operation} ist ein unerwarteter Fehler aufgetreten: {err}
es: Un error inesperado ha ocurrido durante {operation}: {err}
fr: Une erreur inattendue s'est produite durant {operation} : {err}
ja: {operation} 中に予期しないエラーが発生しました: {err}

source: The following unexpected or editable files and directories were salvaged while executing the requested package operation; they have been moved to the displayed location in the image:
de: Folgende unerwartete oder bearbeitbare Dateien und Verzeichnisse wurden beim Ausführen des angeforderten Paketvorgangs wiederhergestellt. Sie wurden an den angezeigten Speicherort im Abbild verschoben:
es: Se recuperaron los siguientes archivos y directorios editables o inesperados al ejecutar la operación de paquetes seleccionada; se desplazaron a la ubicación que se muestra en la imagen:
fr: Les fichiers et répertoires inattendus ou modifiables suivants ont été récupérés lors de l'exécution de l'opération de package demandée ; ils ont été placés à l'emplacement affiché dans l'image :
ja: 要求されたパッケージ操作の実行中に次の予期しないまたは 編集可能なファイルおよびディレクトリが回収されました。 これらは、イメージ内の表示された場所に移動されています:

source: No image rooted at '{0}' (set by $PKG_IMAGE)
de: Kein Root-Abbild in '{0}' (durch $PKG_IMAGE festgelegt)
es: No hay ninguna imagen con raíz en '{0}' (establecida por $PKG_IMAGE)
fr: Aucune image ne se trouve à l'emplacement '{0}' (défini par $PKG_IMAGE)
ja: ($PKG_IMAGE によって設定された) '{0}' をルートに持つイメージは存在しません

source: No image rooted at '{0}'
de: Kein Root-Abbild in '{0}'
es: No hay ninguna imagen con raíz en '{0}'
fr: Aucune image ne se trouve à l'emplacement '{0}'
ja: '{0}' をルートに持つイメージは存在しません

source: No image found.
ca: Cap imatge trobada.
de: Kein Image gefunden.
es: No se encontró ninguna imagen.
fr: Aucune image n'a été trouvée.
ja: イメージが見つかりません。
ru: Не найден ни один образ.

source: {operation} failed (inventory exception): {err}
de: {operation} fehlgeschlagen (Inventory-Ausnahme): {err}
es: Se produjo un error en {operation} (excepción de inventario): {err}
fr: Echec de {operation} (exception d'inventaire) : {err}
ja: {operation} が失敗しました (インベントリの例外): {err}

source: WARNING: pkg(7) appears to be out of date, and should be updated before running {op}. Please update pkg(7) by executing 'pkg install pkg:/package/pkg' as a privileged user and then retry the {op}.
de: WARNUNG: pkg(7) ist möglicherweise veraltet und muss vor dem Ausführen von {op} aktualisiert werden. Aktualisieren Sie als privilegierter Benutzer pkg(7) mit dem Befehl 'pkg install pkg:/package/pkg', und versuchen Sie dann, den Vorgang {op} erneut auszuführen.
es: ADVERTENCIA: pkg(7) parece estar desactualizado y debe actualizarse antes de ejecutar {op}. Actualice pkg(7) ejecutando 'pkg install pkg:/package/pkg' como usuario con privilegios y, a continuación, vuelva a intentar la ejecución de {op}.
fr: AVERTISSEMENT : pkg(7) est obsolète et doit être mis à jour avant d'exécuter {op}. Effectuez la mise à jour de pkg(7) à l'aide de la commande 'pkg install pkg:/package/pkg' en tant qu'utilisateur privilégié, puis retentez {op}.
ja: 警告: pkg(7) が古いようなので、{op} を実行する前に更新してください。 特権ユーザーとして 'pkg install pkg:/package/pkg' を実行して pkg(7) を更新したあとで、{op} を再試行してください。

source: The proposed operation cannot be performed on a live image.
de: Der vorgeschlagene Vorgang kann bei einem Live-Abbild nicht ausgeführt werden.
es: La operación propuesta no se puede realizar en una imagen activa.
fr: L'opération proposée ne peut pas être exécutée sur une image live.
ja: この操作はライブイメージに対して実行できません。

source: Please provide one of the package FMRIs listed above to the install command.
de: Stellen Sie einen der oben aufgeführten Paket-FMRIs bereit, um den Befehl zu installieren.
es: Proporcione uno de los FMRI de paquete indicados anteriormente para el comando de instalación.
fr: Indiquez l'un des FMRI du package énumérés ci-dessus dans la commande d'installation.
ja: 上記で一覧表示されているいずれかのパッケージ FMRI をインストールコマンドに指定してください。

source: {0}: no variants specified
de: {0}: Keine Varianten angegeben
es: {0}: no se especificaron variantes
fr: {0} : aucune variante spécifiée
ja: {0}: バリアントが指定されていません

source: {0}: variants must to be of the form '<name>=<value>'.
de: {0}: Varianten müssen die Form '<Name>=<Wert>' haben.
es: {0}: las variantes deben tener el formato '<name>=<value>'.
fr: {0} : les variantes doivent adopter la forme '<nom>=<valeur>'.
ja: {0}: バリアントは '<name>=<value>' の形式になっている必要があります。

source: {subcmd}: duplicate variant specified: {variant}
de: {subcmd}: Duplizierte Variante angegeben: {variant}
es: {subcmd}: variantes duplicadas especificas: {variant}
fr: {subcmd} : variante spécifiée en double : {variant}
ja: {subcmd}: 重複したバリアントが指定されています: {variant}

source: {0}: no facets specified
de: {0}: Keine Facetten angegeben
es: {0}: no se especificaron facetas
fr: {0} : aucune facette spécifiée
ja: {0}: ファセットが指定されていません

source: {0}: facets must to be of the form 'facet....=[True|False|None]'
de: {0}: Facetten müssen das folgende Format aufweisen: 'facet....=[True|False|None]'
es: {0}: las facetas deben tener el formato 'faceta....=[True|False|None]'
fr: {0} : les facettes doivent adopter le format 'facet....=[True|False|None]'
ja: {0}: ファセットは 'facet....=[True|False|None]' の形式になっている必要があります。
