Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: <table border='0' cellpadding='3' style='table-layout:fixed' ><TR><TD><IMG SRC = '%(base)s/%(prefix)sdialog-warning.png' style='border-style: none' alt='[Warning]' title='Warning' ALIGN='bottom'></TD><TD><h3><b>Search Warning</b></h3><TD></TD></TR><TR><TD></TD><TD>Search using only the wildcard character, <b>*</b>, is not supported in All Publishers</TD></TR>
ru: <table border='0' cellpadding='3' style='table-layout:fixed' ><TR><TD><IMG SRC = '%(base)s/%(prefix)sdialog-warning.png' style='border-style: none' alt='[Предупреждение]' title='Предупреждение' ALIGN='bottom'></TD><TD><h3><b>Предупреждение поиска</b></h3><TD></TD></TR><TR><TD></TD><TD>При поиске по всем издателям не поддерживается использование только подстановочного символа <b>*</b></TD></TR>

source: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Suggestions:</b><br></TD></TR><TR><TD></TD><TD<TD><li style='padding-left:7px'>Try new search terms</li>
ca: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD><TD><b>Suggeriments:</b><br></TD></TR><TR><TD></TD><TD<TD><li style='padding-left:7px'>Provar amb nous termes de cerca</li>
ru: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Предложения:</b><br></TD></TR><TR><TD></TD><TD<TD><li style='padding-left:7px'>Попробуйте новые условия поиска</li>

source: <li style='padding-left:7px'>Return to <a href='pm?pm-action=internal&search=%s'>Search All Publishers</a></li>
ru: <li style='padding-left:7px'>Перейдите к <a href='pm?pm-action=internal&search=%s'>Поиск по всем издателям</a></li>

source: <table border='0' cellpadding='3' style='table-layout:fixed' ><TR><TD><a href='stub'></a><IMG SRC = '%(base)s/%(prefix)sdialog-warning.png' style='border-style: none' alt='[Warning]' title='Warning' ALIGN='bottom'></TD><TD><h3><b>Warning</b></h3><TD></TD></TR><TR><TD></TD><TD>Unable to load the following URI: </TD></TR>
ru: <table border='0' cellpadding='3' style='table-layout:fixed' ><TR><TD><a href='stub'></a><IMG SRC = '%(base)s/%(prefix)sdialog-warning.png' style='border-style: none' alt='[Предупреждение]' title='Предупреждение' ALIGN='bottom'></TD><TD><h3><b>Предупреждение</b></h3><TD></TD></TR><TR><TD></TD><TD>Невозможно загрузить следующий идентификатор URI: </TD></TR>

source: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Suggestions:</b><br></TD></TR><TR><TD></TD><TD<TD>
ru: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Предложения:</b><br></TD></TR><TR><TD></TD><TD<TD>

source: <li style='padding-left:7px'>Return to <a href='pm?pm-action=internal&uri=%s'>Start Page</a></li></TD></TR>
ru: <li style='padding-left:7px'>Перейдите к <a href='pm?pm-action=internal&uri=%s'>начальной странице</a></li></TD></TR>

source: The <b>libbe</b> library was not found on your system.
ca: No s'ha trobat la biblioteca <b>libbe</b> en el vostre sistema.
ru: В системе не обнаружена библиотека <b>libbe</b>.

source: Rename BE
ca: Reanomenar entorn d'arranc
ru: Переименовать загрузочную среду

source: A boot environment (BE) contains the operating system image and updated packages. The system will boot into the new BE on restart.
ca: Un entorn d'arranc (BE) conté l'imatge del sistema operatiu i els paquets actualitzats. El sistema arrancarà el nou BE al reiniciar-se.
ru: В загрузочной среде (BE) содержится образ операционной системы и обновленные пакеты. Загрузка новой загрузочной среды выполняется после перезапуска.

source: Renaming BE, please wait...
ca: Reanomenant l'entorn d'arranc, espereu...
ru: Переименование загрузочной среды, подождите...

source: Update All
ca: Actualitzar tot
ru: Обновить все

source: Could not change the BE name to: %s The following name will be used instead: %s
ca: No es pot canviar el nom de l'entorn d'arranc a: %s Enlloc seu s'utilitzarà el següent nom: %s
ru: Невозможно изменить имя загрузочной среды на: %s Будет использовано следующее имя: %s

source: BE Name
ca: Nom entorn d'arranc
ru: Имя загрузочной среды

source: Could not restart the system. Please restart the system manually.
ca: No es pot reiniciar el sistema. Reinicieu manualment el sistema.
ru: Не удалось перезагрузить систему. Выполните перезагрузку вручную.

source: Restart Error
ca: Error reinici
ru: Ошибка перезагрузки

source: This name already exists.
ca: Aquest nom ja existeix.
ru: Имя уже существует

source: BE name contains invalid character.
ca: L'entorn d'arranc conté un caràcter no permès.
ru: Имя загрузочной среды включает недействительный символ.

source: <b>Installable Version:</b>
ca: <b>Versió instal·lable:</b>
ru: <b>Версия для установки:</b>

source: <b>Upgradeable Version:</b>
ca: <b>Versió actualitzable:</b>
ru: <b>Версия для обновления:</b>

source: Yes, %(version)s (Build %(build)s-%(branch)s)
ca: Si, %(version)s (Construcció %(build)s-%(branch)s)
ru: Да, %(version)s (сборка %(build)s-%(branch)s)

source: Installed package is up-to-date
ca: El paquet instal·lat està al dia
ru: Уже установлена последняя версия пакета

source: The latest version of %s cannot be installed.
ru: Невозможно установить последнюю версию %s.

source: Cannot upgrade to the latest version of %s.
ru: Не удалось выполнить обновление до последней версии %s.

source: Latest Version:
ca: Última versió:
ru: Последняя версия:

source: Add New Publisher
ca: Afegir publicador nou
ru: Добавить нового издателя

source: All specified publishers are already on the system.
ca: Tots els publicadors especificats ja estan en el sistema.
ru: Все указанные издатели уже в системе.

source: Install Package
ca: Instal·lar Paquet
ru: Установить пакет

source: %s (disabled)
ca: %s (deshabilitat)
ru: %s (отключено)

source: Click Proceed <b>only</b> if you trust this new publisher
ca: Cliqueu a Procedir <b>únicament</b> si confieu amb aquest nou publicador
ru: Нажмите кнопку "Продолжить" <b>только</b> если вы доверяете этому новому издателю

source: Publisher Error
ca: Error publicador
ru: Ошибка издателя

source: Web Installer Error
ca: Error instal·lador web
ru: Ошибка программы веб-установки

source: The following publisher is disabled:
ca: El següent publicador està deshabilitat:
ru: Следующий издатель отключен:

source: Clicking OK will enable the publisher before proceeding with install. On completion it will be disabled again.
ca: Clicant a Acceptar habilitareu el publicador abans de procedir amb l'instal·lació. En completar-se aquest tornarà a ser deshabilitat.
ru: Нажатие кнопки "OK" активирует издатель перед продолжением установки. При завершении установки он снова отключается.

source: Disabled Publisher
ca: Publicador deshabilitat
ru: Отключенный издатель

source: Failed to add %s.
ca: Error a l'afegir %s.
ru: Добавление %s не удалось.

source: unknown action type '%(type)s' in package '%(fmri)s' in action '%(action)s'
ca: tipus d'acció desconeguda '%(type)s' al paquet '%(fmri)s' a l'acció '%(action)s'
ru: неизвестный тип действия '%(type)s' в пакете '%(fmri)s' в действии '%(action)s'

source: unknown action type '%(type)s' in action '%(action)s'
ca: tipus d'acció desconeguda '%(type)s' a l'acció '%(action)s'
ru: неизвестный тип действия '%(type)s' в действии '%(action)s'

source: Malformed action in package '%(fmri)s' at position: %(pos)d: %(action)s %(marker)s
ca: Acció dolenta al paquet '%(fmri)s' a la posició: %(pos)d: %(action)s %(marker)s
ru: Недопустимое действие в пакете '%(fmri)s' в позиции: %(pos)d: %(action)s %(marker)s

source: Malformed action at position: %(pos)d: %(action)s %(marker)s
ca: Acció dolenta a la posició: %(pos)d: %(action)s %(marker)s
ru: Недопустимое действие в позиции: %(pos)d: %(action)s %(marker)s

source: invalid action in package %(fmri)s: %(action)s: %(error)s
ca: acció no vàlida al paquet %(fmri)s: %(action)s: %(error)s
ru: недопустимое действие в пакете %(fmri)s: %(action)s: %(error)s

source: invalid action, '%(action)s': %(error)s
ca: acció no vàlida, '%(action)s': %(error)s
ru: недопустимое действие, '%(action)s': %(error)s

source: The action '%(action)s' in package '%(fmri)s' has invalid attribute(s): %(act_errors)s
ru: Действие '%(action)s' в пакете '%(fmri)s' имеет недействительные атрибуты: %(act_errors)s

source: The action '%(action)s' has invalid attribute(s): %(act_errors)s
ru: Действие '%(action)s' имеет недействительные атрибуты: %(act_errors)s

source: required attribute '%s' was not provided.
ca: l'atribut obligatori '%s' no s'ha proporcionat.
ru: не предоставлен обязательный атрибут '%s'.

source: required attribute, '%s', was not provided.
ca: l'atribut obligatori, '%s', no s'ha proporcionat.
ru: не предоставлен обязательный атрибут '%s'.

source: Missing type attribute
ca: Falta l'atribut tipus
ru: Отсутствующий атрибут типа

source: Missing fmri attribute
ca: Falta l'atribut fmri
ru: Отсутствующий атрибут fmri

source: Unknown type (%s) in depend action
ca: Tipus desconegut (%s) en l'acció depèn
ru: Неизвестный тип (%s) в действии depend

source: %(dep_type)s dependency %(dep_val)s is downrev (%(inst_ver)s)
ru: %(dep_type)s зависимость %(dep_val)s: более ранняя версия (%(inst_ver)s)

source: %(dep_type)s dependency %(dep_val)s is uprev (%(inst_ver)s)
ru: %(dep_type)s зависимость %(dep_val)s: более поздняя версия (%(inst_ver)s)

source: %s dependency on an obsolete package (%s);this package must be uninstalled manually
ru: %s зависимость от устаревшего пакета (%s); этот пакет необходимо удалить вручную

source: Required dependency %s is not installed
ru: Необходимая зависимость %s не установлена

source: Empty path attribute
ca: Atribut ruta buit
ru: Пустой атрибут пути

source: Unable to create directory %s; it has been replaced with a link. To continue, please remove the link or restore the directory to its original location and try again.
ru: Невозможно создать каталог %s; он заменен ссылкой. Для продолжения удалите ссылку или поместите каталог в исходноеместоположение и повторите попытку.

source: Unable to remove %s; it is in use as a mountpoint. To continue, please unmount the filesystem at the target location and try again.
ru: Невозможно удалить %s; он используется в качестве точки монтирования. Для продолженияразмонтируйте файловую систему в целевом местоположении и повторите попытку.

source: Unable to remove %s; it is in use by the system, another process, or as a mountpoint.
ru: Невозможно удалить %s; он используется системой, другим процессом или в качестве точки монтирования.

source: etc/name_to_major: more than one entry for '%s' is present
ru: etc/name_to_major: для '%s' существует более одной записи

source: etc/name_to_major: '%s' entry not present
ru: etc/name_to_major: запись '%s' отсутствует

source: extra alias '%s' found in etc/driver_aliases
ru: в etc/driver_aliases найден дополнительный псевдоним '%s'

source: alias '%s' missing from etc/driver_aliases
ru: псевдоним '%s' отсутствует в etc/driver_aliases

source: extra class '%s' found in etc/driver_classes
ru: в etc/driver_classes найден дополнительный класс '%s'

source: class '%s' missing from etc/driver_classes
ru: класс '%s' отсутствует в etc/driver_classes

source: extra minor node permission '%s' found in etc/minor_perm
ru: в etc/minor_perm найдено дополнительное разрешение младшего узла '%s'

source: minor node permission '%s' missing from etc/minor_perm
ru: разрешение младшего узла '%s' отсутствует в etc/minor_perm

source: extra device policy '%s' found in etc/security/device_policy
ru: в etc/security/device_policy найдена дополнительная политика устройства '%s'

source: device policy '%s' missing from etc/security/device_policy
ru: политика устройства '%s' отсутствует в etc/security/device_policy

source: device privilege '%s' missing from etc/security/extra_privs
ru: полномочия устройства '%s' отсутствуют в etc/security/extra_privs

source: Timestamp: %(found)s should be %(expected)s
ru: Временная метка: %(found)s должно быть %(expected)s

source: Size: %(found)d bytes should be %(expected)d
ru: Размер: %(found)d байтов должно быть %(expected)d

source: Elfhash: %(found)s should be %(expected)s
ru: Elfhash: %(found)s должно быть %(expected)s

source: Hash: %(found)s should be %(expected)s
ru: Хэш: %(found)s должно быть %(expected)s

source: Unexpected Error: %s
ru: Непредвиденная ошибка: %s

source: Unexpected Exception: %s
ru: Непредвиденное исключение: %s

source: No such file: '%s'.
ca: No tal fitxer: '%s'.
ru: Такой файл отсутствует: '%s'.

source: '%s' is not a file.
ca: '%s' no és un fitxer.
ru: '%s' не является файлом.

source: Unable to create %(path)s; a parent directory %(p)s has been replaced with a file or link. Please restore the parent directory and try again.
ru: Невозможно создать %(path)s; родительский каталог %(p)s заменен файлом или ссылкой. Восстановите родительский каталог и повторите попытку.

source: '%s' is not a valid mode; value must be of the form '644', '0644', or '04755'.
ru: '%s' не является действительным режимом; значение должно иметь форму '644', '0644' или '04755'.

source: owner is required
ru: требуется владелец

source: group is required
ru: требуется группа

source: '%(path)s' cannot be installed; the owner '%(owner)s' was removed by '%(src_fmri)s'.
ru: '%(path)s' невозможно установить; владелец '%(owner)s' удален посредством '%(src_fmri)s'.

source: '%(path)s' cannot be installed; '%(owner)s' is an unknown or invalid user.
ru: '%(path)s' невозможно установить; '%(owner)s' является неизвестным или недействительным пользователем.

source: '%(path)s' cannot be installed; the group '%(group)s' was removed by '%(src_fmri)s'.
ru: '%(path)s' невозможно установить; группа '%(group)s' удалена посредством '%(src_fmri)s'.

source: '%(path)s' cannot be installed; '%(group)s' is an unknown or invalid group.
ru: '%(path)s' невозможно установить; '%(group)s' является неизвестной или недействительной группой.

source: Owner: %s is unknown
ru: Владелец: %s неизвестен

source: Group: %s is unknown
ru: Группа: %s неизвестна

source: Missing: %s does not exist
ru: Отсутствие: %s отсутствует

source: File Type: '%(found)s' should be '%(expected)s'
ru: Тип файла: '%(found)s' должно быть '%(expected)s'

source: Owner: '%(found_name)s (%(found_id)d)' should be '%(expected_name)s (%(expected_id)d)'
ru: Владелец: '%(found_name)s (%(found_id)d)' должно быть '%(expected_name)s (%(expected_id)d)'

source: Group: '%(found_name)s (%(found_id)s)' should be '%(expected_name)s (%(expected_id)s)'
ru: Группа: '%(found_name)s (%(found_id)s)' должно быть '%(expected_name)s (%(expected_id)s)'

source: Mode: 0%(found).3o should be 0%(expected).3o
ru: Режим: 0%(found).3o должно быть 0%(expected).3o

source: Cannot install '%(final_path)s'; parent directory %(parent_dir)s is a link to %(parent_target)s. To continue, move the directory to its original location and try again.
ru: Невозможно установить '%(final_path)s'; родительский каталог %(parent_dir)s является ссылкой на %(parent_target)s. Для продолжения переместите каталог в исходное местоположение и повторите попытку.

source: %(entry)s: '%(found)s' should be '%(expected)s'
ru: %(entry)s: '%(found)s' должно быть '%(expected)s'

source: Unable to create hard link %(path)s; target %(target)s is missing.
ru: Невозможно создать жесткую ссылку %(path)s; целевой элемент %(target)s отсутствует.

source: Target '%s' does not exist
ru: Цель '%s' отсутствует

source: Broken: Path and Target (%s) inodes not the same
ru: Неисправно: путь и цель (%s) inodes не совпадают

source: Missing directory var/sadm/pkg/%s
ru: Отсутствует каталог var/sadm/pkg/%s

source: Missing file var/sadm/pkg/%s/pkginfo
ru: Отсутствует файл var/sadm/pkg/%s/pkginfo

source: License file %s does not exist.
ca: El fitxer de llicència %s no existeix.
ru: Файл лицензии %s не существует.

source: Hash: '%(found)s' should be '%(expected)s'
ca: Hash: '%(found)s' hauria de ser '%(expected)s'
ru: Хэш: '%(found)s' должен быть '%(expected)s'

source: Target: '%(found)s' should be '%(expected)s'
ru: Цель: '%(found)s' должно быть '%(expected)s'

source: The signature value did not match the expected value. action:%s
ru: Значение подписи не соответствует ожидаемому. действие:%s

source: The signature value did not match the expected value. Res: %s
ru: Значение подписи не соответствует ожидаемому. Res: %s

source: %s was expected to be a RSA key but could not be read correctly.
ru: %s должен был быть ключом RSA, однако его не удалось корректно считать.

source: Unknown info_needed type: %s
ca: Tipus info_needed desconegut: %s
ru: Неизвестный тип info_needed: %s

source: Actuators for %(attr)s will not be run for %(fmri)s.
ru: Активаторы для %(attr)s не будут выполняться для %(fmri)s.

source: The image cannot be modified as it is currently in use by another package client: %(pid_name)s on %(host)s, pid %(pid)s.
ru: Образ невозможно изменить, поскольку он в настоящее время используется другим клиентом пакета: %(pid_name)s на %(host)s, PID %(pid)s.

source: The image cannot be modified as it is currently in use by another package client: %(pid_name)s on an unknown host, pid %(pid)s.
ru: Образ невозможно изменить, поскольку в настоящее время он используется другим клиентом пакета: %(pid_name)s на неизвестном сервере, PID %(pid)s.

source: The image cannot be modified as it is currently in use by another package client: pid %(pid)s on %(host)s.
ru: Образ невозможно изменить, поскольку в настоящее время он используется другим клиентом пакета: PID %(pid)s на %(host)s.

source: The requested operation cannot be completed due to invalid package metadata. Details follow: %s
ru: Невозможно завершить запрашиваемую операцию, поскольку метаданные пакета недействительны. Подробные данные: %s

source: Package: %s
ca: Paquet: %s
ru: Пакет: %s

source: Invalid package state change attempted '%(states)s' for package '%(fmri)s'.
ca: Intent no vàlid de canvi d'estat '%(states)s' pel paquet '%(fmri)s'.
ru: Недопустимая попытка изменения состояния '%(states)s' для пакета '%(fmri)s'.

source: Could not operate on %s because of insufficient permissions. Please try the command again using pfexec or otherwise increase your privileges.
ca: No es pot operar a %s a causa de permisos insuficients. Si us plau torneu a provar la comanda utilitzant pfexec o en un altre cas incrementeu els vostres permisos.
ru: Работа с %s невозможна из-за недостаточных полномочий. Повторите попытку вызова команды с помощьюpfexec или повысьте уровень полномочий другим способом.

source: Could not complete the operation because of insufficient permissions. Please try the command again using pfexec or otherwise increase your privileges.
ca: No es pot completar l'operació a causa de permisos insuficients. Si us plau proveu de nou la comanda utilitzant pfexec o en qualsevol altre cas incrementant els vostres privilegis.
ru: Выполнение действия невозможна из-за недостаточных полномочий. Повторите попытку вызова команды с помощью pfexec или повысьте уровень полномочий другим способом.

source: Could not operate on %s because the file is in use. Please stop using the file and try the operation again.
ca: No es pot operar a %s ja que el fitxer està en ús. Si us plau pareu d'utilitzar el fitxer i intenteu de nou l'operació.
ru: Работа с %s невозможна, поскольку файл используется. Прекратите использование этого файла и повторите попытку выполнения действия.

source: Could not complete the operation on %s: read-only filesystem.
ru: Не удалось выполнить операцию в %s: файловая система доступна только для чтения.

source: The following pattern(s) did not match any packages in the current catalog. Try relaxing the pattern, refreshing and/or examining the catalogs:
ca: Els següents patrons no coincideixen amb cap paquet del catàleg actual. Intenteu un patró més senzill, refrescant i/o examinant els catàlegs:
ru: Следующие шаблоны не подходят ни к одному из пакетов в текущем каталоге. Примените менее узкие критерии поиска, обновите и/или просмотрите каталоги:

source: '%s' matches multiple packages
ca: '%s' coincideix amb múltiples paquets
ru: '%s' соответствует нескольким пакетам

source: '%s' matches no installed packages
ca: '%s' no coincideix amb els paquets instal·lats
ru: '%s' не соответствует ни одному из установленных пакетов

source: '%s' is an illegal fmri
ca: '%s' és un fmri il·legal
ru: '%s' является недопустимым fmri

source: '%s' supports the following architectures: %s
ca: '%s' suporta les següents arquitectures: %s
ru: '%s' поддерживает следующие архитектуры: %s

source: Image architecture is defined as: %s
ca: La imatge de l'arquitectura està definida com: %s
ru: Архитектура образа определена как: %s

source: '%(p)s' depends on obsolete package '%(op)s'
ca: '%(p)s' depèn del paquet obsolet '%(op)s'
ru: '%(p)s' зависит от устаревшего пакета '%(op)s'

source: The following different patterns specify thesame package(s):
ca: Els següents patrons diferents especifiquen el mateix paquet/paquets:
ru: Следующими различными шаблонами указывается тот же пакет (пакеты):

source: Package %(pkg)s is missing a dependency: %(dep)s
ru: В пакете %(pkg)s отсутствует зависимость: %(dep)s

source: Requested operation failed for action %(action)s: %(details)s
ru: Не удалось выполнить запрашиваемую операцию для действия %(action)s: %(details)s

source: Requested operation failed for package %(fmri)s: %(details)s
ru: Не удалось выполнить запрашиваемую операцию для пакета %(fmri)s: %(details)s

source: The FMRI '%s' does not contain publisher information and cannot be used for catalog operations.
ca: El FMRI '%s' no conté informació de publicador i no pot ser utilitzat per a operacions catàleg.
ru: FMRI '%s' не включает в себя информацию об издателе и не может использоваться для операций каталога.

source: Catalog meta_root '%(root)s' is invalid; unable to complete operation: '%(op)s'.
ca: El catàleg meta_root '%(root)s' no és vàlid; no es pot completar l'operació: '%(op)s'.
ru: Каталог meta_root '%(root)s' является недопустимым; невозможно завершить операцию: '%(op)s'.

source: %(fname)s: expected mode: %(emode)s, found mode: %(fmode)s
ca: %(fname)s: mode esperat: %(emode)s, mode trobat: %(fmode)s
ru: %(fname)s: ожидаемый режим: %(emode)s, найденный режим: %(fmode)s

source: The signature data for the '%s' catalog file is not valid.
ca: Les dades de signatura pel fitxer de catàleg '%s' no són vàlides.
ru: Данные подписи для этого файла каталога '%s' являются недопустимыми.

source: Unable to determine the updates needed for the current catalog using the provided catalog update data in '%s'.
ca: No es poden determinar les operacions necessàries per l'actualització del catàleg actual utilitzant les dades proporcionades d'actualització de catàleg a '%s'.
ru: Невозможно определить обновления, необходимые для текущего каталога, с помощью предоставленных данных обновления каталога в '%s'.

source: Unable to perform '%(op)s' operation for catalog %(name)s; completion would result in a duplicate entry for package '%(fmri)s'.
ca: No es pot realitzar l'operació '%(op)s' pel catàleg %(name)s; la completació podria produir una entrada duplicada pel paquet '%(fmri)s'.
ru: Невозможно выполнить операцию '%(op)s' для каталога %(name)s; выполнение приведет к повторной записи для пакета '%(fmri)s'.

source: Catalog file '%s' is invalid.
ca: El fitxer de catàleg '%s' no és vàlid.
ru: Недопустимый файл каталога '%s'.

source: The content of the catalog for publisher '%s' doesn't match the catalog's attributes. This is likely the result of a mix of older and newer catalog files being provided for the publisher.
ru: Содержимое каталога для издателя '%s' не соответствует атрибутам каталога. Возможно, это вызвано предоставлением для издателя сочетания старых и новых файлов.
