Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: The Boot Environment %(name)s failed to be updated. A snapshot was taken before the failed attempt and is mounted here %(clone_dir)s. Use 'beadm unmount %(clone_name)s' and then 'beadm activate %(clone_name)s' if you wish to boot to this BE.
ca: L'Entorn d'arranc %(name)s ha fallat al ser actualitzat. S'ha pres una instantània abans de l'intent fallit i està muntat a %(clone_dir)s. Utilitzeu 'beadm unmount %(clone_name)s' i després 'beadm activate %(clone_name)s' si desitgeu arrancar aquest entorn d'arranc.
ru: Сбой обновления загрузочной среды %(name)s. До сбойной попытки был сделан снимок, он смонтирован по адресу %(clone_dir)s. Если необходимо выполнить загрузку в данную загрузочную среду, выполните команду 'beadm unmount %(clone_name)s', а затем 'beadm activate %(clone_name)s'.

source: The Boot Environment %s failed to be updated. A snapshot was taken before the failed attempt and has been restored so no changes have been made to %s.
ca: S'ha produït un error a l'actualitzar l'entorn d'arranc %s. s'ha pres una instantània abans de l'intent fallit i ha estat reutaurat, doncs no s'han fet canvis a %s.
ru: Сбой обновления загрузочной среды %s. До сбойной попытки был сделан и сохранен снимок, поэтому в %s никаких изменений не внесено.

source: The trust anchor for the image were expected to be found in %s, but that is not a directory. Please set the image property 'trust-anchor-directory' to the correct path.
ru: Доверительная привязка образа должна была находиться в %s, однако это не каталог. Установите для свойства 'trust-anchor-directory' корректный путь.

source: Cannot add a value to a single valued property. The property name is: %(name)s and the current value is: %(value)s
ru: Невозможно добавить значение для свойства с одним значением. Имя свойства – %(name)s, а текущее значение – %(value)s

source: Cannot remove a value from a single valued property, unset must be used. The property name is: %(name)s and the current value is: %(value)s
ru: Невозможно удалить значение из свойства с одним значением, используйте функцию возврата в исходное состояние. Имя свойства – %(name)s, а текущее значение – %(value)s

source: Cannot remove the value %(value)s from the property %(name)s because the value is not in the property's list.
ru: Невозможно удалить значение %(value)s из свойства %(name)s, поскольку это значение отсутствует в списке свойств.

source: Package State Update Phase
ru: Фаза обновления состояния пакета

source: Package Cache Update Phase
ru: Фаза обновления кэша пакета

source: Image State Update Phase
ru: Фаза обновления состояния образа

source: %(val)s is not a valid value for this property: %(prop)s
ru: %(val)s не является действительным значением для свойства %(prop)s

source: The %s signature-policy takes no argument.
ru: %s signature-policy не принимает аргумент.

source: %(name)s is not a multivalued property. Values are: %(value)r
ru: %(name)s не является многозначным свойством. Значения: %(value)r

source: Removal Phase
ca: Etapa d'eliminació
ru: Фаза удаления

source: Install Phase
ca: Etapa d'instal·lació
ru: Фаза установки

source: Update Phase
ca: Etapa d'actualització
ru: Фаза обновления

source: Index Phase
ca: Etapa d'indexació
ru: Фаза индексации

source: This version is excluded by installed incorporation %s
ca: Aquesta versió està exclosa per l'incorporació instal·lada %s
ru: Эта версия исключена установленным объединением %s

source: This version is excluded by freeze %s
ca: Aquesta versió està exclosa per congelament %s
ru: Эта версия исключена блокировкой %s

source: No matching version of %s can be installed:
ca: Cap versió corresponent a %s pot ser instal·lada:
ru: Невозможно установить подходящую версию %s:

source: No version of %s can be installed:
ca: Cap versió de %s pot ser instal·lada:
ru: Невозможно установить какую-либо версию %s:

source: Package(s) are installed that depend on obsolete empty packages.
ru: Установлены пакеты, зависящие от устаревших пустых пакетов.

source: These package(s) must be uninstalled to continue: %s
ru: Эти пакеты необходимо удалить для продолжения: %s

source: The pkg command to perform needed uninstall is pkg uninstall %s
ru: Выполняемая команда pkg, для которой требуется удаление: pkg uninstall %s

source: Publisher differs from installed or specified version
ru: Издатель не соответствует установленной или указанной версии

source: Publisher is lower ranked
ca: El publicador te un rang més baix
ru: Ранг издателя более низкий

source: Newer version %s is already installed
ca: La versió més nova %s ja està instal·lada
ru: Уже установлена более новая версия %s

source: Package doesn't support image variant %s
ca: El paquet no suporta la variant de l'arquitectura %s
ru: Пакет не поддерживает вариант образа %s

source: Download: %s ...
ru: Загрузка: %s ...

source: Retrieving catalog '%s'...
ca: Recuperant catàleg '%s'...
ru: Извлечение каталога '%s'...

source: Refreshing catalog %(current)d/%(total)d %(publisher)s
ru: Обновление каталога %(current)d/%(total)d %(publisher)s

source: Creating Plan
ru: Создание плана

source: Creating Plan %c
ru: Создание плана %c

source: ACTIONS
ru: ДЕЙСТВИЯ

source: Optimizing Index...
ru: Оптимизирующий индекс...

source: Unable to retrieve package data for publisher '%(prefix)s' from one of the following origin(s): %(origins)s The catalog retrieved from one of the origin(s) listed above only contains package data for: %(pubs)s.
ca: No es poden recuperar les dades del paquet des del publicador'%(prefix)s' des d'un dels següents orígens: %(origins)s Els catàlegs recuperats des d'un dels orígens llistats a continuació únicament contenen dades del paquet per: %(pubs)s.
ru: Невозможно получить данные пакета для издателя '%(prefix)s' из одного из следующих источников: %(origins)s Каталог, полученный из одного из источников, перечисленных выше, содержит данные пакета только для : %(pubs)s.

source: This is either a result of invalid origin information being provided for publisher '%s', or because the wrong publisher name was provided when this publisher was added.
ca: Això pot ser degut com a resultat d'una informació incorrecta de l'origen pel publicador '%s', o perque el nom incorrecte del publicador va ser proporcionat quant aquest publicador va ser afegit.
ru: Это может быть вызвано либо неверными данными пакета ,указанными для издателя '%s', либо неверным именем издателя, предоставленнным при добавлении издателя.

source: To resolve this issue, correct the origin information provided for publisher '%(prefix)s' using the pkg set-publisher subcommand, or re-add the publisher using the correct name and remove the '%(prefix)s' publisher.
ca: Per resoldre aquesta incidència, corregiu l'informació proporcionada pel publicador '%(prefix)s' mitjançant la subcomanda pkg set-publisher, o torneu a afegir el publicador utilitzant el nom correcte i elimineu el '%(prefix)s' del publicador.
ru: Для решения этого вопроса необходимо исправить информацию об источнике, приведенной для издателя '%(prefix)s' с помощью подкоманды pkg set-publisher , либо повторно добавить издателя с указанием правильного имени и удалить издателя '%(prefix)s'.

source: To re-add this publisher with the correct name, execute the following commands as a privileged user: pkg set-publisher -P -g %(origin)s %(pub)s pkg unset-publisher %(prefix)s
ca: Per tornar a afegir aquest publicador amb el nom correcte, executeu les següents comandes com usuari amb privilegis: pkg set-publisher -P -g %(origin)s %(pub)s pkg unset-publisher %(prefix)s
ru: Для повторного добавления этого издателя с правильным именем выполните следующие команды от имени привилегированного пользователя: pkg set-publisher -P -g %(origin)s %(pub)s pkg unset-publisher %(prefix)s

source: Afterwards, the old publisher should be removed by executing the following command as a privileged user: pkg unset-publisher %s
ca: Posteriorment, l'antic publicador ha de ser eliminat mitjançant la utilització de la següent comanda com usuari amb privilegis: pkg unset-publisher %s
ru: После этого старого издателя следует удалить следующей командой от имени привилегированного пользователя: pkg unset-publisher %s

source: The file with hash %s was expected to be a PEM certificate but it could not be read.
ru: Возможно, файл с хэшем %s является сертификатом PEM, но его не удалось прочитать.

source: Cannot remove a value from the property %(name)s because the property does not exist.
ru: Невозможно удалить значение свойства %(name)s, поскольку данное свойство отсутствует.

source: Cannot remove a value from a single valued property, unset must be used. The property name is '%(name)s' and the current value is '%(value)s'
ru: Невозможно удалить значение свойства с одним значением, используйте функцию возврата в исходное состояние. Имя свойства – '%(name)s', а текущее значение – '%(value)s'

source: The CRL file %s is not in a recognized format.
ru: Файл CRL %s имеет нераспознанный формат.

source: %(val)s is not a valid value for this property:%(prop)s
ru: %(val)s не является действительным значением для свойства %(prop)s

source: The configuration file for the repository is invalid or incomplete: %s
ru: Файл настройки для хранилища является недействительным или неполным: %s

source: Property name '%s' is not valid. Section names may not contain: tabs, newlines, carriage returns, form feeds, vertical tabs, slashes, backslashes, or non-ASCII characters.
ru: Имя свойства '%s' недействительно. Имена свойств не должны содержать табуляцию, разрыв строки, возврат каретки, перевод страницы, вертикальную табуляцию, косую черту, обратную косую черту или символы, не включенные в стандарт ASCII.

source: Invalid value '%(val)s' for %(section)s.%(prop)s.
ru: Недействительное значение '%(val)s' для %(section)s.%(prop)s.

source: Invalid value '%(val)s' for %(prop)s.
ru: Недействительное значение '%(val)s' для %(prop)s.

source: Section name '%s' is not valid. Section names may not contain: tabs, newlines, carriage returns, form feeds, vertical tabs, slashes, backslashes, or non-ASCII characters.
ru: Имя раздела '%s' недействительно. Имена раздела не должны содержать табуляцию, разрыв строки, возврат каретки, перевод страницы, вертикальную табуляцию, косую черту, обратную косую черту или символы, не включенные в стандарт ASCII.

source: Unknown property %s.%s
ru: Неизвестное свойство %s.%s

source: Unknown property %s
ru: Неизвестное свойство %s

source: Unknown property section: %s.
ru: Неизвестный раздел свойства: %s.

source: Property name '%(name)s' is not valid. Property names may not contain: tabs, newlines, carriage returns, form feeds, vertical tabs, slashes, or backslashes and must also match the regular expression: %(exp)s
ru: Имя свойства '%(name)s' недействительно. Имена свойств не должны содержать табуляцию, разрыв строки, возврат каретки, перевод страницы, вертикальную табуляцию, косую черту или обратную косую черту, а также должны соответствовать регулярному выражению %(exp)s

source: Section name '%(name)s' is not valid. Section names may not contain: tabs, newlines, carriage returns, form feeds, vertical tabs, slashes, or backslashes and must also match the regular expression: %(exp)s
ru: Имя раздела '%(name)s' недействительно. Имена разделов не должны содержать табуляцию, разрыв строки, возврат каретки, перевод страницы, вертикальную табуляцию, косую черту или обратную косую черту, а также должны соответствовать регулярному выражению %(exp)s

source: Unable to read configuration data for SMF FMRI '%(fmri)s': %(errmsg)s
ru: Невозможно считать данные настройки для SMF FMRI '%(fmri)s': %(errmsg)s

source: Unable to write configuration data for SMF FMRI '%(fmri)s': %(errmsg)s
ru: Не удалось записать данные настройки для SMF FMRI '%(fmri)s': %(errmsg)s

source: The FileManager cannot %(cre)s %(ent)s because it is configured read-only.
ca: El gestor de fitxers no pot %(cre)s %(ent)s perquè aquest està configurat com només-lectura.
ru: Диспетчер файлов невозможно %(cre)s %(ent)s, так как он сконфигурирован только для чтения.

source: FileManager was unable to create %s or the directories containing it.
ca: El gestor de fitxers va ser incapaç de crear %s o als directoris continguts.
ru: Диспетчеру файлов не удалось создать %s или содержащие этот элемент каталоги.

source: The following paths were found but cannot be accounted for by any of the known layouts: %s
ca: Es van trobar les següents rutes però no poden ser responsabilitzades per cap dels plantejaments coneguts: %s
ru: Найдены следующие пути, которые, однако, невозможно использовать для любой из известных структур: %s

source: Couldn't find %s
ca: No es pot trobar %s
ru: Не удалось найти %s

source: Subclasses of Dependency must implement dep_key. Current class is %s
ca: Les subclasses de dependència han d'implementar dep_key. Classe actual en %s
ru: Подклассы зависимости должны реализовывать dep_key. Текущий класс – %s

source: %s had this elf error:%s
ca: %s tenia aquest error elf:%s
ru: %s имеет следующую ошибку elf:%s

source: %(pp)s (which will be installed at %(ip)s) had this token, %(tok)s, in its run path: %(rp)s. It is not currently possible to automatically expand this token. Please specify its value on the command line.
ca: %(pp)s (el qual serà instal·lat a %(ip)s) té aquesta senyal, %(tok)s, en la seva ruta d'execució: %(rp)s. Actualment no és possible aquesta senyal. Especifiqueu el seu valor des de la línia de comandes.
ru: %(pp)s (которые устанавливаются в %(ip)s) содержат маркер %(tok)s в пути выполнения: %(rp)s. В настоящий момент автоматическое раскрытие этого маркера невозможно. Укажите его значение в командной строке.

source: Could not find the file for %(name)s imported in %(localpath)s
ca: No es pot trobar el fitxer %(name)s importat en %(localpath)s
ru: Не удалось найти файл для %(name)s, импортированного в %(localpath)s

source: The file to be installed at %(ip)s declares a python version of %(decl_v)s. However, the path suggests that the version should be %(inst_v)s. The text of the file can be found at %(lp)s
ru: Устанавливаемый файл %(ip)s объявляет версию Python %(decl_v)s. Однако путь указывает на версию %(inst_v)s. Текст файла находится в %(lp)s

source: The command %(cmd)s exited with return code %(rc)s and this message: %(err)s
ru: Команда %(cmd)s выполнила выход с кодом возврата %(rc)s и сообщением: %(err)s

source: The command %(cmd)s produced the following lines which cannot be understood: %(lines)s
ru: В результате выполнения команды %(cmd)s были созданы следующие строки, которые невозможно распознать: %(lines)s

source: The file to be installed in %(ip)s does not specify a specific version of python either in its installed path nor in its text. Such a file cannot be analyzed for dependencies since the version of python it will be used with is unknown. The text of the file is here: %(lp)s.
ru: В пути или тексте устанавливаемого файла %(ip)s не указана определенная версия Python. Такой файл невозможнопроанализировать относительно зависимостей, поскольку версия Python, с которой используется этот файл, неизвестна. В файле представлен следующий текст: %(lp)s.

source: %(lp)s says it should be run with '%(bin)s' which is a relative path.
ru: В тексте %(lp)s сообщается о необходимости выполнения файла с использованием '%(bin)s', который является относительным путем.

source: more than one set of dependencies found: %s
ru: найдено несколько наборов зависимостей: %s

source: FMRI is delivered by multiple files: %s
ru: FMRI поставляется в нескольких файлах: %s

source: %s actions cannot deliver SMF manifests
ru: в результате выполнения действий %s невозможно поставить манифесты SMF

source: Unable to parse SMF manifest %s
ru: Невозможно выполнить синтаксический анализ манифеста SMF %s

source: Problem resolving %(fmri)s: %(err)s
ru: Решение проблемы %(fmri)s: %(err)s

source: Problem determining dependencies for %(fmri)s:%(err)s
ru: Зависимости, определяющие проблему для %(fmri)s:%(err)s

source: Unable to generate SMF dependency on %(dep_fmri)s declared in %(proto_file)s by%(fmri)s: %(err)s
ru: Невозможно создать зависимость SMF для %(dep_fmri)s, объявленного в %(proto_file)s by%(fmri)s: %(err)s

source: FMRI '%s' is missing version information.
ca: Al FMRI '%s' hi falta l'informació de versió.
ru: Для FMRI '%s' необходима информация о версии.

source: Reading Existing Index
ca: Llegint índex existent
ru: Считывание существующего индекса

source: Indexing Packages
ca: Indexant paquets
ru: Индексирование пакетов

source: Error parsing config value for %(key)s: %(err)s
ru: Значение настройки синтаксического анализа ошибки для %(key)s: %(err)s

source: Unable to create lint image: %s
ru: Невозможно создать образ lint: %s

source: Unable to create reference image: %s
ru: Невозможно создать ссылочный образ: %s

source: Unable to access any pkglint images under %s
ru: Невозможно получить доступ к образам pkglint в %s

source: %s does not subclass a known Checker subclass intended for use by pkglint extensions
ru: %s не выполняет деление на подклассы известного подкласса Checker, предназначенного для использования в расширениях pkglint

source: Total number of checks found: %s
ru: Общее число найденных проверок: %s

source: No packages matched %s
ru: Отсутствуют пакеты, соответствующие %s

source: invalid pkg name
ru: недействительное имя pkg

source: get_fmri(pattern) %(pattern)s matched %(count)s packages: %(pkgs)s
ru: get_fmri(pattern) %(pattern)s соответствует пакетам %(count)s: %(pkgs)s

source: Unable to get image at %(dir)s: %(reason)s
ru: Невозможно получить доступ к образу в %(dir)s: %(reason)s

source: pkglint only supports a single publisher per image.
ru: pkglint поддерживает только одного издателя на образ.

source: Creating image at %s
ru: Создание образа в %s

source: %(value)s is not a valid level
ru: %(value)s не является действительным уровнем

source: Username %(name)s in %(pkg)s > 8 chars
ru: Имя пользователя %(name)s в %(pkg)s превышает 8 символов

source: Username %(name)s in %(pkg)s does not have an initial lower-case alphabetical character
ru: Начальный символ имени пользователя %(name)s в %(pkg)s не имеет алфавитный формат

source: Username %(name)s in %(pkg)s is invalid - see passwd(4)
ru: Имя пользователя %(name)s в %(pkg)s является недействительным - см. passwd(4)

source: Missing key %(key)s from %(pkg)s
ru: В %(pkg)s отсутствует ключ %(key)s

source: Missing key pkg.summary from %s
ru: В %s отсутствует ключ pkg.summary

source: path %(path)s is reference-counted but has different attributes across %(count)s duplicates: %(suspects)s
ru: путь %(path)s содержит количество ссылок, но имеет различные атрибуты в дубликатах %(count)s: %(suspects)s

source: %(attr_name)s %(name)s is a duplicate delivered by %(pkgs)s declaring no variants
ru: %(attr_name)s %(name)s представляет собой дубликат, поставляемый %(pkgs)s без объявления вариантов

source: %(attr_name)s %(name)s is a duplicate delivered by %(pkgs)s declaring overlapping variants %(vars)s
ru: %(attr_name)s %(name)s представляет собой дубликат, поставляемый %(pkgs)s, который объявляет перекрещивающиеся варианты %(vars)s

source: path %(path)s is delivered by multiple action types across %(pkgs)s
ru: путь %(path)s поставляется различными типами действий посредством %(pkgs)s

source: underscore in attribute name %(key)s in %(fmri)s
ru: подчеркивание в имени атрибута %(key)s в %(fmri)s

source: directory action for %(dir)s delivered in %(pkg)s with mode=%(mode)s that has no executable bits
ru: действие каталога для %(dir)s, поставляемое в %(pkg)s с mode=%(mode)s без исполняемых битов

source: unusual mode %(mode)s in %(path)s delivered by %(pkg)s
ru: необычный режим %(mode)s в %(path)s, поставляемый в %(pkg)s

source: %(attr)s missing from legacy action in %(pkg)s
ru: в устаревшем действии в %(pkg)s отсутствует %(attr)s

source: ancestor %(ancestor)s did not declare a dependency on %(pkg)s
ru: предшествующий %(ancestor)s не объявляет зависимость для %(pkg)s

source: legacy action in %s does not contain a REV= string
ru: устаревшее действие в %s не содержит строку REV=

source: unknown action found in %s
ru: в %s найдено неизвестное действие

source: license action in %(pkg)s has a path attribute, %(path)s
ru: действие лицензии в %(pkg)s имеет атрибут пути %(path)s

source: dependency in %(pkg)s on obsolete pkg %(obs)s
ru: зависимость %(pkg)s для устаревшего pkg %(obs)s

source: Seeding reference manifest duplicates dictionaries.
ru: Добавление манифеста reference вызывает дублирование словарей.

source: Seeding lint manifest duplicates dictionaries.
ru: Добавление манифеста lint вызывает дублирование словарей.

source: obsolete package %(pkg)s has %(key)s attribute
ru: устаревший пакет %(pkg)s содержит атрибут %(key)s

source: obsolete package %s contains actions other than set or signature actions
ru: устаревший пакет %s содержит действия, отличные от действий установки и подписи

source: renamed package %s contains actions other than set, depend or signature actions
ru: переименованный пакет %s содержит действия, отличные от действий установки, зависимости или подписи

source: variant(s) %(vars)s not defined by %(pkg)s
ru: variant(s) %(vars)s не определены в %(pkg)s

source: variant(s) %(vars)s not in list of known values for variants in %(pkg)s
ru: variant(s) %(vars)s отсутствует в списке известных значений вариантов в %(pkg)s

source: variant.arch not declared in %s
ru: variant.arch не объявлен в %s

source: last name component %(name)s in package name clashes across %(pkgs)s
ru: последний компонент имени %(name)s в имени пакета вызывает конфликт в %(pkgs)s

source: duplicate depend actions in %(pkg)s %(actions)s
ru: дублирование действий depend в %(pkg)s %(actions)s

source: no fmri attribute in depend action in %s
ru: отсутствует атрибут FMRI в действии depend в %s

source: duplicate set actions on %(names)s in %(pkg)s
ru: дублирование действий set для %(names)s в %(pkg)s

source: %(fp)s contains an action which is missing the expected attribute: %(at)s. The action is:%(act)s
ca: %(fp)s conté una acció la qual li falta un atribut esperat: %(at)s. L'acció és:%(act)s
ru: %(fp)s содержит действие, в котором отсутствует ожидаемый атрибут: %(at)s. Действие:%(act)s

source: Attribute value '%s' not 'true' or 'false'
ca: El valor d'atribut '%s' no és 'true' o 'false'
ru: Значение атрибута '%s' не 'true' или 'false'

source: The file dependency %s has paths which resolve to multiple packages. The actions are as follows: %s
ca: La dependència de fitxer %s té rutes les quals resolen diversos paquets. Les accions són com les següents: %s
ru: Зависимость файла %s содержит пути, которые указывают на несколько пакетов. Требуется выполнить следующие действия: %s

source: The file dependency %s depends on a path delivered by multiple packages. Those packages are:%s
ca: La dependència de fitxer %s depèn de la ruta entregada per diversos paquets. Aquests paquets són:%s
ru: Зависимость файла %s зависит от пути, предоставляемого несколькими пакетами. Это следующие пакеты:%s

source: %s has unresolved dependency '%s' under the following combinations of variants: %s
ca: %s té una dependència sense resoldre '%s' sota les següents combinacions de variats: %s
ru: %s содержит неразрешенную зависимость '%s' в следующих комбинациях вариантов: %s

source: Unsupported scheme '%(scheme)s' in URL: '%(url)s'.
ca: Esquema no suportat'%(scheme)s' a la URL: '%(url)s'.
ru: Неподдерживаемая схема '%(scheme)s' в URL: '%(url)s'.

source: Malformed URL: '%s'.
ca: URL mal-formada: '%s'.
ru: Недопустимый URL-адрес: '%s'.

source: Invalid repository URL: '%(url)s': %(msg)s
ca: URL de repositori no vàlida: '%(url)s': %(msg)s
ru: Недопустимый URL-адрес хранилища: '%(url)s': %(msg)s
