Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Usage: pkgrepo [options] command [cmd_options] [operands] Subcommands: pkgrepo create [--version ver] uri_or_path pkgrepo add-publisher -s repo_uri_or_path publisher ... pkgrepo remove-publisher [-n] [--synchronous] -s repo_uri_or_path publisher ... pkgrepo get [-F format] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [section/property ...] pkgrepo info [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo list [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo contents [-m] [-t action_type ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo rebuild [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo refresh [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo remove [-n] [-p publisher ...] -s repo_uri_or_path pkg_fmri_pattern ... pkgrepo set [-p publisher ...] -s repo_uri_or_path section/property[+|-]=[value] ... or section/property[+|-]=([value]) ... pkgrepo verify [-d] [-p publisher ...] [-i ignored_dep_file ...] [--disable verification ...] -s repo_uri_or_path pkgrepo fix [-v] [-p publisher ...] -s repo_uri_or_path pkgrepo diff [-vq] [--strict] [--parsable] [-p publisher ...] -s first_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] -s second_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo help pkgrepo version Options: --help or -? Displays a usage message.
de: Verwendung: pkgrepo [options] command [cmd_options] [operands] Unterbefehle: pkgrepo create [--version ver] uri_or_path pkgrepo add-publisher -s repo_uri_or_path publisher ... pkgrepo remove-publisher [-n] [--synchronous] -s repo_uri_or_path publisher ... pkgrepo get [-F format] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [section/property ...] pkgrepo info [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo list [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo contents [-m] [-t action_type ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo rebuild [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo refresh [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo remove [-n] [-p publisher ...] -s repo_uri_or_path pkg_fmri_pattern ... pkgrepo set [-p publisher ...] -s repo_uri_or_path section/property[+|-]=[value] ... or section/property[+|-]=([value]) ... pkgrepo verify [-d] [-p publisher ...] [-i ignored_dep_file ...] [--disable verification ...] -s repo_uri_or_path pkgrepo fix [-v] [-p publisher ...] -s repo_uri_or_path pkgrepo diff [-vq] [--strict] [--parsable] [-p publisher ...] -s first_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] -s second_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo help pkgrepo version Optionen: --help oder -? Zeigt eine Verwendungsmeldung an.
es: Sintaxis: pkgrepo [options] command [cmd_options] [operands] Subcomandos: pkgrepo create [--version ver] uri_or_path pkgrepo add-publisher -s repo_uri_or_path publisher ... pkgrepo remove-publisher [-n] [--synchronous] -s repo_uri_or_path publisher ... pkgrepo get [-F format] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [section/property ...] pkgrepo info [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo list [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo contents [-m] [-t action_type ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo rebuild [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo refresh [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo remove [-n] [-p publisher ...] -s repo_uri_or_path pkg_fmri_pattern ... pkgrepo set [-p publisher ...] -s repo_uri_or_path section/property[+|-]=[value] ... or section/property[+|-]=([value]) ... pkgrepo verify [-d] [-p publisher ...] [-i ignored_dep_file ...] [--disable verification ...] -s repo_uri_or_path pkgrepo fix [-v] [-p publisher ...] -s repo_uri_or_path pkgrepo diff [-vq] [--strict] [--parsable] [-p publisher ...] -s first_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] -s second_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo help pkgrepo version Opciones: --help or -? Muestra un mensaje sobre la sintaxis.
fr: Syntaxe : pkgrepo [options] command [cmd_options] [operands] Sous-commandes : pkgrepo create [--version ver] uri_or_path pkgrepo add-publisher -s repo_uri_or_path publisher ... pkgrepo remove-publisher [-n] [--synchronous] -s repo_uri_or_path publisher ... pkgrepo get [-F format] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [section/property ...] pkgrepo info [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo list [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo contents [-m] [-t action_type ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo rebuild [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo refresh [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo remove [-n] [-p publisher ...] -s repo_uri_or_path pkg_fmri_pattern ... pkgrepo set [-p publisher ...] -s repo_uri_or_path section/property[+|-]=[value] ... or section/property[+|-]=([value]) ... pkgrepo verify [-d] [-p publisher ...] [-i ignored_dep_file ...] [--disable verification ...] -s repo_uri_or_path pkgrepo fix [-v] [-p publisher ...] -s repo_uri_or_path pkgrepo diff [-vq] [--strict] [--parsable] [-p publisher ...] -s first_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] -s second_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo help pkgrepo version Options : --help or -? Affiche un message relatif à la syntaxe.
ja: 使用方法: pkgrepo [options] command [cmd_options] [operands] サブコマンド: pkgrepo create [--version ver] uri_or_path pkgrepo add-publisher -s repo_uri_or_path publisher ... pkgrepo remove-publisher [-n] [--synchronous] -s repo_uri_or_path publisher ... pkgrepo get [-F format] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [section/property ...] pkgrepo info [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo list [-F format] [-H] [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo contents [-m] [-t action_type ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [pkg_fmri_pattern ...] pkgrepo rebuild [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo refresh [-p publisher ...] -s repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] [--no-catalog] [--no-index] pkgrepo remove [-n] [-p publisher ...] -s repo_uri_or_path pkg_fmri_pattern ... pkgrepo set [-p publisher ...] -s repo_uri_or_path section/property[+|-]=[value] ... or section/property[+|-]=([value]) ... pkgrepo verify [-d] [-p publisher ...] [-i ignored_dep_file ...] [--disable verification ...] -s repo_uri_or_path pkgrepo fix [-v] [-p publisher ...] -s repo_uri_or_path pkgrepo diff [-vq] [--strict] [--parsable] [-p publisher ...] -s first_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] -s second_repo_uri_or_path [--key ssl_key ... --cert ssl_cert ...] pkgrepo help pkgrepo version オプション: --help または -? 使用方法のメッセージを表示します。

source: At least one package pattern must be provided.
de: Es muss mindestens ein Paketmuster angegeben werden.
es: Por lo menos debe proporcionarse un modelo de paquete.
fr: Au moins un modèle de package doit être fourni.
ja: 少なくとも 1 つのパッケージパターンを指定する必要があります。

source: A package repository location must be provided using -s.
de: Es muss ein Speicherort für das Paket-Repository mithilfe der Option -s angegeben werden.
es: Se debe proporcionar una ubicación de repositorio de paquetes mediante -s.
fr: Un emplacement de référentiel de package doit être fourni à l'aide de -s.
ja: パッケージリポジトリの場所を -s を使用して指定する必要があります。
ru: Местоположение каталога пакета необходимо предоставить при помощи -s.

source: {count:d} package(s) will be removed: {plist}
de: {count:d} Packages werden entfernt: {plist}
es: Se eliminarán {count:d} paquete(s): {plist}
fr: {count:d} package(s) seront supprimés : {plist}
ja: {count:d} 個のパッケージが削除されます: {plist}

source: Removing packages for publisher {0} ...
de: Pakete für Herausgeber {0} werden entfernt...
es: Eliminando paquetes para el editor {0}...
fr: Suppression de packages pour l'éditeur {0}...
ja: パブリッシャー {0} のパッケージを削除しています...

source: Network repositories are not currently supported for this operation.
de: Es werden derzeit keine Netzwerk-Repositorys für diesen Vorgang unterstützt.
es: Los repositorios de redes no son compatibles con esta operación.
fr: Les référentiels réseau ne sont actuellement pas pris en charge par cette opération.
ja: ネットワークリポジトリは現在この操作でサポートされていません。
ru: Сетевое хранилище не поддерживается для выполнения этой операции.

source: No repository location specified.
de: Kein Repository-Speicherort angegeben.
es: No se ha especificado ninguna ubicación de repositorio.
fr: Aucun emplacement de référentiel n'est spécifié.
ja: リポジトリの場所が指定されていません。
ru: Не указан путь к каталогу.

source: At least one publisher must be specified
de: Es muss mindestens ein Herausgeber angegeben werden
es: Se debe especificar al menos un editor
fr: Au moins un éditeur doit être spécifié.
ja: パブリッシャーが少なくとも 1 つ指定されている必要があります

source: Invalid publisher prefix '{0}'
de: Ungültiges Herausgeberpräfix '{0}'
es: Prefijo de editor no válido '{0}'
fr: Le préfixe '{0}' de l'éditeur n'est pas valide.
ja: 無効なパブリッシャーの接頭辞 '{0}'

source: specified publisher(s) already exist: {0}
de: Angegebene Herausgeber sind bereits vorhanden: {0}
es: los editores especificados ya existen: {0}
fr: le ou les éditeur(s) spécifié(s) existent déjà : {0}
ja: 指定されたパブリッシャーはすでに存在します: {0}

source: Invalid publisher prefix(es): {0}
de: Ungültige Herausgeberpräfixe: {0}
es: Prefijos de editor no válidos: {0}
fr: Préfixe(s) d'éditeur non valide(s) : {0}
ja: 無効なパブリッシャー接頭辞: {0}

source: The following publisher(s) could not be found: {0}
de: Die folgenden Herausgeber konnten nicht gefunden werden: {0}
es: No se pudieron encontrar los siguientes editores: {0}
fr: Le ou les éditeurs suivants sont introuvables : {0}
ja: 次のパブリッシャーが見つかりませんでした: {0}

source: Removing publisher(s)
de: Herausgeber werden entfernt
es: Eliminando editores
fr: Suppression d'éditeur(s)
ja: パブリッシャーを削除しています

source: '{pfx}' ({num} package(s))
es: '{pfx}' ({num} paquete(s))
ja: '{pfx}' ({num} 個のパッケージ)

source: The default publisher was removed. Setting 'publisher/prefix' to '{0}', the only publisher left
de: Der Standardherausgeber wurde entfernt. "publisher/prefix" wird auf "{0}" gesetzt, dem einzigen verbliebenen Herausgeber
es: Se eliminó el editor predeterminado. La propiedad 'publisher/prefix' se establecerá en '{0}', el único editor restante.
fr: L'éditeur par défaut a été supprimé. Définition de 'publisher/prefix' sur '{0}', le seul éditeur restant
ja: デフォルトのパブリッシャーが削除されました。'publisher/prefix' を '{0}' (唯一残っているパブリッシャー) に設定しています

source: The default publisher was removed. The 'publisher/prefix' property has been unset
de: Der Standardherausgeber wurde entfernt. Die Festlegung der Eigenschaft "publisher/prefix" wurde aufgehoben
es: Se eliminó el editor predeterminado. La propiedad 'publisher/prefix' se ha desconfigurado.
fr: L'éditeur par défaut a été supprimé. La définition de la propriété 'publisher/prefix' a été annulée
ja: デフォルトのパブリッシャーが削除されました。'publisher/prefix' プロパティーの設定が解除されました

source: Version must be an integer value.
de: Version muss ein Integer-Wert sein.
es: La versión debe ser un valor entero.
fr: La version doit être un nombre entier.
ja: バージョンは整数値でなければいけません。
ru: Версия должна быть целым числом.

source: Only one repository location may be specified.
de: Es darf nur ein Repository-Speicherort angegeben werden.
es: Sólo se puede especificar una ubicación de repositorio.
fr: Un seul emplacement de référentiel peut être spécifié.
ja: 指定できるリポジトリの場所は 1 つだけです。
ru: Необходимо указать только один путь к каталогу.

source: SECTION
ja: セクション
ru: РАЗДЕЛ

source: PROPERTY
fr: PROPRIETE
ja: プロパティー
ru: СВОЙСТВО

source: no matching properties found
de: Keine entsprechenden Eigenschaften gefunden
es: no se ha encontrado ninguna propiedad que coincida
fr: aucune propriété correspondante n'a été trouvée
ja: 一致するプロパティーが見つかりません
ru: не найдены соответствующие свойства

source: no matching publishers found
de: Keine entsprechenden Herausgeber gefunden
es: no se ha encontrado ningún editor que coincida
fr: aucun éditeur correspondant n'a été trouvé
ja: 一致するパブリッシャーが見つかりません
ru: не найдены соответствующие издатели

source: no matching publishers found in repository: {0}
de: Keine übereinstimmenden Herausgeber in Repository gefunden: {0}
es: no se encontró ningún editor coincidente en el repositorio: {0}
fr: Aucun éditeur correspondant dans le référentiel : {0}
ja: 一致するパブリッシャーがリポジトリに見つかりません: {0}

source: command does not take operands
ca: la comanda no pren arguments
de: Befehl nimmt keine Operanden an.
es: el comando no toma operandos
fr: commande n'attend pas d'opérande.
ja: コマンドはオペランドを取りません
ru: команда не принимает операнды

source: PACKAGES
ja: パッケージ
ru: ПАКЕТЫ

source: UPDATED
fr: MIS A JOUR
ja: 更新済み
ru: ОБНОВЛЕНО

source: RELEASE
fr: VERSION
ja: リリース

source: BUILD RELEASE
fr: VERSION DE COMPILATION
ja: ビルドリリース

source: BRANCH
fr: BRANCHE
ja: ブランチ

source: PACKAGING DATE
fr: DATE DE CONDITIONNEMENT
ja: パッケージ化の日付

source: SUMMARY
fr: RECAPITULATIF
ja: サマリー

source: DESCRIPTION
ja: 説明

source: CATEGORIES
ja: カテゴリ

source: STATE
fr: ETAT
ja: 状態

source: pkgrepo: contents: This package contains no actions with the types specified using the -t option
de: pkgrepo: contents: Dieses Package enthält keine Aktionen für die Typen, die mit der Option -t angegeben wurden
es: pkgrepo: contenido: Este paquete no contiene acciones con los tipos especificados mediante la opción -t.
fr: pkgrepo : contents : ce package ne contient aucune action des types indiqués utilisant l'option -t.
ja: pkgrepo: contents: このパッケージには、-t オプションで指定されたタイプを持つアクションは 含まれていません

source: pkgrepo: contents: no packages matching the following patterns you specified were found in the repository.
de: pkgrepo: contents: Keine der Packages, die den folgenden angegebenen Mustern entsprechen, wurden im Repository gefunden.
es: pkgrepo: contenido: no se encontraron paquetes que coincidan con los siguientes patrones especificados en el repositorio.
fr: pkgrepo : contents : aucun package correspondant aux critères suivants que vous avez indiqués n'a été trouvé dans le référentiel.
ja: pkgrepo: contents: 指定された次のパターンに一致するパッケージが リポジトリ内で見つかりません。

source: a property name and value must be provided in the form <section/property>=<value> or <section/property>=(["<value>" ...])
de: Eigenschaftsname und -wert müssen in der Form <Abschnitt/Eigenschaft>=<Wert> oder <Abschnitt/Eigenschaft>=(["<Wert>" ...]) angegeben werden
es: debe proporcionarse un nombre y valor de propiedad con el formato <section/property>=<value> o <section/property>=(["<value>" ...])
fr: un nom et une valeur de propriété doivent être fournis au format <section/propriété>=<valeur> ou <section/propriété>=(["<valeur>" ...])
ja: プロパティーの名前と値は、<section/property>=<value> または <section/property>=(["<value>" ...]) の形式で指定する必要があります
ru: имя свойства и значение необходимо предоставить в форме <section/property>=<value> или <section/property>=(["<value>" ...])

source: unknown property section '{0}'
de: Unbekannter Eigenschaftsabschnitt '{0}'
es: sección de propiedad desconocida '{0}'
fr: section de propriété inconnue '{0}'
ja: 不明なプロパティーセクション '{0}'

source: '{0}' may not be set using this command
de: '{0}' darf mit diesem Befehl nicht festgelegt werden
es: '{0}' no se puede definir mediante este comando
fr: '{0}' ne peut pas être défini(e) à l'aide de cette commande
ja: このコマンドを使用して '{0}' を設定することはできません

source: unknown property '{0}'
de: Unbekannte Eigenschaft '{0}'
es: propiedad desconocida '{0}'
fr: propriété inconnue '{0}'
ja: 不明なプロパティー '{0}'

source: One or more publishers must be specified to create and set properties for as none exist yet.
de: Es muss mindestens ein Herausgeber angegeben werden, für den Eigenschaften erstellt und festgelegt werden, da noch keiner vorhanden ist.
es: Deben especificarse uno o más editores para crear y definir propiedades visto que todavía no existe ninguno.
fr: Vous devez spécifier un ou plusieurs éditeurs avant de créer et de définir des propriétés.
ja: パブリッシャーがまだ存在しないため、作成してプロパティーを設定するパブリッシャーを 1 つ以上指定する必要があります。
ru: Необходимо указать издателей для создания и установки их свойств, т.к. они еще не существуют.

source: Unable to set properties for publisher '{pfx}': {details}
de: Eigenschaften für Herausgeber '{pfx}' können nicht festgelegt werden: {details}
es: No se pueden definir propiedades para el editor '{pfx}': {details}
fr: Impossible de définir des propriétés pour l'éditeur '{pfx}' : {details}
ja: パブリッシャー '{pfx}' のプロパティーを設定できません: {details}

source: Repository path
de: Repository-Pfad
es: Ruta de repositorio
fr: Chemin du référentiel
ja: リポジトリパス

source: Computed hash
de: Berechneter Hash
es: Hash calculado
fr: Hachage calculé
ja: 計算されたハッシュ

source: Path
de: Pfad
es: Ruta
fr: Chemin
ja: パス

source: Package
es: Paquete
ja: パッケージ

source: Dependency
de: Abhängigkeit
es: Dependencia
fr: Dépendance
ja: 依存関係
ru: Зависимость

source: Dependency type
de: Abhängigkeitstyp
es: Tipo de dependencia
fr: Type de dépendance
ja: 依存関係のタイプ

source: Detail
de: Details
es: Detalle
fr: Détail
ja: 詳細

source: ERROR
fr: ERREUR
ja: エラー
ru: ОШИБКА

source: WARNING
fr: AVERTISSEMENT
ja: 警告
ru: ПРЕДУПРЕЖДЕНИЕ

source: Invalid verification to be disabled, please consider: {0}
de: Zu deaktivierende ungültige Überprüfung; beachten Sie {0}
es: Verificación no válida para desactivar; considere: {0}
fr: Vérification non valide à désactiver, veuillez tenir compte de l'élément suivant : {0}
ja: 無効化されるべき検証が無効です。検討してください: {0}

source: -d or -i option cannot be used when dependency verification is disabled.
de: Option -d oder -i kann nicht verwendet werden, wenn Abhängigkeitsprüfung deaktiviert ist.
es: Las opciones -i y -d no se pueden utilizar si la verificación de dependencia está desactivada.
fr: l'option -d ou -i ne peut pas être utilisée lorsque la vérification de la dépendance est désactivée.
ja: 依存関係の検証が無効なときは、-d または -i オプションは使用できません。

source: Use pkgsend(1) or pkgrecv(1) to republish the following packages or paths which were quarantined: {0}
de: Verwenden Sie pkgsend(1) oder pkgrecv(1), um die folgenden Packages oder Pfade unter Quarantäne erneut zu veröffentlichen: {0}
es: Use pkgsend(1) o pkgrecv(1) para volver a publicar los siguientes paquetes o rutas que están en cuarentena: {0}
fr: Servez-vous de pkgsend(1) ou de pkgrecv(1) pour republier les packages ou chemins suivants qui avaient été mis en quarantaine : {0}
ja: 隔離された次のパッケージまたはパスを再発行するには、 pkgsend(1) または pkgrecv(1) を使用してください: {0}

source: pkgrepo could not repair the following paths in the repository: {0}
de: pkgrepo konnte die folgenden Pfade im Repository nicht reparieren: {0}
es: pkgrepo no pudo reparar las siguientes rutas en el repositorio: {0}
fr: pkgrepo n'a pas pu réparer les chemins suivants dans le référentiel : {0}
ja: pkgrepo はリポジトリ内の次のパスを修復できませんでした: {0}

source: pkgrepo could not repair the following dependency issues in the repository: {0}
de: pkgrepo konnte die folgenden Abhängigkeitsprobleme im Repository nicht beheben: {0}
es: pkgrepo no pudo reparar los siguientes problemas de dependencias en el repositorio: {0}
fr: pkgrepo n'a pas pu réparer les problèmes de dépendance suivants dans le référentiel : {0}
ja: pkgrepo はリポジトリ内の次の依存関係問題を修復できませんでした: {0}

source: No repository fixes required.
de: Keine Repository-Korrekturen erforderlich.
es: No se necesitan correcciones de repositorio.
fr: Aucune correction de référentiel n'est requise.
ja: リポジトリの修正は必要ありません。

source: Repository repairs completed.
de: Repository-Reparaturen abgeschlossen.
es: Se completaron las reparaciones de repositorio.
fr: Réparations du référentiel terminées.
ja: リポジトリの修復が完了しました。

source: {repo} only
de: Nur {repo}
es: {repo} solamente
fr: {repo} uniquement
ja: {repo} のみ

source: In both
de: In beiden
es: En ambos
fr: Dans les deux
ja: 両方

source: Total
de: Gesamt
ja: 合計

source: ({0:d} package(s) with {1:d} different version(s))
de: ({0:d} Packages mit {1:d} unterschiedlichen Versionen)
es: ({0:d} paquete(s) con {1:d} versión(es) diferente(s))
fr: ({0:d} package(s) avec {1:d} version(s) différentes)
ja: ({0:d} 個のパッケージ、{1:d} 個の異なるバージョン)

source: catalog last modified: {0}
de: Katalog zuletzt geändert: {0}
es: última modificación del catálogo: {0}
fr: dernière modification du catalogue : {0}
ja: 最後に変更されたカタログ: {0}

source: ({0:d} pkg(s) with {1:d} version(s) are in both repositories.)
de: ({0:d} Packages mit {1:d} Versionen befinden sich in beiden Repositorys.)
es: ({0:d} paquete(s) con {1:d} versión(es) en ambos repositorios).
fr: ({0:d} pkg(s) avec {1:d} version(s) présents dans les deux référentiels.)
ja: ({0:d} 個のパッケージ、{1:d} 個のバージョンは両方のリポジトリにあります。)

source: The catalog for the following publisher(s) in repository {0} is not an exact copy of the one for the same publisher in repository {1}: {2}
de: Der Katalog für die folgenden Herausgeber in Repository {0} ist keine genaue Kopie des Katalogs für denselben Herausgeber in Repository {1}: {2}
es: El catálogo para los siguientes editores del repositorio {0} no es una copia exacta del que está en el repositorio {1} para el mismo editor: {2}
fr: Le catalogue destinés aux éditeurs suivants dans le référentiel {0} n'est pas une copie exacte du catalogue destiné au même éditeur dans le référentiel {1} : {2}
ja: リポジトリ {0} 内の次のパブリッシャーのカタログは、リポジトリ {1} 内の同じパブリッシャーのカタログと同一のコピーではありません: {2}

source: The table below shows the number of packages [total distinct versions] by publisher in the specified repositories.
de: In der folgenden Tabelle wird die Anzahl von Packages [eindeutige Versionen insgesamt] nach Herausgeber in den angegebenen Repositorys dargestellt.
es: En la siguiente tabla, se muestra el número de paquetes [versiones diferentes totales] por editor en los repositorios especificados.
fr: Le tableau ci-dessous indique le nombre de packages [versions totales distinctes] par éditeur dans les référentiels spécifiés.
ja: 次の表は、指定されたリポジトリ内のパブリッシャーごとの パッケージ数 [別個のバージョンの総数] を示しています。

source: --{0} must be specified following a -s
de: --{0} muss im Anschluss an -s angegeben werden
es: --{0} se debe especificar después de -s
fr: --{0} doit être indiqué après a -s
ja: --{0} を -s のあとに指定する必要があります

source: only two repositories can be specified
de: Es können nur zwei Repositorys angegeben werden
es: solo se pueden especificar dos repositorios
fr: seulement deux référentiels peuvent être spécifiés
ja: 指定できるリポジトリは 2 つだけです
