Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: The URI '{uri}' uses the unsupported scheme '{scheme}'. Supported schemes are file://, http://, and https://.
de: Die URI '{uri}' verwendet das nicht unterstützte Schema '{scheme}'. Unterstützte Schemen sind file://, http:// und https://.
es: El URI '{uri}' usa el esquema no admitido '{scheme}'. Los esquemas admitidos son file://, http:// y https://.
fr: L'URI '{uri}' utilise un schéma non pris en charge '{scheme}'. Les schémas pris en charge sont : file://, http:// et https://.
ja: URI '{uri}' はサポートされていないスキーム '{scheme}' を使用しています。サポートされるスキームは file://、http://、および https:// です。

source: The specified URI uses an unsupported scheme. Supported schemes are: file://, http://, and https://.
de: Der angegebene URI verwendet ein nicht unterstütztes Schema. Unterstützte Schemata sind: file://, http:// und https://.
es: El URI especificado utiliza un esquema no admitido. Las esquemas admitidos son: file://, http:// y https://.
fr: L'URI spécifié utilise un schéma non pris en charge. Les schémas pris en charge sont : file://, http://, et https://.
ja: 指定された URI はサポートされていないスキームを使用しています。サポートされるスキームは file://、http://、および https:// です。

source: '{attr}' is not supported for '{scheme}'.
de: '{attr}' wird für '{scheme}' nicht unterstützt.
es: '{attr}' no se admite para '{scheme}'.
fr: '{attr}' n'est pas pris en charge pour '{scheme}'.
ja: '{attr}' は '{scheme}' でサポートされていません。

source: The proxy URI '{uri}' uses the unsupported scheme '{scheme}'. Currently the only supported scheme is http://.
de: Die Proxy-URI '{uri}' verwendet das nicht unterstützte Schema '{scheme}'. Aktuell wird nur das Schema http:// unterstützt.
es: El URI de proxy '{uri}' usa el esquema no admitido '{scheme}'. Actualmente, el único esquema admitido es http://.
fr: L'URI du proxy '{uri}' utilise le schéma non pris en charge '{scheme}'. Actuellement, le seul schéma pris en charge est http://.
ja: プロキシ URI '{uri}' はサポートされていないスキーム '{scheme}' を使用しています。現在サポートされるスキームは http:// のみです。

source: The specified proxy URI uses an unsupported scheme. Currently the only supported scheme is: http://.
de: Die angegebene Proxy-URI verwendet ein nicht unterstütztes Schema. Aktuell wird nur das Schema http:// unterstützt.
es: El URI de proxy especificado usa un esquema no admitido. Actualmente, el único esquema admitido es http://.
fr: L'URI du proxy spécifié utilise un schéma non pris en charge. Actuellement, le seul schéma pris en charge est http://.
ja: 指定されたプロキシ URI はサポートされていないスキームを使用しています。現在サポートされるスキームは http:// のみです。

source: pkg is configured to use the system repository (via the use-system-repo property) but it could not get the host and port from svc:/application/pkg/zones-proxy-client nor svc:/application/pkg/system-repository, and the PKG_SYSREPO_URL environment variable was not set. Please try enabling one of those services or setting the PKG_SYSREPO_URL environment variable.
de: pkg ist für die Verwendung des System-Repository (mithilfe der Eigenschaft use-system-repo) konfiguriert, der Host und Port konnten jedoch weder vom svc:/application/pkg/zones-proxy-client- noch vom svc:/application/pkg/system-Repository abgerufen werden, und die PKG_SYSREPO_URL-Umgebungsvariable wurde nicht festgelegt. Aktivieren Sie einen der Services oder legen Sie die PKG_SYSREPO_URL-Umgebungsvariable fest.
es: pkg está configurado para usar el repositorio del sistema (mediante la propiedad use-system-repo), pero no pudo obtener el host ni el puerto de svc:/application/pkg/zones-proxy-client ni de svc:/application/pkg/system- repository, y no se pudo configurar la variable de entorno PKG_SYSREPO_URL. Intente habilitar uno de estos servicios o configurar la variable de entorno PKG_SYSREPO_URL.
fr: pkg est configuré pour utiliser le référentiel du système (via la propriété use-system-repo) mais n'a pas pu obtenir l'hôte et le port depuis svc:/application/pkg/zones-proxy-client ou svc:/application/pkg/system-repository et la variable d'environnement PKG_SYSREPO_URL n'a pas été définie. Essayezd'activer l'un de ces services ou de définir la variable d'environnement PKG_SYSREPO_URL.
ja: pkg は、(use-system-repo プロパティーによって) システムリポジトリを使用する ように設定されていますが、svc:/application/pkg/zones-proxy-client および svc:/application/pkg/system-repository からホストとポートを取得できず、 PKG_SYSREPO_URL 環境変数が設定されていませんでした。 これらのサービスのいずれかを有効にするか、PKG_SYSREPO_URL 環境変数を設定して ください。

source: The relevant signature action is found in {pfmri} and has a hash of {hsh}
de: Die entsprechende Signaturaktion wurde in {pfmri} gefunden und weist einen Hash {hsh} auf
es: La acción de firma relevante se encuentra en {pfmri} y tiene un hash de {hsh}
fr: L'action de signature appropriée se trouve dans {pfmri} et contient un hachage de {hsh}
ja: 関連する署名アクションが {pfmri} に見つかりました。そのハッシュは {hsh} です

source: The package involved is {0}
de: Das betroffene Paket ist {0}
es: El paquete involucrado es {0}
fr: Le package en question est {0}
ja: 関係するパッケージは {0} です

source: The relevant signature action's value attribute is {0}
de: Das Wertattribut der relevanten Signaturaktion lautet {0}
es: El atributo del valor de la acción de firma relevante es {0}
fr: L'attribut de la valeur de l'action de signature appropriée est {0}
ja: 関連する署名アクションの値属性は {0} です

source: The signature action {act} was made using a version ({ver}) this version of pkg(7) doesn't understand.
de: Die Signaturaktion {act} wurde mit einer Version ({ver}) vorgenommen, die von dieser Version von pkg(7) nicht verstanden wird.
es: La acción de firma {act} se llevó a cabo mediante una versión ({ver}) que esta versión de pkg(7) no reconoce.
fr: L'action de signature {act} a été créée à l'aide d'une version ({ver}) que cette version de pkg(7) ne comprend pas.
ja: 署名アクション {act} は、このバージョンの pkg(7) では認識できないバージョン ({ver}) を使用して作成されました。

source: Certificate {0} has been modified on disk. Its hash value is not what was expected.
de: Zertifikat {0} wurde auf Datenträger geändert. Der Hash-Wert entspricht nicht dem erwarteten Wert.
es: El certificado {0} se ha modificado en el disco. El valor de hash no es el que se esperaba.
fr: Le certificat {0} a été modifié sur le disque. Sa valeur de hachage n'est pas celle attendue.
ja: 証明書 {0} はディスク上で変更されています。そのハッシュ値は期待された値と異なっています。

source: Chain was rooted in an untrusted self-signed certificate.
de: Beginn der Kette in nicht vertrauenswürdigen selbst-signiertem Zertifikat.
es: La cadena tenía raíz en un certificado autofirmado que no es de confianza.
fr: La chaîne provient d'un certificat autosigné non fiable.
ja: チェーンは、信頼できない自己署名付き証明書を基にしています。
ru: Корень цепочки находится в недоверительном самоподписывающемся сертификате.

source: The following problems were encountered:
de: Folgende Probleme traten auf:
es: Se han detectado los problemas siguientes:
fr: Les problèmes suivants se sont produits :
ja: 次の問題が発生しました:
ru: Возникли следующие проблемы:

source: The certificate which issued this certificate: {subj} could not be found. The issuer is: {issuer}
de: Das Zertifikat, von dem das Zertifikat: {subj} ausgestellt wurde, konnte nicht gefunden werden. Der Aussteller ist: {issuer}
es: El certificado que emitió este certificado: {subj} no se encontró. El emisor es: {issuer}
fr: Le certificat qui a émis ce certificat : {subj} est introuvable. L'émetteur est : {issuer}
ja: この証明書 {subj} を発行した証明書が見つかりませんでした。発行者: {issuer}

source: This certificate was revoked:{cert} for this reason: {reason}
de: Das Zertifikat {cert} wurde aus folgendem Grund entzogen: {reason}
es: Este certificado se revocó:{cert} por el motivo siguiente: {reason}
fr: Ce certificat a été révoqué :{cert} pour la raison suivante : {reason}
ja: 証明書: {cert} は、次の理由で失効していました: {reason}

source: A signature in {pfmri} could not be verified for this reason: {reason} The signature's hash is {hash}
de: Eine Signatur in {pfmri} konnte aus folgendem Grund nicht geprüft werden: {reason} Der Hash der Signatur ist {hash}
es: No se pudo verificar una firma de {pfmri} por el motivo siguiente: {reason} El hash de la firma es {hash}
fr: Une signature contenue dans {pfmri} n'a pas pu être vérifiée pour la raison suivante : {reason} Le hachage de la signature est {hash}
ja: {pfmri} の署名を次の理由で検証できませんでした: {reason} 署名のハッシュは {hash} です

source: The signature with this signature value: {sigval} could not be verified for this reason: {reason}
de: Die Signatur mit dem Signaturwert: {sigval} konnte aus diesem Grund nicht überprüft werden: {reason}
es: La firma con el valor de firma: {sigval} no se pudo verificar por el motivo siguiente: {reason}
fr: La signature comportant la valeur de signature suivante : {sigval} n'a pas pu être vérifiée pour la raison suivante : {reason}
ja: 次の署名値: {sigval} を持つ署名を、次の理由で検証できませんでした: {reason}

source: The policy for {pub_str} requires signatures to be present but no signature was found in {fmri_str}.
de: Die Richtlinie für {pub_str} erfordert, dass Signaturen vorhanden sein müssen. Es wurde jedoch keine Signatur in {fmri_str}gefunden.
es: La política para {pub_str} requiere que existan firmas, pero no se encontró ninguna firma en {fmri_str}.
fr: La règle pour {pub_str} nécessite la présence de signatures ; toutefois, aucune signature n'a été trouvée dans {fmri_str}.
ja: {pub_str} のポリシーでは、署名が存在している必要がありますが、{fmri_str} に署名が見つかりませんでした。

source: The policy for {pub_str} requires signatures to be present but no signature was found.
de: Die Richtlinie für {pub_str} erfordert, dass Signaturen vorhanden sein müssen. Es wurde jedoch keine Signatur gefunden.
es: La política para {pub_str} requiere que existan firmas, pero no se encontró ninguna firma.
fr: La règle pour {pub_str} nécessite la présence de signatures ; toutefois, aucune signature n'a été trouvée.
ja: {pub_str} のポリシーでは、署名が存在している必要がありますが、署名が見つかりませんでした。

source: The policy for {pub_str} requires certain CNs to be seen in a chain of trust. The following required names couldn't be found for this package:{fmri_str}. {missing}
de: Die Richtlinie für {pub_str} erfordert, dass bestimmte CNs in einer Vertrauenskette enthalten sind. Die folgenden erforderlichen Namen konnten für dieses Package nicht gefunden werden: {fmri_str}. {missing}
es: La política para {pub_str} requiere que determinados CN estén presentes en una cadena de confianza. Los siguientes nombres de paquetes necesarios no se han podido encontrar para este paquete:{fmri_str}. {missing}
fr: La règle pour {pub_str} nécessite la présence de certains CN dans une chaîne de confiance. Les noms requis suivants n'ont pas été trouvés pour ce package :{fmri_str}. {missing}
ja: {pub_str} のポリシーでは、トラストチェーン内に特定の CN が見つかる必要があります。次のパッケージには、次に示す必要な名前が見つかりませんでした: {fmri_str}。 {missing}

source: The policy for {pub_str} requires certain CNs to be seen in a chain of trust. The following required names couldn't be found. {missing}
de: Die Richtlinie für {pub_str} erfordert, dass bestimmte CNs in einer Vertrauenskette enthalten sind. Die folgenden erforderlichen Namen konnten nicht gefunden werden: {missing}
es: La política para {pub_str} requiere que determinados CN estén presentes en una cadena de confianza. Los siguientes nombres de paquetes necesarios no se han podido encontrar. {missing}
fr: La règle pour {pub_str} nécessite la présence de certains CN dans une chaîne de confiance. Les noms requis suivants n'ont pas été trouvés. {missing}
ja: {pub_str} のポリシーでは、トラストチェーン内に特定の CN が見つかる必要があります。次に示す必要な名前が見つかりませんでした。 {missing}

source: The certificate whose subject is {cert} could not be verified because it uses an unsupported critical extension. Extension name: {name} Extension value: {val}
de: Das Zertifikat mit dem Subjekt {cert} konnte nicht verifiziert werden, weil es eine nicht unterstützte kritische Erweiterung verwendet. Erweiterungsname: {name} Erweiterungswert: {val}
es: El certificado cuyo asunto es {cert} no se ha podido verificar porque usa una extensión crítica que no es compatible. Nombre de la extensión: {name} Valor de la extensión: {val}
fr: Le certificat dont l'objet est {cert} n'a pas pu être vérifié car il utilise une extension non prise en charge. Nom de l'extension : {name} Valeur de l'extension : {val}
ja: {cert} を被認証者とする証明書は、サポートされない重要な拡張機能を使用しているため、検証できませんでした。 拡張機能の名前: {name} 拡張機能の値: {val}

source: The certificate whose subject is {cert} could not be verified because it has invalid extensions: {error}
de: Das Zertifikat mit dem Subjekt {cert} konnte nicht verifiziert werden, weil es ungültige Erweiterungen besitzt: {error}
es: El certificado cuyo asunto es {cert} no se ha podido verificar porque tiene extensiones no válidas: {error}
fr: Le certificat dont l'objet est {cert} n'a pas pu être vérifié car il utilise des extensions non valides : {error}
ja: {cert} を被認証者とする証明書は、拡張子が無効なため、検証できませんでした: {error}

source: The certificate whose subject is {cert} could not be verified because it has been used inappropriately. The way it is used means that the value for extension {name} must include '{use}' but the value was '{val}'.
de: Das Zertifikat mit Subject {cert} konnte nicht überprüft werden, weil es nicht richtig verwendet wurde. Der Art der Verwendung zufolge muss der Wert der Erweiterung {name} '{use}' enthalten. Der Wert war jedoch '{val}'.
es: No se pudo verificar el certificado cuyo asunto es {cert} porque se utilizó de manera inadecuada. El modo de uso significa que el valor para la extensión {name} debe incluir '{use}', pero el valor fue '{val}'.
fr: Le certificat dont l'objet est {cert} n'a pas pu être vérifié car il a été utilisé de manière inappropriée. La manière dont il est utilisé signifie que la valeur de l'extension {name} doit inclure '{use}' mais que la valeur était '{val}'.
ja: {cert} を被認証者とする証明書は、不適切に使用されているために検証できませんでした。この使用方法では、拡張機能 {name} の値に '{use}' が含まれている必要がありますが、値は '{val}' でした。

source: The certificate whose subject is {cert} could not be verified because it has been used inappropriately. There can only be {cl} certificates between this certificate and the leaf certificate. There are {al} certificates between this certificate and the leaf in this chain.
de: Das Zertifikat mit Subject {cert} konnte nicht überprüft werden, weil es nicht richtig verwendet wurde. Zwischen diesem Zertifikat und dem Blattzertifikat können nur {cl} Zertifikate vorhanden sein. In dieser Kette befinden sich {al} Zertifikate zwischen diesem Zertifikat und Blattzertifikat.
es: No se pudo verificar el certificado cuyo asunto es {cert} porque se utilizó de manera inadecuada. Solo puede haber certificados {cl} entre este certificado y el certificado de hoja. Hay certificados {al} entre este certificado y el de hoja en esta cadena.
fr: Le certificat dont l'objet est {cert} n'a pas pu être vérifié car il a été utilisé de manière inappropriée. Il ne peut y avoir que {cl} certificats entre ce certificat et le certificat feuille. Il y a {al} certificats entre ce certificat et la feuille dans cette chaîne.
ja: {cert} を被認証者とする証明書は、不適切に使用されているために検証できませんでした。この証明書とリーフ証明書の間には {cl} 証明書しかない可能性があります。この証明書とこのチェーンのリーフの間には {al} 証明書があります。

source: The signature to be added to the package has the same hash ({hash}), algorithm ({algorithm}), and version ({version}) as an existing signature, but doesn't match the signature exactly. For this signature to be added, the existing signature must be removed.
de: Die Signatur, die dem Package hinzugefügt werden soll, hat das Hash ({hash}), den Algorithmus ({algorithm}) und die Version ({version}) einer bereits vorhandenen Signatur, aber sie stimmt mit dieser nicht genau überein. Die vorhandene Signatur, muss entfernt werden, um diese Signatur hinzuzufügen.
es: La firma que se agregará al paquete tiene el mismo hash ({hash}), el mismo algoritmo ({algorithm}) y la misma versión ({version}) que la firma existente, pero no coincide exactamente con la firma. Para agregar esta firma, se debe eliminar la firma existente.
fr: La signature à ajouter dans ce package a les mêmes hachage ({hash}), algorithme ({algorithm}) et version ({version}) qu'une signature existante, mais ne correspond pas exactement à celle-ci. Pour pouvoir ajouter la signature, il faut supprimer la signature existante.
ja: パッケージに追加される署名は、既存の署名と同じハッシュ ({hash})、アルゴリズム ({algorithm})、およびバージョン ({version}) を含んでいますが、既存の署名と厳密には一致しません。この署名を追加するには、既存の署名を削除する必要があります。

source: The package being signed was {pkg}
de: Das signierte Package war {pkg}
es: El paquete que se estaba firmando era {pkg}
fr: Le package signé était {pkg}
ja: 署名中のパッケージは {pkg} でした

source: {0} could not be signed because it already has two copies of this signature in it. One of those signature actions must be removed before the package is given to users.
de: {0} konnte nicht signiert werden, weil es bereits über zwei Kopien dieser Signatur verfügt. Eines der Signaturaktionen muss entfernt werden, bevor das Paket an Benutzer übergeben wird.
es: {0} no se pudo firmar porque ya tiene dos copias de la firma. Se debe eliminar una de las acciones de firma antes de enviar el paquete a los usuarios.
fr: {0} n'a pas pu être signé car il contient déjà deux copies de cette signature. L'une de ces actions de signature doit être supprimée avant la remise du package aux utilisateurs.
ja: {0} は、すでにこの署名のコピーを 2 つ持っているため、署名できませんでした。パッケージをユーザーに提供する前に、これらの署名アクションのいずれかを削除する必要があります。

source: Certificate '{cert}' for publisher '{pub}' needed to access '{uri}', has expired. Please install a valid certificate.
de: Das zum Zugriff auf '{uri}' benötigte Zertifikat '{cert}' für Herausgeber '{pub}' ist abgelaufen. Installieren Sie ein gültiges Zertifikat.
es: El certificado '{cert}' para el editor '{pub}', necesario para acceder a '{uri}', ha caducado. Instale un certificado válido.
fr: Le certificat '{cert}' pour l'éditeur '{pub}' nécessaire pour accéder à '{uri}' a expiré. Installez un certificat valide.
ja: '{uri}' へのアクセスに必要なパブリッシャー '{pub}' の証明書 '{cert}' の有効期限が切れています。有効な証明書をインストールしてください。

source: Certificate '{cert}' for publisher '{pub}', has expired. Please install a valid certificate.
de: Das Zertifikat '{cert}' für Herausgeber '{pub}' ist abgelaufen. Installieren Sie ein gültiges Zertifikat.
es: El certificado '{cert}' para el editor '{pub}' ha caducado. Instale un certificado válido.
fr: Le certificat '{cert}' pour l'éditeur '{pub}' a expiré. Installez un certificat valide.
ja: パブリッシャー '{pub}' の証明書 '{cert}' の有効期限が切れています。有効な証明書をインストールしてください。

source: Certificate '{cert}', needed to access '{uri}', has expired. Please install a valid certificate.
de: Das zum Zugriff auf '{uri}' benötigte Zertifikat '{cert}' ist abgelaufen. Installieren Sie ein gültiges Zertifikat.
es: El certificado '{cert}', necesario para acceder a '{uri}', ha caducado. Instale un certificado válido.
fr: Le certificat '{cert}' nécessaire pour accéder à '{uri}' a expiré. Installez un certificat valide.
ja: '{uri}' へのアクセスに必要な証明書 '{cert}' の有効期限が切れています。有効な証明書をインストールしてください。

source: Certificate '{0}' has expired. Please install a valid certificate.
de: Das Zertifikat '{0}' ist abgelaufen. Installieren Sie ein gültiges Zertifikat.
es: El certificado '{0}' ha caducado. Instale un certificado válido.
fr: Le certificat '{0}' a expiré. Installez un certificat valide.
ja: 証明書 '{0}' の有効期限が切れています。有効な証明書をインストールしてください。

source: Publisher
ca: Publicador
de: Herausgeber
es: Editor
fr: Editeur
ja: パブリッシャー
ru: Издатель

source: Origin URI
ca: URI origen
de: Ursprüngliche URI
es: URI de origen
fr: URI d'origine
ja: 起点 URI
ru: URI источника

source: Certificate
de: Zertifikat
es: Certificado
fr: Certificat
ja: 証明書

source: Key
de: Schlüssel
es: Clave
fr: Clé
ja: 鍵

source: One or more client key and certificate files have expired. Please update the configuration for the publishers or origins listed below: {0}
de: Mindestens eine Clientschlüssel- und eine Clientzertifikatdatei sind abgelaufen. Aktualisieren Sie die Konfiguration für die folgenden Hersteller oder Ursprünge: {0}
es: Uno o más archivos de claves y certificados de clientes han caducado. Actualice la configuración para los editores u orígenes que se muestran a continuación: {0}
fr: Un ou plusieurs fichiers de certificats ou de clés client ont expiré. Veuillez mettre à jour la configuration pour les éditeurs ou les sources figurant dans la liste ci-dessous : {0}
ja: クライアントの 1 つ以上の鍵および証明書ファイルが期限切れです。 パブリッシャーまたは次の起点の構成を更新してください。 {0}

source: Certificate '{cert}' for publisher '{pub}', needed to access '{uri}', will expire in '{days}' days.
de: Zertifikat '{cert}' für Herausgeber '{pub}', das für den Zugriff auf '{uri}' erforderlich ist, läuft in '{days}' Tagen ab.
es: El certificado '{cert}' para el editor '{pub}', necesario para acceder a '{uri}', caducará en '{days}' días.
fr: Le certificat '{cert}' pour l'éditeur '{pub}', nécessaire pour accéder à '{uri}', expire dans '{days}' jours.
ja: '{uri}' へのアクセスに必要なパブリッシャー '{pub}' の証明書 '{cert}' は、あと '{days}' 日で期限切れになります。

source: Certificate '{cert}' for publisher '{pub}' will expire in '{days}' days.
de: Zertifikat '{cert}' für Herausgeber '{pub}' läuft in '{days}' Tagen ab.
es: El certificado '{cert}' para el editor '{pub}' caducará en '{days}' días.
fr: Le certificat '{cert}' pour l'éditeur '{pub}' expire dans '{days}' jours.
ja: パブリッシャー '{pub}' の証明書 '{cert}' は、あと '{days}' 日で期限切れになります。

source: Certificate '{cert}', needed to access '{uri}', will expire in '{days}' days.
de: Zertifikat '{cert}', das für den Zugriff auf '{uri}' erforderlich ist, läuft in '{days}' Tagen ab.
es: El certificado '{cert}', necesario para acceder a '{uri}', caducará en '{days}' días.
fr: Le certificat '{cert}', nécessaire pour accéder à '{uri}', expire dans '{days}' jours.
ja: '{uri}' へのアクセスに必要な証明書 '{cert}' は、あと '{days}' 日で期限切れになります。

source: Certificate '{cert}' will expire in '{days}' days.
de: Zertifikat '{cert}' läuft in '{days}' Tagen ab.
es: El certificado '{cert}' caducará en '{days}' días.
fr: Le certificat '{cert}' expire dans '{days}' jours.
ja: 証明書 '{cert}' は、あと '{days}' 日で期限切れになります。

source: Certificate '{cert}' for publisher '{pub}', needed to access '{uri}', is invalid.
de: Zertifikat '{cert}' für Herausgeber '{pub}', das für den Zugriff auf '{uri}' erforderlich ist, ist ungültig.
es: El certificado '{cert}' para el editor '{pub}', necesario para acceder a '{uri}', no es válido.
fr: Le certificat '{cert}' pour l'éditeur '{pub}', nécessaire pour accéder à '{uri}', n'est pas valide.
ja: '{uri}' へのアクセスに必要なパブリッシャー '{pub}' の証明書 '{cert}' が無効です。

source: Certificate '{cert}' for publisher '{pub}' is invalid.
de: Zertifikat '{cert}' für Herausgeber '{pub}' ist ungültig.
es: El certificado '{cert}' para el editor '{pub}' no es válido.
fr: Le certificat '{cert}' pour l'éditeur '{pub}' n'est pas valide.
ja: パブリッシャー '{pub}' の証明書 '{cert}' が無効です。

source: Certificate '{cert}' needed to access '{uri}' is invalid.
de: Zertifikat '{cert}' für den Zugriff auf '{uri}' ist ungültig.
es: El certificado '{cert}' necesario para acceder a '{uri}' no es válido.
fr: Le certificat '{cert}' nécessaire pour accéder à '{uri}' n'est pas valide.
ja: '{uri}' へのアクセスに必要な証明書 '{cert}' が無効です。

source: Invalid certificate '{0}'.
de: Ungültiges Zertifikat '{0}'.
es: Certificado no válido '{0}'.
fr: Certificat non valide '{0}'.
ja: 無効な証明書 '{0}'。

source: Unable to locate key '{key}' for publisher '{pub}' needed to access '{uri}'.
de: Schlüssel '{key}' für Herausgeber '{pub}' für den Zugriff auf '{uri}' kann nicht gefunden werden.
es: No se puede encontrar la clave '{key}' que necesita el editor '{pub}' para tener acceso a '{uri}'.
fr: La clé '{key}' pour l'éditeur '{pub}' nécessaire pour accéder à '{uri}' est introuvable.
ja: '{uri}' へのアクセスに必要なパブリッシャー '{pub}' のキー '{key}' が見つかりません。

source: Unable to locate key '{key}' for publisher '{pub}'.
de: Schlüssel '{key}' für Herausgeber '{pub}' kann nicht gefunden werden.
es: No se puede encontrar la clave '{key}' del editor '{pub}'.
fr: La clé '{key}' pour l'éditeur '{pub}' est introuvable.
ja: パブリッシャー '{pub}' のキー '{key}' が見つかりません。
