Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Multiple values for {key} in {manifest}
de: Mehrere Werte für {key} in {manifest}
es: Varios valores para {key} en {manifest}
fr: Valeurs multiples pour {key} dans {manifest}
ja: {manifest} で {key} に複数の値が指定されています

source: unable to read config file: {0}
de: Konfigurationsdatei kann nicht gelesen werden: {0}
es: no se puede leer el archivo de configuración: {0}
fr: Impossible de lire le fichier de configuration : {0}
ja: 構成ファイルを読み取れません: {0}

source: missing or corrupt pkglintrc file {config_file}: {err}
de: pkglintrc-Datei {config_file} fehlt oder ist beschädigt: {err}
es: archivo pkglintrc faltante o dañado {config_file}: {err}
fr: fichier pkglintrc {config_file} absent ou endommagé : {err}
ja: pkglintrc ファイル {config_file} が存在しないか壊れています: {err}

source: Invalid release string: {0}
de: Ungültige Freigabezeichenfolge: {0}
es: Cadena de versión no válida: {0}
fr: Chaîne de version non valide : {0}
ja: 無効なリリース文字列: {0}

source: loading extensions: duplicate checker name {name}: {classname}
de: Erweiterungen werden geladen: Doppelter Checker-Name {name}: {classname}
es: cargando extensiones: nombre de comprobador duplicado {name}: {classname}
fr: chargement des extensions : nom du vérificateur en doublon {name} : {classname}
ja: 拡張機能のロード: 検査名 {name} は重複しています: {classname}

source: loading extension {checker}: duplicate pkglint_id {pkglint_id} in {method}
de: Erweiterung {checker} wird geladen: Doppelte pkglint_id {pkglint_id} in {method}
es: cargando extensión {checker}: pkglint_id {pkglint_id} duplicado en {method}
fr: chargement d'extension {checker} : pkglint_id {pkglint_id} en double dans {method}
ja: 拡張機能 {checker} のロード: {method} の pkglint_id {pkglint_id} は重複しています

source: Error parsing config value for {key}: {err}
de: Fehler beim Parsen von Konfigurationswert für {key}: {err}
es: Error al analizar el valor de configuración para {key}: {err}
fr: Une erreur s'est produite lors de l'analyse de la valeur de configuration de {key} : {err}
ja: {key} の構成値の解析中にエラーが発生しました: {err}

source: Either a cache directory, or some local manifest files must be provided.
de: Es müssen entweder ein Cache-Verzeichnis oder lokale Manifest-Dateien angegeben werden.
es: Se debe proporcionar un directorio de memoria caché o archivos de manifiesto locales.
fr: Vous devez fournir un répertoire cache ou des fichiers manifestes locaux.
ja: キャッシュディレクトリまたはいくつかのローカルマニフェストファイルを指定する必要があります。
ru: Необходимо предоставить каталог кэша или некоторые локальные файлы манифеста.

source: A cache directory must be provided if using reference or lint repositories.
de: Bei der Verwendung von Referenz- oder Lint-Repositorys muss ein Cache-Verzeichnis angegeben werden.
es: Si se utilizan repositorios lint o de referencia, es necesario proporcionar un directorio de memoria caché.
fr: Un répertoire cache doit être fourni pour utiliser des référentiels de références ou Lint.
ja: 参照リポジトリまたは lint リポジトリを使用している場合は、キャッシュディレクトリを指定する必要があります。
ru: При использовании ссылочных хранилищ или хранилищ lint необходимо предоставить каталог кэша.

source: Ignoring -l option, existing image found.
de: Option -l wird ignoriert, vorhandenes Abbild gefunden.
es: Ignorando la opción -l, se ha encontrado una imagen existente.
fr: Option -l ignorée ; image existante trouvée.
ja: -l オプションを無視します。既存のイメージが見つかりました。
ru: Игнорирование параметра -l, найден существующий образ.

source: Unable to create lint image: {0}
de: Das Lint-Abbild konnte nicht erstellt werden: {0}
es: No se puede crear la imagen lint: {0}
fr: Impossible de créer l'image Lint : {0}
ja: lint イメージを作成できません: {0}

source: Ignoring -r option, existing image found.
de: Option -r wird ignoriert, vorhandenes Abbild gefunden.
es: Ignorando la opción -r, se ha encontrado una imagen existente.
fr: Option -r ignorée ; image existante trouvée.
ja: -r オプションを無視します。既存のイメージが見つかりました。
ru: Игнорирование параметра -r, найден существующий образ.

source: Unable to create reference image: {0}
de: Referenz-Abbild konnte nicht erstellt werden: {0}
es: No se puede crear la imagen de referencia: {0}
fr: Impossible de créer l'image de référence : {0}
ja: 参照イメージを作成できません: {0}

source: Unable to access any pkglint images under {0}
de: Kein Zugriff auf pkglint-Abbilder unter {0} möglich
es: No se puede acceder a las imágenes pkglint en {0}
fr: Impossible d'accéder aux images pkglint sous {0}
ja: {0} の下の pkglint イメージにアクセスできません

source: {0} does not subclass a known Checker subclass intended for use by pkglint extensions
de: {0} enthält keine bekannte Checker-Unterklasse für pkglint-Erweiterungen
es: {0} no actúa como subclase para una subclase de comprobador conocida destinada para utilizarse con extensiones pkglint
fr: {0} ne sous-classe pas de sous-classe connue de Checker conçues pour être utilisées par les extensions pkglint
ja: {0} は、pkglint の拡張機能で使用される既知の Checker サブクラスをサブクラス化しません

source: Total number of checks found: {0}
de: Summe der gefundenen Überprüfungen: {0}
es: Número total de comprobaciones encontrado: {0}
fr: Nombre total de vérifications trouvées : {0}
ja: 見つかったチェックの合計数: {0}

source: unable to construct fmri from {0}
de: FRMI kann nicht von {0} erstellt werden
es: no se puede crear FMRI desde {0}
fr: impossible de construire le FMRI à partir de {0}
ja: {0} から FMRI を作成できません

source: invalid pkg name {0}
de: Ungültiger pkg-Name {0}
es: nombre de paquete no válido {0}
fr: nom de pkg non valide {0}
ja: 無効なパッケージ名 {0}

source: get_fmri(pattern) {pattern} matched {count} packages: {pkgs}
de: Übereinstimmung von get_fmri(pattern) {pattern} mit {count} Packages: {pkgs}
es: get_fmri(pattern) {pattern} coincide con {count} paquetes: {pkgs}
fr: get_fmri(pattern) {pattern} correspond à {count} packages : {pkgs}
ja: get_fmri(pattern) {pattern} は {count} 個のパッケージに一致しました: {pkgs}

source: No reference repository has been configured
de: Es wurde kein Referenz-Repository konfiguriert
es: No se ha configurado ningún repositorio de referencia
fr: Aucun référentiel de référence n'a été configuré
ja: 参照リポジトリが構成されていません

source: Unable to get image at {dir}: {reason}
de: Image kann nicht aus {dir} abgerufen werden: {reason}
es: No se puede obtener la imagen en {dir}: {reason}
fr: Impossible d'obtenir l'image de {dir} : {reason}
ja: {dir} にあるイメージを取得できません: {reason}

source: Creating image at {0}
de: Image wird erstellt unter {0}
es: Creando imagen en {0}
fr: Création de l'image dans {0}
ja: {0} にイメージを作成しています

source: Checking {0}
de: {0} wird geprüft
es: Comprobando {0}
fr: Vérification de {0}
ja: {0} を検査しています

source: Not running {check} checks on linted action {action}
de: Es werden keine Prüfungen {check} von Aktion {action} ausgeführt
es: No se están ejecutando las comprobaciones {check} en la acción lint {action}
fr: Pas d'exécution de vérifications {check} sur {action}
ja: lint で確認されたアクション {action} に対する {check} チェックは実行されていません

source: obsolete package: {0}
de: Veraltetes Package: {0}
es: paquete obsoleto: {0}
fr: package obsolète : {0}
ja: 廃止されたパッケージ: {0}

source: loop detected in rename: {0}
de: Schleife infolge der Umbenennung erkannt: {0}
es: bucle detectado en cambio de nombre: {0}
fr: boucle détectée dans le nouveau nom attribué : {0}
ja: 名前の変更でループが検出されました: {0}

source: {0} is not set in manifest
de: {0} ist im Manifest nicht festgelegt
es: {0} no se estableció en el manifiesto
fr: {0} n'est pas défini dans le manifeste
ja: {0} はマニフェストで設定されていません

source: {value} is not a valid level
de: {value} ist keine gültiger Ebene.
es: {value} no es un nivel válido
fr: {value} n'est pas un niveau valide
ja: {value} は有効なレベルではありません

source: Logging error: {0}
de: Logging-Fehler: {0}
es: Error de registro: {0}
fr: Erreur de journalisation : {0}
ja: エラーをロギングしています: {0}

source: Linted message: {id} {msg}
de: Lint-Meldung: {id} {msg}
es: Mensaje lint: {id} {msg}
fr: Messages Lint : {id} {msg}
ja: lint で確認されたメッセージ: {id} {msg}

source: checks OpenSolaris packages for common action errors
de: Überprüft OpenSolaris-Pakete auf allgemeine Aktionsfehler
es: consulta los paquetes de OpenSolaris en busca de errores de acción comunes
fr: vérifie que les packages OpenSolaris ne contiennent aucune erreur d'action fréquente
ja: OpenSolaris パッケージに一般的なアクションエラーがないかどうかをチェックします
ru: проверки пакетов OpenSolaris на общие ошибки в действиях

source: checks OpenSolaris packages for common errors
de: Überprüft OpenSolaris-Pakete auf allgemeine Fehler
es: consulta los paquetes de OpenSolaris en busca de errores comunes
fr: vérifie que les packages OpenSolaris ne contiennent aucune erreur fréquente
ja: OpenSolaris パッケージに一般的なエラーがないかどうかをチェックします
ru: проверки пакетов OpenSolaris на общие ошибки

source: Missing attribute '{key}' in {pkg}
de: Fehlendes Attribut '{key}' in {pkg}
es: Falta el atributo '{key}' en {pkg}
fr: Attribut '{key}' manquant dans {pkg}
ja: {pkg} に属性 '{key}' がありません

source: Standard package attributes should be present.
de: Standard-Paketattribute müssen vorhanden sein.
es: Los atributos de paquete estándar deben estar presentes.
fr: Les attributs de package standard doivent être présents.
ja: 標準のパッケージ属性が存在する必要があります。

source: Checks for duplicate IPS actions.
de: Überprüft, ob doppelte IPS-Aktionen vorhanden sind.
es: Comprueba si existen acciones IPS duplicadas.
fr: recherche la présence d'actions IPS dupliquées.
ja: 重複した IPS アクションがないかどうかをチェックします
ru: Проверки на дублированные действия IPS.

source: Seeding reference action duplicates dictionaries.
de: Seeding von Referenzaktion dupliziert Wörterbücher.
es: Preparación de diccionarios de duplicados de acciones de referencia.
fr: Création de dictionnaires de doublons d'action de référence.
ja: 参照用アクション重複辞書の準備をします。
ru: Добавление действия reference вызывает дублирование словарей.

source: Seeding lint action duplicates dictionaries.
de: Seeding von Lint-Aktion dupliziert Wörterbücher.
es: Preparación de diccionarios de duplicados de acciones lint.
fr: Création de dictionnaires de doublons d'action Lint.
ja: lint アクション重複辞書を準備します。
ru: Добавление действия lint вызывает дублирование словарей.

source: Seeding local action duplicates dictionaries.
de: Seeding von lokaler Aktion dupliziert Wörterbücher.
es: Preparación de diccionarios de duplicados de acciones locales.
fr: Création de dictionnaires de doublons d'action locale.
ja: ローカルアクション重複辞書を準備します。
ru: Добавление действия local вызывает дублирование словарей.

source: Paths should be unique.
de: Pfade müssen eindeutig sein.
es: Las rutas deben ser únicas.
fr: Les chemins doivent être uniques.
ja: パスは一意であるべきです。

source: Driver names should be unique.
de: Treibernamen müssen eindeutig sein.
es: Los nombres de controlador deben ser únicos.
fr: Les noms de pilote doivent être uniques.
ja: ドライバ名は一意であるべきです。

source: User names should be unique.
de: Benutzernamen müssen eindeutig sein.
es: Los nombres de usuario deben ser únicos.
fr: Les noms d'utilisateur doivent être uniques.
ja: ユーザー名は一意であるべきです。

source: UIDs should be unique.
de: UIDs müssen eindeutig sein.
es: Los UID deben ser únicos.
fr: Les UID doivent être uniques.
ja: UID は一意であるべきです。

source: Group names should be unique.
de: Gruppennamen müssen eindeutig sein.
es: Los nombres de grupo deben ser únicos.
fr: Les noms de groupe doivent être uniques.
ja: グループ名は一意であるべきです。

source: GIDs should be unique.
de: GIDs müssen eindeutig sein.
es: Los GID deben ser únicos.
fr: Les GID doivent être uniques.
ja: GID は一意であるべきです。

source: {type} action for {attr} is reference-counted but has different attributes across {count} duplicates: {suspects}
de: {type} Aktion für {attr} wird jedes Mal gezählt, enthält jedoch unterschiedliche Attribute in {count} Duplikaten: {suspects}
es: La acción {type} para {attr} presenta un recuento de referencia, pero tiene atributos distintos en {count} duplicados: {suspects}
fr: l'action {type} pour {attr} est comptée par référence mais dispose de différents attributs dans {count} doublons : {suspects}
ja: {attr} の {type} アクションは参照カウントの対象ですが、{count} 個の複製にわたって異なる属性を持っています: {suspects}

source: Duplicated reference counted actions should have the same attrs.
de: Duplizierte Referenzaktionen müssen die gleichen Attribute aufweisen.
es: Las acciones de referencia duplicadas contadas deben tener los mismos atributos.
fr: Les actions comptées par référence en doublon doivent avoir des attributs identiques.
ja: 重複した参照カウントアクションは同じ属性を持つべきです。

source: {attr_name} {name} is a duplicate delivered by {pkgs} under all variant combinations
de: {attr_name} {name} ist ein Duplikat, das von {pkgs} unter allen Variantenkombinationen bereitgestellt wird
es: {attr_name} {name} es un duplicado entregado por {pkgs} en todas las combinaciones de variantes
fr: {attr_name} {name} est un doublon fourni par {pkgs} pour toutes les combinaisons de variantes
ja: {attr_name} {name} は、すべてのバリアントの組み合わせで {pkgs} によってもたらされる複製です

source: {attr_name} {name} is a duplicate delivered by {pkgs} declaring overlapping variants {vars}
de: {attr_name} {name} ist ein Duplikat, das von {pkgs} bereitgestellt wird, die überlappende Varianten {vars} deklarieren
es: {attr_name} {name} es un duplicado entregado por {pkgs} que declara las variantes superpuestas {vars}
fr: {attr_name} {name} est un doublon fourni par {pkgs} déclarant des variantes se recoupant {vars}
ja: {attr_name} {name} は、重複するバリアント {vars} を宣言する {pkgs} によってもたらされる複製です

source: path {path} is delivered by multiple action types across {pkgs}
de: Pfad {path} wird von mehreren Aktionstypen in {pkgs} bereitgestellt
es: la ruta {path} se entrega mediante varios tipos de acción en {pkgs}
fr: le chemin {path} est distribué par plusieurs types d'action dans {pkgs}
ja: パス {path} は、{pkgs} にわたる複数のアクションタイプによってもたらされます

source: Paths should be delivered by one action type only.
de: Pfade dürfen nur von einem Aktionstyp bereitgestellt werden.
es: Las rutas deben ser entregadas por un solo tipo de acción.
fr: Les chemins doivent être fournis par un seul type d'action.
ja: パスは単一のアクションタイプによってのみもたらされるべきです。

source: Overlaying actions should be valid.
de: Überlagerte Aktionen müssen gültig sein.
es: Las acciones superpuestas deben ser válidas.
fr: Les actions de recouvrement doivent être valides.
ja: オーバーレイアクションは有効であるべきです。

source: path {path} uses different mediator namespaces across actions in {fmris}
de: Pfad {path} verwendet unterschiedliche Mediator-Namespaces in Aktionen in {fmris}
es: la ruta {path} utiliza espacios de nombres de mediador diferentes en las acciones en {fmris}
fr: le chemin {path} utilise différents espaces de noms de médiateur dans les actions dans {fmris}
ja: パス {path} は、{fmris} のアクションにわたって異なるメディエータ名前空間を使用しています

source: path {path} has missing mediator attributes across actions in {fmris}
de: In Pfad {path} fehlen Mediatorattribute in Aktionen in {fmris}
es: a la ruta {path} le faltan atributos de mediador en las acciones en {fmris}
fr: le chemin {path} a des attributs de médiateur manquants dans les actions dans {fmris}
ja: パス {path} には、{fmris} のアクションにわたって欠落したメディエータ属性が含まれています

source: path {path} uses multiple action types for potentially mediated links across actions in {fmris}
de: Pfad {path} verwendet mehrere Aktionstypen für potenziell vermittelte Verknüpfungen in Aktionen in {fmris}
es: la ruta {path} utiliza varios tipos de acción para enlaces potencialmente mediados en las acciones en {fmris}
fr: le chemin {path} utilise plusieurs types d'actions pour les liens potentiellement à médiation dans les actions dans {fmris}
ja: パス {path} は、{fmris} のアクションにわたって、調停された可能性のあるリンクで複数のアクションタイプを使用しています

source: Mediated-links should be valid.
de: Vermittlungsglieder sollten gültig sein.
es: Los enlaces mediados deben ser válidos.
fr: Les liens à médiation doivent être valides.
ja: 調停されたリンクが有効であるべきです。

source: path {path} missing 'preserve' attribute for 'overlay=allow' action in {fmri}
de: In Pfad {path} fehlt 'preserve'-Attribut für 'overlay=allow'-Aktion in {fmri}
es: a la ruta {path} le falta el atributo 'preserve' para la acción 'overlay=allow' en {fmri}
fr: dans le chemin {path}, l'attribut 'preserve' pour l'action 'overlay=allow' dans {fmri} est manquant
ja: パス {path} には {fmri} の 'overlay=allow' アクションの 'preserve' 属性がありません

source: path {path} has duplicate 'overlay=true' actions for the following variants across across {fmris}: {var}
de: Pfad {path} enthält doppelte 'overlay=true'-Aktionen für die folgenden Varianten in {fmris}: {var}
es: la ruta {path} tiene acciones 'overlay=true' duplicadas para las siguientes variantes en {fmris}: {var}
fr: le chemin {path} a des actions 'overlay=true' en double pour les variantes suivantes dans {fmris} : {var}
ja: パス {path} には、次のバリアントに関して {fmris} で重複する 'overlay=true' アクションが含まれています: {var}

source: path {path} has duplicate 'overlay=allow' actions for the following variants across across {fmris}: {var}
de: Pfad {path} enthält doppelte 'overlay=allow'-Aktionen für die folgenden Varianten in {fmris}: {var}
es: la ruta {path} tiene acciones 'overlay=allow' duplicadas para las siguientes variantes en {fmris}: {var}
fr: le chemin {path} a des actions 'overlay=allow' en double pour les variantes suivantes dans {fmris} : {var}
ja: パス {path} には、次のバリアントに関して {fmris} で重複する 'overlay=allow' アクションが含まれています: {var}

source: path {path} uses overlay='true' actions but has duplicate 'overlay=allow' actions for the following variants across {fmris}: {vars}
de: Pfad {path} verwendet overlay='true'-Aktionen, enthält jedoch doppelte 'overlay=allow'-Aktionen für die folgenden Varianten in {fmris}: {vars}
es: la ruta {path} utiliza acciones overlay='true', pero tiene acciones 'overlay=allow' duplicadas para las siguientes variantes en {fmris}: {vars}
fr: le chemin {path} utilise des actions 'overlay=true' mais a des actions 'overlay=allow' en double pour les variantes suivantes dans {fmris} : {vars}
ja: パス {path} は overlay='true' アクションを使用しますが、次のバリアントに関して {fmris} で重複する 'overlay=allow' アクションを含んでいます: {vars}

source: path {path} uses 'overlay=true' actions but has no corresponding 'overlay=allow' actions across {fmris}
de: Pfad {path} verwendet 'overlay=true'-Aktionen, enthält aber keine entsprechenden 'overlay=allow'-Aktionen in {fmris}
es: la ruta {path} utiliza acciones 'overlay=true', pero no tiene acciones 'overlay=allow' correspondientes en {fmris}
fr: le chemin {path} utilise des actions 'overlay=true' mais n'a pas d'action 'overlay=allow' correspondante dans {fmris}
ja: パス {path} は 'overlay=true' アクションを使用しますが、対応する 'overlay=allow' アクションが {fmris} にありません

source: path {path} has mismatching attributes for 'overlay=true' and 'overlay=allow' action-pairs across {fmris}
de: Pfad {path} enthält nicht übereinstimmende Attribute für 'overlay=true'- und 'overlay=allow'-Aktionspaare in {fmris}
es: la ruta {path} tiene atributos no coincidentes para los pares de acciones 'overlay=true' y 'overlay=allow' en {fmris}
fr: le chemin {path} a des attributs non concordants pour les couples d'actions 'overlay=true' et 'overlay=allow' dans {fmris}
ja: パス {path} には、{fmris} で一致しない 'overlay=true' アクションと 'overlay=allow' アクションのペアの属性が含まれています

source: path {path} has both overlay and non-overlay actions across {fmris}
de: Pfad {path} enthält sowohl Überlagerungs- als auch Nicht-Überlagerungsaktionen in {fmris}
es: la ruta {path} tiene acciones superpuestas y no superpuestas en {fmris}
fr: le chemin {path} a à la fois des actions de recouvrement et des actions de non-recouvrement dans {fmris}
ja: パス {path} には、{fmris} にわたってオーバーレイアクションと非オーバーレイアクションの両方が含まれています

source: Expecting a dir action for {parent_path}, but {parent_fmri} delivers it as a {parent_type}. {child_path} is delivered by {child_fmri}
de: Es wird eine Verzeichnisaktion für {parent_path} erwartet, {parent_fmri} stellt sie jedoch als {parent_type} bereit. {child_path} wird von {child_fmri} bereitgestellt
es: Se esperaba una acción dir para {parent_path}, pero {parent_fmri} la entrega como {parent_type}. {child_path} se entrega mediante {child_fmri}
fr: Action de répertoire attendue pour {parent_path}, mais {parent_fmri} le fournit sous forme de {parent_type}. {child_path} est fourni par {child_fmri}
ja: {parent_path} 用のディレクトリアクションが予期されていますが、{parent_fmri} はそれを {parent_type} として渡します。{child_path} は {child_fmri} によってもたらされます

source: Parent paths should be directories.
de: Übergeordnete Pfade müssen Verzeichnisse sein.
es: Las rutas principales deben ser directorios.
fr: Les chemins parents doivent être des répertoires.
ja: 親のパスをディレクトリにするようにしてください。

source: Various checks on actions
de: Verschiedene Aktionsüberprüfungen
es: Varias comprobaciones en acciones
fr: Diverses vérifications d'actions
ja: アクションに対するさまざまなチェック
ru: Различные проверки действий

source: Seeding reference action dictionaries.
de: Seeding von Referenzaktion-Wörterbüchern.
es: Preparación de diccionarios de acciones de referencia.
fr: Création de dictionnaires d'actions de référence.
ja: 参照アクション辞書を準備します。

source: Seeding lint action dictionaries.
de: Seeding von Lint-Aktion-Wörterbüchern.
es: Preparación de diccionarios de acciones lint.
fr: Création de dictionnaires d'action lint.
ja: lint アクション辞書を準備します。

source: Seeding local action dictionaries.
de: Seeding von lokaler Aktion für Wörterbücher.
es: Preparación de diccionarios de acciones locales.
fr: Création de dictionnaires d'action locaux.
ja: ローカルアクション辞書を準備します。

source: underscore in attribute name {key} in {fmri}
de: Unterstrich in Attributname {key} in {fmri}
es: carácter de subrayado en el nombre del atributo {key} en {fmri}
fr: le nom d'attribut {key} dans {fmri} contient un trait de soulignement
ja: {fmri} の属性名 {key} に下線が含まれています

source: underscore in obsolete 'set' action name {name} should be {new} in {fmri}
de: Unterstrich in veraltetem 'set'-Aktionsnamen {name}, muss {new} in {fmri} sein
es: carácter de subrayado en nombre de acción 'set' {name} obsoleto, debe ser {new} en {fmri}
fr: le trait de soulignement dans le nom d'action 'set' est obsolète, {name} doit être {new} dans {fmri}
ja: 廃止された 'set' アクション名 {name} に含まれている下線は、{fmri} では {new} であるべきです

source: underscore in 'set' action name {name} in {fmri}
de: Unterstrich in 'set'-Aktionsname {name} in {fmri}
es: carácter de subrayado en nombre de acción 'set' {name} en {fmri}
fr: trait de soulignement dans le nom d'action 'set' {name} dans {fmri}
ja: {fmri} の 'set' アクション名 {name} に下線が含まれています

source: Underscores are discouraged in action attributes.
de: Von Unterstrichen in Aktionsattributen wird abgeraten.
es: Se recomienda no utilizar caracteres de subrayado en atributos de acción.
fr: Les soulignements sont déconseillés dans les attributs d'action.
ja: アクション属性で下線を使用することはお勧めしません。

source: directory action for {path} delivered in {pkg} with mode={mode} that has no executable bits
de: Verzeichnisaktion für {path} in {pkg} mit mode={mode} bereitgestellt, der keine ausführbaren Bit enthält
es: acción de directorio para {path} entregada en {pkg} con mode={mode} sin bits ejecutables
fr: action du répertoire pour {path} fournie dans {pkg} avec mode={mode} sans bits exécutables
ja: {path} に対するディレクトリアクションが、実行可能ビットのない mode={mode} で {pkg} にもたらされました

source: broken mode mode={mode} delivered in action for {path} in {pkg}
de: Unterbrochener Modus mode={mode} in Aktion für {path} in {pkg} bereitgestellt
es: modo dañado mode={mode} entregado en acción para {path} en {pkg}
fr: mode interrompu mode={mode} fourni dans l'action pour {path} dans {pkg}
ja: 不正なモード mode={mode} が、{pkg} の {path} のアクションでもたらされました

source: mode={mode} is too short in action for {path} in {pkg}
de: mode={mode} ist in Aktion für {path} in {pkg} zu kurz
es: mode={mode} es demasiado corto en acción para {path} en {pkg}
fr: mode={mode} est trop court dans l'action pour {path} dans {pkg}
ja: mode={mode} は {pkg} の {path} のアクションでは短すぎます
