Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: To create a repository, use the pkgrepo command.
de: Verwenden Sie zum Erstellen eines Repository den Befehl pkgrepo.
es: Para crear un repositorio, utilice el comando pkgrepo.
fr: Pour créer un référentiel, utilisez la commande pkgrepo.
ja: リポジトリを作成するには、pkgrepo コマンドを使用してください。

source: Unable to copy catalog files: {0}
de: Katalogdateien können nicht kopiert werden: {0}
es: No se puede copiar los archivo de catálogo: {0}
fr: Impossible de copier les fichiers de catalogue : {0}
ja: カタログファイルをコピーできません: {0}

source: The publisher {0} does not exist in the source repository.
de: Der Herausgeber {0} ist nicht im Quell-Repository vorhanden.
es: El editor {0} no existe en el repositorio de origen.
fr: L'éditeur {0} n'existe pas dans le référentiel source.
ja: パブリッシャー {0} がソースリポジトリに存在しません。

source: The following publishers are present in the source repository but not in the target repository. Please use -p to specify which publishers need to be cloned or -p '*' to clone all publishers.
de: Die folgenden Herausgeber sind im Quell-Repository, aber nicht im Ziel-Repository vorhanden. Geben Sie mit -p an, welche Herausgeber geklont werden sollen, oder verwenden Sie -p '*', um alle Herausgeber zu klonen.
es: Los siguientes editores están presentes en el repositorio de origen, pero no en el repositorio de destino. Use -p para especificar los editores que se deben clonar o -p '*' para clonar todos los editores.
fr: Les éditeurs suivants sont présents dans le référentiel source mais pas dans le référentiel cible. Utilisez -p pour spécifier les éditeurs à cloner ou -p '*' pour cloner tous les éditeurs.
ja: 次のパブリッシャーがソースリポジトリに存在しますが、ターゲットリポジトリに存在しません。 -p を使用してクローニングする必要があるパブリッシャーを指定するか、-p '*' を使用してすべてのパブリッシャーをクローニングしてください。

source: Adding publisher {0} ...
de: Herausgeber {0} wird hinzugefügt ...
es: Agregando editor {0}...
fr: Ajout de l'éditeur {0} ...
ja: パブリッシャー {0} を追加しています...

source: Adding publisher {0} (dry-run) ...
de: Herausgeber {0} wird hinzugefügt (Probelauf) ...
es: Agregando editor {0} (ejecución simulada)...
fr: Ajout de l'éditeur {0} (test) ...
ja: パブリッシャー {0} を追加しています (予行演習)

source: Processing packages for publisher {0} ...
de: Pakete für Herausgeber {0} werden verarbeitet...
es: Procesando paquetes para el editor {0}...
fr: Traitement des packages pour l'éditeur {0}...
ja: パブリッシャー {0} のパッケージを処理しています...

source: Removing packages ...
de: Packages werden entfernt ...
es: Eliminando paquetes...
fr: Suppression des packages ...
ja: パッケージを削除しています...

source: No packages to add.
de: Keine hinzuzufügenden Packages vorhanden.
es: No hay paquetes para agregar.
fr: Aucun package à ajouter.
ja: 追加するパッケージはありません。

source: Reading Manifests
de: Manifeste werden gelesen
es: Leyendo manifiestos
fr: Lecture des manifestes
ja: マニフェストを読み取っています

source: Unable to copy manifest: {0}
de: Manifest: {0} kann nicht kopiert werden
es: No se puede copiar el manifiesto: {0}
fr: Impossible de copier le manifeste : {0}
ja: マニフェストをコピーできません: {0}

source: Retrieving packages ...
de: Packages werden abgerufen...
es: Recuperando paquetes...
fr: Extraction de packages...
ja: パッケージを取得しています...

source: Retrieving packages (dry-run) ...
de: Packages werden abgerufen (Probelauf) ...
es: Recuperando paquetes (ejecución simulada)...
fr: Extraction de packages (test)...
ja: パッケージを取得しています (予行演習)...

source: Packages to transfer:
de: Zu übertragende Packages:
es: Paquetes que transferir:
fr: Packages à transférer :
ja: 転送するパッケージ:

source: Verifying repository contents.
de: Repository-Inhalt wird überprüft.
es: Verificando contenido de repositorio.
fr: Vérification du contenu du référentiel.
ja: リポジトリの内容を検証しています。

source: Unable to remove catalog files: {0}
de: Katalogdateien können nicht entfernt werden: {0}
es: No se puede eliminar archivos de catálogo: {0}
fr: Impossible de supprimer les fichiers de catalogue : {0}
ja: カタログファイルを削除できません: {0}

source: Pkgrepo verify found errors in the updated repository. The original package catalog has been restored.
de: Bei der Pkgrepo-Überprüfung wurden Fehler im aktualisierten Repository gefunden. Der Originalpackagekatalog wurde wiederhergestellt.
es: La verificación de Pkgrepo encontró errores en el repositorio actualizado. Se ha restaurado el catálogo de paquete original.
fr: Pkgrepo verify a détecté des erreurs dans le référentiel mis à jour. Le catalogue d'origine du package a été restauré.
ja: パッケージリポジトリの検証で、更新されたリポジトリ内にエラーが見つかりました。 元のパッケージカタログが復元されました。

source: Deleted packages can not be restored.
de: Gelöschte Packages können nicht wiederhergestellt werden.
es: No es posible restaurar los paquetes suprimidos.
fr: Des packages supprimés ne peuvent pas être restaurés.
ja: 削除されたパッケージを復元できません。

source: The clone operation can be retried; package content that has already been retrieved will not be downloaded again.
de: Der Klonvorgang kann wiederholt werden. Bereits abgerufener Packageinhalt wird nicht erneut heruntergeladen.
es: Puede reintentar la operación de clonación; el contenido del paquete que ya se haya recuperado no se volverá a descargar.
fr: L'opération de clonage peut être retentée ; le contenu de package déjà récupéré ne sera pas téléchargé une seconde fois.
ja: クローン操作を再試行できます。すでに取得されているパッケージ内容は再度ダウンロードされません。

source: The search index for the following publishers has been removed due to package removals.
de: Der Suchindex für die folgenden Herausgeber wurde entfernt, weil Packages entfernt wurden.
es: Se ha eliminado el índice de búsqueda para los siguientes editores debido a las eliminaciones de paquetes.
fr: L'index de recherche des éditeurs suivants a été supprimé en raison de la suppression de packages.
ja: パッケージが削除されたため、次のパブリッシャーの検索インデックスが削除されました。

source: To restore the search index for all publishers run 'pkgrepo refresh --no-catalog -s {0}'.
de: Um den Suchindex für alle Herausgeber wiederherzustellen, führen Sie 'pkgrepo refresh --no-catalog -s {0}' aus.
es: Para restaurar el índice de búsqueda para todos los editores, ejecute 'pkgrepo refresh --no-catalog -s {0}'.
fr: Pour restaurer l'index de recherche pour tous les éditeurs, exécutez 'pkgrepo refresh --no-catalog -s {0}'.
ja: すべてのパブリッシャーの検索インデックスを復元するには、 'pkgrepo refresh --no-catalog -s {0}' を実行します。

source: --newest takes no options
de: --newest akzeptiert keine Optionen
es: --newest no lleva opciones
fr: -newest n'accepte pas d'option
ja: --newest はオプションを取りません

source: The repository configuration for the repository located at '{0}' is not valid or the specified path does not exist. Please correct the configuration of the repository or create a new one.
de: Die Repository-Konfiguration für das Repository in '{0}' ist nicht gültig oder der angegebene Pfad ist nicht vorhanden. Korrigieren Sie die Konfiguration des Repository oder erstellen Sie ein neues.
es: La configuración del repositorio ubicado en '{0}' no es válida o la ruta especificada no existe. Corrija la configuración del repositorio o cree uno nuevo.
fr: La configuration de référentiel pour le référentiel situé à '{0}' n'est pas valideou le chemin spécifié n'existe pas. Corrigez la configuration duréférentiel ou créez-en un nouveau.
ja: '{0}' にあるリポジトリの構成が無効か、指定したパスが存在しません。リポジトリの構成を修正するか、新しいリポジトリを作成してください。

source: Unable to create basedir '{dir}': {err}
de: basedir '{dir}' kann nicht erstellt werden: {err}
es: No se puede crear el directorio base '{dir}': {err}
fr: Impossible de créer '{dir}': {err}
ja: basedir '{dir}' を作成できません: {err}

source: Storage space quota exceeded.
de: Speicherplatzkontingent überschritten.
es: Se excedió la cuota de espacio de almacenamiento.
fr: Quota d'espace de stockage dépassé.
ja: ストレージスペースの割り当て制限を超えています。

source: No storage space left.
de: Kein Speicherplatz verfügbar.
es: No queda espacio de almacenamiento.
fr: Il ne subsiste pas d'espace de stockage.
ja: ストレージスペースが残っていません。

source: Please verify that the filesystem containing the following directories has enough space available: {0}
de: Überprüfen Sie, ob das Dateisystem mit den folgenden Verzeichnissen über genügend Speicherplatz verfügt: {0}
es: Verifique que el sistema de archivos que contiene los siguientes directorios tenga suficiente espacio disponible: {0}
fr: Assurez-vous que le système de fichiers contenant les répertoires suivants dispose de suffisamment d'espace : {0}
ja: 次のディレクトリを含むファイルシステムに十分な空きスペースがあることを確認してください。: {0}

source: This script can only be invoked by RAD
de: Dieses Skript kann nur von RAD aufgerufen werden
es: Esta secuencia de comandos solo se puede llamar mediante RAD
fr: Ce script peut uniquement être appelé par RAD
ja: このスクリプトは RAD によってのみ起動できます

source: unknown option {0} in file: {1}
de: Unbekannte Option {0} in Datei: {1}
es: opción desconocida {0} en el archivo: {1}
fr: option inconnue {0} dans le fichier : {1}
ja: ファイル内の不明なオプション {0}: {1}

source: illegal global option -- {0} in file: {1}
de: Unzulässige globale Option -- {0} in Datei: {1}
es: opción global no permitida: {0} {1}
fr: option générale non admise -- {0} dans le fichier : {1}
ja: ファイル内の不明なグローバルオプション -- {0}: {1}

source: invalid option argument: {0} in file: {1}
de: Ungültiges Optionsargument {0} in Datei: {1}
es: argumento de opción no válido: {0} en el archivo: {1}
fr: argument d'option non valide : {0} dans le fichier : {1}
ja: ファイル内の無効なオプション引数: {0}: {1}

source: missing argument in file: {0}
de: Fehlendes Argument in Datei: {0}
es: argumento faltante en el archivo: {0}
fr: argument manquant dans le fichier : {0}
ja: ファイル内に引数がありません: {0}

source: Usage: pkgsign -s path_or_uri [-acikn] [--no-index] [--no-catalog] (fmri|pattern) ...
de: Syntax: pkgsign -s path_or_uri [-acikn] [--no-index] [--no-catalog] (fmri|pattern) ...
es: Sintaxis: pkgsign -s path_or_uri [-acikn] [--no-index] [--no-catalog] (fmri|pattern) ...
fr: Syntaxe : pkgsign -s path_or_uri [-acikn] [--no-index] [--no-catalog] (fmri|pattern) ...
ja: 使用方法: pkgsign -s path_or_uri [-acikn] [--no-index] [--no-catalog] (fmri|pattern) ...

source: The file {0} was expected to be a PEM certificate but it could not be read.
de: Es wurde erwartet, dass die Datei {0} ein PEM-Zertifikat ist. Die Datei konnte jedoch nicht gelesen werden.
es: Se esperaba que el archivo {0} fuera un certificado PEM pero no se ha podido leer.
fr: Le fichier {0} devait être un certificat PEM mais il n'a pas pu être lu.
ja: ファイル {0} は PEM 証明書のはずでしたが、読み取れませんでした。

source: {0} was expected to be a certificate but isn't a file.
de: Es wurde erwartet, dass {0} ein Zertifikat ist, es handelt sich jedoch um keine Datei.
es: Se esperaba que {0} fuera un certificado, pero no es un archivo.
fr: {0} devait être un certificat mais il ne s'agit pas d'un fichier.
ja: {0} は証明書のはずでしたが、ファイルではありません。

source: {0} was expected to be a key file but isn't a file.
de: Es wurde erwartet, dass {0} eine Schlüsseldatei ist, es handelt sich jedoch nicht um eine Datei.
es: Se esperaba que {0} fuera un archivo de claves, pero no es un archivo.
fr: {0} devait être un fichier de clés mais il ne s'agit pas d'un fichier.
ja: {0} はキーファイルのはずでしたが、ファイルではありません。

source: a repository must be provided
de: Ein Repository muss angegeben werden
es: se debe proporcionar un repositorio
fr: un référentiel doit être indiqué
ja: リポジトリを指定する必要があります

source: If a key is given to sign with, its associated certificate must be given.
de: Wenn ein Signaturschlüssel angegeben wird, muss auch das dazugehörige Zertifikat angegeben werden.
es: Si se proporciona una clave para firmar, también debe proporcionarse el certificado asociado a dicha clave.
fr: Si une clé est fournie pour la signature, le certificat auquel elle est associée doit également être fourni.
ja: 署名に使用するキーを指定する場合は、それに関連付けられた証明書を指定する必要があります。
ru: При предоставлении ключа для подписи необходимо указать связанный с ним сертификат.

source: If a certificate is given, its associated key must be given.
de: Wenn ein Zertifikat angegeben wird, muss auch der dazugehörige Schlüssel angegeben werden.
es: Si se proporciona un certificado, también debe proporcionarse la clave asociada a éste.
fr: Si un certificat est fourni, la clé à laquelle il est associé doit également être fournie.
ja: 証明書を指定する場合は、それに関連付けられたキーを指定する必要があります。
ru: При предоставлении сертификата необходимо указать связанный с ним ключ.

source: Intermediate certificates are only valid if a key and certificate are also provided.
de: Zwischenzertifikate sind nur gültig, wenn auch ein Schlüssel und ein Zertifikat angegeben werden.
es: Los certificados intermedios son válidos solamente si también se proporciona una clave y un certificado.
fr: Les certificats intermédiaires ne sont valides que si une clé et un certificat sont également fournis.
ja: 中間証明書は、キーと証明書も指定されている場合のみ有効です。
ru: Промежуточные сертификаты действительны только при предоставлении ключа и сертификата.

source: At least one fmri or pattern must be provided to sign.
de: Mindestens ein FMRI oder Muster muss zum Signieren angegeben werden.
es: Por lo menos se debe proporcionar un fmri o un modelo para firmar.
fr: Au moins un fmri ou modèle doit être fourni pour signer.
ja: 署名用の FMRI またはパターンを少なくとも 1 つ指定する必要があります。

source: {0} is not a recognized signature algorithm.
de: {0} ist kein erkannter Signaturalgorithmus.
es: {0} no es un algoritmo de firma reconocido.
fr: {0} n'est pas un algorithme de signature reconnu.
ja: {0} は認識できない署名アルゴリズムです。

source: Using {0} as the signature algorithm requires that a key and certificate pair be presented using the -k and -c options.
de: Die Verwendung von {0} als Signaturalgorithmus erfordert, dass mithilfe der Optionen -k und -c ein Schlüssel und ein dazugehöriges Zertifikat angegeben wird.
es: Si se utiliza {0} como algoritmo de firma, debe indicarse una clave y un certificado mediante las opciones -k y -c.
fr: L'utilisation de {0} en tant qu'algorithme de signature nécessite l'introduction d'une paire clé/certificat à l'aide des options -k et -c.
ja: {0} を署名アルゴリズムとして使用するには、-k オプションと -c オプションでキーと証明書のペアを指定する必要があります。

source: The {0} hash algorithm does not use a key or certificate. Do not use the -k or -c options with this algorithm.
de: Der Hash-Algorithmus {0} verwendet keinen Schlüssel und kein Zertifikat. Verwenden Sie bei diesem Algorithmus nicht die Optionen -k oder -c.
es: El algoritmo hash {0} no utiliza una clave o un certificado. No utilice las opciones -k o -c con este algoritmo.
fr: L'algorithme de hachage {0} n'utilise pas de clé ni de certificat. N'utilisez pas l'option -k ni l'option -c avec cet algorithme.
ja: {0} ハッシュアルゴリズムはキーや証明書を使用しません。このアルゴリズムでは -k オプションや -c オプションを使用しないでください。

source: Signed {0}
de: Signiert {0}
es: {0} firmado
fr: {0} signé
ja: 署名付き {0}

source: Usage: pkg.sysrepo -p <port> [-R image_root] [ -c cache_dir] [-h hostname] [-l logs_dir] [-r runtime_dir] [-s cache_size] [-t template_dir] [-T http_timeout] [-w http_proxy] [-W https_proxy]
de: Verwendung: pkg.sysrepo -p <port> [-R image_root] [ -c cache_dir] [-h hostname] [-l logs_dir] [-r runtime_dir] [-s cache_size] [-t template_dir] [-T http_timeout] [-w http_proxy] [-W https_proxy]
es: Sintaxis: pkg.sysrepo -p <port> [-R image_root] [ -c cache_dir] [-h hostname] [-l logs_dir] [-r runtime_dir] [-s cache_size] [-t template_dir] [-T http_timeout] [-w http_proxy] [-W https_proxy]
fr: Syntaxe : pkg.sysrepo -p <port> [-R image_root] [ -c cache_dir] [-h hostname] [-l logs_dir] [-r runtime_dir] [-s cache_size] [-t template_dir] [-T http_timeout] [-w http_proxy] [-W https_proxy]
ja: 使用方法: pkg.sysrepo -p <port> [-R image_root] [ -c cache_dir] [-h hostname] [-l logs_dir] [-r runtime_dir] [-s cache_size] [-t template_dir] [-T http_timeout] [-w http_proxy] [-W https_proxy]

source: Problem getting image at {0}
de: Problem beim Abrufen des Abbildes unter {0}
es: Problema para obtener imagen en {0}
fr: Problème lors de l'obtention de l'image depuis {0}
ja: {0} でイメージを取得する際に問題が発生しました

source: WARNING: unable to access {uri} when checking for redirects: {err}
de: WARNING: Zugriff auf {uri} bei Prüfung auf Umleitungen nicht möglich: {err}
es: ADVERTENCIA: No se puede acceder a {uri} al verificar redirecciones: {err}
fr: AVERTISSEMENT : impossible d'accéder à {uri} lors de la vérification des redirections : {err}
ja: 警告: リダイレクトのチェック時に {uri} にアクセスできません: {err}

source: Invalid config cache file at {0} generating fresh configuration.
de: Ungültige Konfigurationscachedatei bei {0} generiert Neukonfiguration.
es: Archivo de caché de configuración no válido en {0}; generando nueva configuración.
fr: Fichier de cache de configuration non valide à l'emplacement {0} génère une nouvelle configuration.
ja: 新規構成の生成時に、無効な構成キャッシュファイルが {0} にあります。

source: Invalid config cache at {0} generating fresh configuration.
de: Ungültige Konfigurationscachedatei bei {0} generiert Neukonfiguration.
es: Caché de configuración no válida en {0}; generando nueva configuración.
fr: Cache de configuration non valide à l'emplacement {0} génère une nouvelle configuration.
ja: 新規構成の生成時に、無効な構成キャッシュが {0} にあります。

source: Unable to load config from {cache_path}: {e}
de: Konfiguration kann nicht aus {cache_path} geladen werden: {e}
es: No se puede cargar la configuración desde {cache_path}: {e}
fr: Impossible de charger la configuration depuis {cache_path} : {e}
ja: {cache_path} から構成をロードできません: {e}

source: Unable to store config to {cache_path}: {e}
de: Konfiguration kann nicht in {cache_path} gespeichert werden: {e}
es: No se puede almacenar la configuración en {cache_path}: {e}
fr: Impossible de stocker la configuration dans {cache_path} : {e}
ja: {cache_path} に構成を格納できません: {e}

source: file repository {0} does not exist or is not accessible
de: Datei-Repository {0} existiert nicht oder ist nicht verfügbar
es: el repositorio de archivos {0} no existe o no se puede acceder a él
fr: le référentiel de fichiers {0} n'existe pas ou n'est pas accessible
ja: ファイルリポジトリ {0} が存在しないか、アクセスできません

source: file repository {0} cannot be proxied. Only file repositories of version 4 or later are supported.
de: Datei-Repository {0} kann nicht mit einem Proxy versehen werden. Nur Datei-Repositorys mit Version 4 oder höher werden unterstützt.
es: El repositorio de archivos {0} no se puede redirigir mediante proxy. Sólo se admiten repositorios de archivos versión 4, o posterior.
fr: le référentiel de fichiers {0} ne peut pas être pourvu d'un proxy. Seuls les référentiels de fichiers de version 4 ou ultérieure sont pris en charge.
ja: ファイルリポジトリ {0} をプロキシ設定できません。バージョン 4 以降のファイルリポジトリのみがサポートされています。

source: unable to read p5p archive file at {0}
de: p5p-Archivdatei kann nicht gelesen werden in {0}
es: no se puede leer el archivo de almacenamiento p5p en {0}
fr: Impossible de lire le fichier d'archive p5p à l'emplacement {0}
ja: {0} にある p5p アーカイブファイルを読み取れません

source: Unable to chown to {user}:{group}: {err}
de: Änderung in {user}:{group} nicht möglich: {err}
es: No se puede cambiar el propietario a {user}:{group}: {err}
fr: Echec de chown pour {user}:{group} : {err}
ja: {user}:{group} への chown を行えません: {err}

source: scheme must be http
de: Schema muss http sein
es: el esquema debe ser http
fr: le schéma doit être http
ja: スキームは http でなければなりません

source: invalid {key}: {val}: {err}
de: {key} ungültig: {val}: {err}
es: {key} no válida: {val}: {err}
fr: {key} non valide : {val} : {err}
ja: 無効な {key}: {val}: {err}

source: Unable to write sysrepo_httpd.conf: {host}: {err}
de: sysrepo_httpd.conf kann nicht geschrieben werden: {host}: {err}
es: No se puede escribir sysrepo_httpd.conf: {host}: {err}
fr: Impossible d'écrire sysrepo_httpd.conf : {host} : {err}
ja: sysrepo_httpd.conf を書き込めません: {host}: {err}

source: Unable to write sysrepo_httpd.conf: {0}
de: sysrepo_httpd.conf kann nicht gelöscht werden: {0}
es: No se puede escribir sysrepo_httpd.conf: {0}
fr: Impossible d'écrire sysrepo_httpd.conf : {0}
ja: sysrepo_httpd.conf を書き込めません: {0}

source: unable to write crypto.txt file: {0}
de: crypto.txt file kann nicht geschrieben werden: {0}
es: no se puede escribir el archivo crypto.txt: {0}
fr: impossible d'écrire le fichier crypto.txt : {0}
ja: crypto.txt ファイルを書き込めません: {0}

source: unable to write publisher response: {0}
de: Herausgeberantwort kann nicht geschrieben werden: {0}
es: no se puede escribir la respuesta del editor: {0}
fr: impossible d'écrire la réponse de l'éditeur : {0}
ja: パブリッシャーの応答を書き込めません: {0}

source: Unable to write syspub response: {0}
de: syspub-Antwort kann nicht geschrieben werden: {0}
es: No se puede escribir la respuesta syspub: {0}
fr: Impossible d'écrire la réponse de syspub : {0}
ja: syspub の応答を書き込めません: {0}

source: Unable to cleanup old configuration: {0}
de: Bereinigung der alten Konfiguration nicht möglich: {0}
es: No se puede eliminar la configuración anterior: {0}
fr: Impossible de nettoyer l'ancienne configuration : {0}
ja: 古い構成をクリーンアップできません: {0}

source: invalid value for http_timeout: {0}
de: Ungültiger Wert für http_Zeitüberschreitung: {0}
es: valor no válido para http_timeout: {0}
fr: valeur non valide pour http_timeout : {0}
ja: http_timeout の値が無効です: {0}

source: http_timeout must a positive integer
de: http_Zeitüberschreitung muss eine positive ganze Zahl sein
es: http_timeout debe ser un número entero positivo
fr: http_timeout doit être un entier positif
ja: http_timeout は正の整数でなければなりません

source: unable to get publisher information: {0}
de: Herausgeberinformation kann nicht abgerufen werden: {0}
es: no se puede obtener información del editor: {0}
fr: impossible d'obtenir les informations sur l'éditeur : {0}
ja: パブリッシャーの情報を取得できません: {0}

source: unable to create htdocs dir: {0}
de: htdocs dir kann nicht erstellt werden: {0}
es: no se puede crear el directorio htdocs: {0}
fr: impossible de créer le répertoire htdocs : {0}
ja: htdocs ディレクトリを作成できません: {0}

source: required port option missing.
de: Erforderliche Portoption fehlt.
es: falta la opción de puerto requerida
fr: option de port requise manquante.
ja: 必須のポートオプションがありません。

source: The sysrepo command appears out of sync with the libraries provided by pkg:/package/pkg. The client version is {client} while the library API version is {api}.
de: Der sysrepo-Befehl stimmt nicht mit den von pkg:/package/pkg angegebenen Bibliotheken überein. Die Clientversion ist {client} und die Bibliotheks- API-Version ist {api}.
es: El comando sysrepo aparece desincronizado con las bibliotecas proporcionadas por pkg:/package/pkg. La versión de cliente es {client} y la versión de la API de biblioteca es {api}.
fr: La commande sysrepo n'est pas synchronisée avec les bibliothèques fournies par pkg :/package/pkg. La version client est {client}, tandis que la version de l'API de la bibliothèque est {api}.
ja: sysrepo コマンドは、pkg:/package/pkg で提供されているライブラリと同期が取れていない ようです。クライアントのバージョンが {client} であるのに対して、ライブラリ API のバージョンは {api} です。

source: Usage: pkgdiff [-i attribute]... [-o attribute] [-t action_name[,action_name]...]... [-v name=value]... (file1 | -) (file2 | -)
de: Syntax: pkgdiff [-i attribute]... [-o attribute] [-t action_name[,action_name]...]... [-v name=value]... (file1 | -) (file2 | -)
es: Sintaxis: pkgdiff [-i attribute]... [-o attribute] [-t action_name[,action_name]...]... [-v name=value]... (file1 | -) (file2 | -)
fr: Syntaxe : pkgdiff [-i attribute]... [-o attribute] [-t action_name[,action_name]...]... [-v name=value]... (file1 | -) (file2 | -)
ja: 使用方法: pkgdiff [-i attribute]... [-o attribute] [-t action_name[,action_name]...]... [-v name=value]... (file1 | -) (file2 | -)

source: variant option incorrect {0}
de: Falsche Variantenoption {0}
es: opción de variante incorrecta {0}
fr: option de variante incorrecte {0}
ja: バリアントオプションが不正です {0}

source: two manifest arguments are required
de: zwei Manifestargumente sind erforderlich
es: se necesitan dos argumentos de manifiesto
fr: deux arguments de manifeste sont requis
ja: マニフェストの引数は 2 つ必要です

source: only one manifest argument can be stdin
de: nur ein Manifestargument kann stdin sein
es: sólo un argumento de manifiesto puede ser stdin
fr: un seul des arguments de manifeste peut être stdin
ja: 標準入力できるマニフェストの引数は 1 つだけです
