Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Try specifying expected versions to obtain more detailed error messages.
de: Geben Sie die erwarteten Versionen an, um ausführlichere Fehlermeldungen zu erhalten.
es: Intente especificar las versiones esperadas para obtener mensajes de error más detallados.
fr: Tentez de spécifier les versions attendues afin de fournir des messages d'erreur plus détaillés.
ja: 予期されるバージョンを指定して、さらに詳細なエラーメッセージを取得してください。

source: Uninstalled fmri {0} can only be installed if explicitly requested
de: Deinstallierte fmri {0} kann nur installiert werden, wenn dies explizit angefordert wird
es: El fmri {0} desinstalado solo se puede instalar si se solicita explícitamente
fr: Le fmri non installé {0} peut uniquement être installé s'il est explicitement requis
ja: アンインストールされた fmri {0} は、明示的に要求された場合のみインストールできます

source: Excluded by proposed incorporation '{0}'
de: Durch vorgeschlagene Inkorporation '{0}' ausgeschlossen
es: Excluido por la incorporación propuesta '{0}'
fr: Exclu par l'incorporation proposée '{0}'
ja: 提示された incorporation '{0}' から除外されます

source: Excluded by synced parent incorporation '{0}'
de: Von synchronisierter übergeordneter Inkorporation '{0}' ausgeschlossen
es: Excluido por la incorporación de elemento principal sincronizada '{0}'
fr: Exclus par l'incorporation parent synchronisée '{0}'
ja: 同期された親 incorporation '{0}' によって除外されました

source: Package contains 'exclude' dependency {0} on installed package
de: Paket enthält die 'exclude'-Abhängigkeit {0} vom installierten Paket
es: El paquete contiene la dependencia 'exclude' {0} en el paquete instalado
fr: Le package contient la dépendance 'exclude' {0} sur le package installé
ja: インストールされたパッケージに 'exclude' 依存関係の {0} が含まれています

source: Package contains 'exclude' dependency {0} on proposed package
de: Package enthält die "exclude"-Abhängigkeit {0} vom vorgeschlagenen Package
es: El paquete contiene la dependencia 'exclude' {0} en el paquete que se propone.
fr: Le package contient la dépendance 'exclude' {0} sur le package proposé
ja: パッケージに、提案されたパッケージに対する 'exclude' 依存関係 {0} が含まれています

source: No version allowed by 'exclude' dependency {0} could be installed
de: Es konnte keine für "exclude"-Abhängigkeit {0} zulässige Version installiert werden
es: No se pudo instalar ninguna versión permitida por la dependencia 'exclude' {0}.
fr: Aucune version autorisée par la dépendance 'exclude' {0} n'a pu être installée
ja: 'exclude' 依存関係 {0} によって許可されたバージョンをインストールできませんでした

source: All acceptable versions of '{0}' dependency on {1} are obsolete
de: Alle zulässigen Versionen mit '{0}'-Abhängigkeit von {1} sind veraltet
es: Todas las versiones aceptables de la dependencia '{0}' en {1} son obsoletas
fr: Toutes les versions acceptables de la dépendance '{0}' sur {1} sont obsolètes
ja: {1} で許容される '{0}' 依存関係のすべてのバージョンが廃止されています

source: All acceptable versions of '{0}' dependencies on {1} are obsolete
de: Alle zulässigen Versionen mit '{0}'-Abhängigkeiten von {1} sind veraltet
es: Todas las versiones aceptables de las dependencias '{0}' en {1} son obsoletas
fr: Toutes les versions acceptables des dépendances '{0}' sur {1} sont obsolètes
ja: {1} で許容される '{0}' 依存性のすべてのバージョンが廃止されています

source: No version for '{0}' dependency on {1} can be found
de: Keine Version der "{0}"-Abhängigkeit von {1} gefunden
es: No se puede encontrar ninguna versión para la dependencia '{0}' en {1}.
fr: Aucune version pour la dépendance '{0}' trouvée sur {1}
ja: {1} で '{0}' 依存関係のバージョンが見つかりません

source: Rejected by '{0}' dependency in proposed package '{1}'
de: Von "{0}"-Abhängigkeit in vorgeschlagenem Package "{1}" abgelehnt
es: Rechazo efectuado por dependencia de '{0}' en el paquete propuesto '{1}'
fr: Rejeté par la dépendance '{0}' dans le package proposé '{1}'
ja: 提示されたパッケージ '{1}' の依存関係 '{0}' によって拒否されました

source: No version matching '{0}' dependency {1} can be installed
de: Keine Version, die der "{0}"-Abhängigkeit {1} entspricht, kann installiert werden
es: No se puede instalar ninguna versión que coincida con la dependencia '{0}' en {1}.
fr: Aucune version correspondant à la dépendance '{0}' {1} ne peut être installée
ja: '{0}' 依存関係 {1} に一致するバージョンはインストールできません

source: No suitable version of installed package {0} found
de: Keine geeignete Version des installierten Package {0} gefunden
es: No se encontró ninguna versión adecuada del paquete instalado {0}.
fr: Aucune version adaptée du package {0} installé n'a été trouvée
ja: インストールされているパッケージ {0} の適切なバージョンが見つかりません

source: to
de: bis
es: a
fr: à
ja: から

source: {0} Reject:
de: {0} ablehnen:
es: {0} Rechazo:
fr: Refuser {0} :
ja: {0} 拒否:

source: Reason:
de: Ursache:
es: Motivo:
fr: Raison :
ja: 理由:

source: {indent} {tag} [already rejected; see above]
de: {indent} {tag} [bereits abgelehnt; siehe oben]
es: {indent} {tag} [ya se rechazó; ver arriba]
fr: {indent} {tag} [déjà refusé, voir ci-dessus]
ja: {indent} {tag} [すでに拒否されています。上記を参照]

source: No suitable version of required package {0} found:
de: Keine geeignete Version des erforderlichen Package {0} gefunden:
es: No se encontró ninguna versión adecuada del paquete requerido {0}:
fr: Aucune version adaptée du package {0} requis n'a été trouvée :
ja: 必要なパッケージ {0} の適切なバージョンが見つかりません:

source: List of integers, not {0}, expected
de: Eine Liste von Ganzzahlen wurde erwartet, nicht {0}
es: Se espera lista de números enteros, no {0}
fr: Une liste d'entiers, pas {0}, est attendue
ja: {0} ではなく整数のリストが予期されます

source: Currently installed package '{0}' is from sticky publisher '{1}'.
de: Derzeit installiertes Paket '{0}' stammt vom Sticky-Herausgeber '{1}'.
es: El paquete '{0}' instalado actualmente pertenece al editor permanente '{1}'.
fr: Le package actuellement installé '{0}' provient de l'éditeur résident '{1}'.
ja: 現在インストールされているパッケージ '{0}' は固定的なパブリッシャー '{1}' からのものです。

source: Package is from publisher other than specified one.
de: Paket ist von einem anderen Herausgeber als dem angegebenen.
es: El paquete pertenece a un editor distinto del especificado.
fr: Le package provient d'un éditeur autre que celui spécifié.
ja: パッケージは指定されたパブリッシャーではないパブリッシャーからのものです。

source: Higher ranked publisher {0} was selected
de: Herausgeber höherer Priorität {0} ausgewählt
es: Se seleccionó el editor {0} de jerarquía superior
fr: L'éditeur mieux classé {0} a été sélectionné
ja: より高くランク付けされているパブリッシャー {0} が選択されました

source: Package publisher is ranked lower in search order
de: Paketherausgeber hat in der Suchreihenfolge eine niedrigere Priorität
es: El editor del paquete ha descendido en la jerarquía de orden de búsqueda
fr: L'éditeur du package apparaît plus bas dans l'ordre de la recherche
ja: パッケージのパブリッシャーは、検索の順位でより低くランク付けされています

source: Newer version {0} is already installed
de: Es ist bereits eine neuere Version von {0} installiert
es: Ya está instalada una versión más reciente de {0}
fr: Une version plus récente de {0} est déjà installée
ja: より新しいバージョン {0} がすでにインストール済みです

source: Package doesn't support image architecture
ca: El paquet no suporta l'arquitectura de l'imatge
de: Paket unterstützt die Abbildarchitektur nicht
es: El paquete no admite la arquitectura de imagen
fr: Le package ne prend pas en charge l'architecture de l'image.
ja: パッケージはイメージ構造をサポートしていません
ru: Пакет не поддерживает архитектуру образа

source: Package supports image variant {0}={1} but doesn't support this image's {0}={2}
de: Package unterstützt Imagevariante {0}={1}, unterstützt jedoch {0}={2} des Images nicht
es: El paquete admite la variante de imagen {0}={1}, pero no admite {0}={2} de esta imagen
fr: Le package prend en charge la variante de l'image {0}={1} mais ne prend pas en charge les éléments {0}={2} de cette image
ja: パッケージはイメージバリアント {0}={1} をサポートしていますが、このイメージの {0}={2} はサポートしていません

source: Package {0} is not installed in global zone.
de: Package {0} ist nicht in der globalen Zone installiert.
es: El paquete {0} no está instalado en la zona global.
fr: Le package {0} n'est pas installé dans la zone globale.
ja: パッケージ {0} が大域ゾーンにインストールされていません。

source: Package {0} is not installed in parent image.
de: Package {0} ist nicht im übergeordneten Abbild installiert.
es: El paquete {0} no está instalado en la imagen principal.
fr: Le package {0} n'est pas installé dans l'image parente.
ja: パッケージ {0} が親イメージにインストールされていません。

source: Package in global zone is from a different publisher: {0}
de: Package in globaler Zone stammt von einem anderen Herausgeber: {0}
es: El paquete en la zona global proviene de un editor diferente: {0}
fr: Le package dans la zone globale provient d'un éditeur différent : {0}
ja: 大域ゾーンに含まれているパッケージが別のパブリッシャーによるものです: {0}

source: Global zone has a newer version: {0}
de: Globale Zone hat eine neuere Version: {0}
es: La zona global tiene una nueva versión: {0}
fr: La zone globale a une version plus récente : {0}
ja: 大域ゾーンに新しいバージョンが含まれています: {0}

source: Parent image has a newer version: {0}
de: Übergeordnetes Abbild hat eine neuere Version: {0}
es: La imagen principal tiene una nueva versión: {0}
fr: L'image parente a une version plus récente : {0}
ja: 親イメージに新しいバージョンが含まれています: {0}

source: Global zone has an older version of package: {0}
de: Globale Zone hat eine ältere Version des Packages: {0}
es: La zona global tiene una versión anterior del paquete: {0}
fr: La zone globale a une version plus ancienne du package : {0}
ja: 大域ゾーンに古いバージョンのパッケージが含まれています: {0}

source: Parent image has an older version of package: {0}
de: Übergeordnetes Abbild verfügt über eine ältere Version des Pakets: {0}
es: La imagen principal tiene una versión anterior del paquete: {0}
fr: L'image parente a une version plus ancienne du package : {0}
ja: 親イメージに古いバージョンのパッケージが含まれています: {0}

source: Installed version in root image is too old for origin dependency {0}
de: Im Root-Abbild installierte Version ist für die ursprüngliche Abhängigkeit {0} zu alt
es: La versión instalada en la imagen raíz es demasiado antigua para la dependencia de origen {0}
fr: La version installée dans l'image racine est trop ancienne pour la dépendance d'origine {0}
ja: ルートイメージにインストールされているバージョンは、起点の依存関係 {0} に対して古すぎます

source: Installed version in image being upgraded is too old for origin dependency {0}
de: Im aufzurüstenden Abbild installierte Version ist für die ursprüngliche Abhängigkeit {0} zu alt
es: La versión instalada en la imagen que se desea actualizar es demasiado antigua para la dependencia de origen {0}
fr: La version installée dans l'image en cours de mise à niveau est trop ancienne pour la dépendance d'origine {0}
ja: アップグレードしているイメージにインストールされているバージョンは、起点の依存関係 {0} に対して古すぎます

source: Package contains invalid or unsupported actions
de: Paket enthält ungültige oder nicht unterstützte Aktionen
es: El paquete contiene acciones que no son válidas o no están admitidas
fr: Le package contient des actions non valides ou non prises en charge
ja: パッケージに無効なアクションまたはサポートされていないアクションが含まれています
ru: Пакет содержит недействительные или неподдерживаемые действия

source: (masked)
de: (maskiert)
es: (con máscara)
fr: (masqué)
ja: (マスク済み)

source: Goal mismatch '{name}': expected goal: {expected}, current value: {current}
de: Fehlende Zielübereinstimmung '{name}': erwartetes Ziel: {expected}, derzeitiger Wert: {current}
es: Discrepancia de objetivos '{name}': objetivo esperado: {expected}, valor actual: {current}
fr: Non concordance de l'objectif '{name}' : objectif attendu : {expected}, valeur actuelle : {current}
ja: 目標の不一致 '{name}': 予期される目標: {expected}、現在の値: {current}

source: Startup
de: Start
es: Inicio
fr: Démarrage
ja: 開始

source: Planning
de: Planung
es: Planificación
fr: Planification
ja: 計画

source: Download
ca: Descarregar
de: Herunterladen
es: Descargar
fr: Télécharger
ja: ダウンロード
ru: Загрузка

source: Actions
de: Aktionen
es: Acciones
ja: アクション

source: Finalize
de: Abschließen
es: Finalizar
fr: Finaliser
ja: ファイナライズ

source: Downloading
de: Wird heruntergeladen
es: Descargando
fr: Téléchargement
ja: ダウンロード中

source: Executing
de: Wird ausgeführt
es: Ejecutando
fr: Exécution
ja: 実行中

source: Processing
ca: Processant
de: Verarbeitung
es: Procesando
fr: Traitement
ja: 処理中
ru: Обработка

source: Download packages
de: Packages herunterladen
es: Descargar paquetes
fr: Télécharger les packages
ja: ダウンロードパッケージ

source: Download files
de: Dateien herunterladen
es: Descargar archivos
fr: Télécharger les fichiers
ja: ダウンロードファイル

source: Download bytes
de: Byte herunterladen
es: Descargar bytes
fr: Télécharger les octets
ja: ダウンロードバイト

source: Republished pkgs
de: Erneut veröffentlichte Packages
es: Paquetes publicados de nuevo
fr: pkg republiés
ja: 再発行されたパッケージ

source: Republish sent bytes
de: Gesendete Byte erneut veröffentlichen
es: Publicar de nuevo bytes enviados
fr: Republier les octets envoyés
ja: 送信済みバイトの再発行

source: Refresh Publishers
de: Herausgeber aktualisieren
es: Refrescar editores
fr: Actualiser les éditeurs
ja: パブリッシャーのリフレッシュ

source: Refresh bytes
de: Byte aktualisieren
es: Refrescar bytes
fr: Actualiser les octets
ja: バイトのリフレッシュ

source: Download Manifests
de: Manifeste herunterladen
es: Descargar manifiestos
fr: Télécharger les manifestes
ja: ダウンロードマニフェスト

source: Committed Manifests
de: Festgeschriebene Manifeste
es: Manifiestos confirmados
fr: Manifestes validés
ja: コミットされたマニフェスト

source: Verify Repository Content
de: Repository-Inhalt prüfen
es: Verificar contenido de repositorio
fr: Vérifier le contenu du référentiel
ja: リポジトリの内容の検証

source: Fix Repository Content
de: Repository-Inhalt korrigieren
es: Corregir contenido de repositorio
fr: Corriger le contenu du référentiel
ja: リポジトリの内容の修正

source: Archived items
de: Archivierte Elemente
es: Elementos archivados
fr: Eléments archivés
ja: アーカイブされた項目

source: Archived bytes
de: Archivierte Byte
es: Bytes archivados
fr: Octets archivés
ja: アーカイブされたバイト

source: Processed Packages
de: Verarbeitete Packages
es: Paquetes procesados
fr: Packages traités
ja: 処理されたパッケージ

source: Reversioned Packages
de: Reversionierte Packages
es: Paquetes reversionados
fr: Packages dont le versionnage a été modifié
ja: 復元されたパッケージ

source: Adjusted Packages
de: Angepasste Packages
es: Paquetes ajustados
fr: Packages ajustés
ja: 調整されたパッケージ

source: Solver setup
de: Solver einrichten
es: Configuración de optimizador
fr: Configuration du solveur
ja: ソルバーのセットアップ

source: Running solver
de: Solver wird ausgeführt
es: Ejecutando optimizador
fr: Exécution du solveur
ja: ソルバーを実行しています

source: Finding local manifests
de: Lokale Manifeste werden gesucht
es: Buscando manifiestos locales
fr: Recherche de manifestes locaux
ja: ローカルマニフェストを検索しています

source: Package planning
de: Packageplanung
es: Planificación de paquetes
fr: Planification de package
ja: パッケージ計画

source: Merging actions
de: Aktionen werden zusammengeführt
es: Fusionando acciones
fr: Fusion d'actions
ja: アクションをマージしています

source: Checking for conflicting actions
de: Es wird auf widersprüchliche Aktionen geprüft
es: Comprobando acciones en conflicto
fr: Recherche d'actions incompatibles
ja: 競合するアクションを検査しています

source: Consolidating action changes
de: Aktionsänderungen werden konsolidiert
es: Consolidando cambios de acción
fr: Consolidation des modifications d'actions
ja: アクションの変更を統合しています

source: Evaluating mediators
de: Vermittler werden evaluiert
es: Evaluando mediadores
fr: Evaluation des médiateurs
ja: メディエータを評価しています

source: Finalizing action plan
de: Aktionsplan wird abgeschlossen
es: Finalizando plan de acción
fr: Finalisation du plan d'action
ja: アクション計画をファイナライズしています

source: Evaluating mediator changes
de: Änderungen der Vermittler werden evaluiert
es: Evaluando cambios de mediador
fr: Evaluation des modifications de médiateurs
ja: メディエータの変更を評価しています

source: Verifying Packages
de: Packages werden überprüft
es: Verificando paquetes
fr: Vérification des packages
ja: パッケージの検証

source: Fixing Packages
de: Packages werden korrigiert
es: Corrigiendo paquetes
fr: Correction des packages
ja: パッケージの修正

source: Removing old actions
de: Alte Aktionen werden entfernt
es: Eliminando acciones antiguas
fr: Suppression des anciennes actions
ja: 古いアクションを削除しています

source: Installing new actions
de: Neue Aktionen werden installiert
es: Instalando acciones nuevas
fr: Installation des nouvelles actions
ja: 新しいアクションをインストールしています

source: Updating modified actions
de: Geänderte Aktionen werden aktualisiert
es: Actualizando acciones modificadas
fr: Mise à jour des actions modifiées
ja: 変更されたアクションを更新しています

source: Updating package state database
de: Paketstatusdatenbank wird aktualisiert
es: Actualizando base de datos de estado de paquete
fr: Mise à jour de la base de données d'état des packages
ja: パッケージ状態データベースを更新しています

source: Updating image state
de: Imagestatus wird aktualisiert
es: Actualizando estado de imagen
fr: Mise à jour de l'état des images
ja: イメージ状態を更新しています

source: Creating fast lookup database
de: Datenbank für Schnellsuche wird erzeugt
es: Creando base de datos de búsqueda rápida
fr: Création d'une base de données de recherche rapide
ja: スピード検索データベースを作成しています

source: Updating package cache
de: Packagecache wird aktualisiert
es: Actualizando caché de paquete
fr: Mise à jour du cache de packages
ja: パッケージキャッシュを更新しています

source: Reading search index
de: Suchindex wird gelesen
es: Leyendo índice de búsqueda
fr: Lecture de l'index de recherche
ja: 検索インデックスを読み取っています

source: Updating search index
de: Suchindex wird aktualisiert
es: Actualizando índice de búsqueda
fr: Mise à jour de l'index de recherche
ja: 検索インデックスを更新しています

source: Building new search index
de: Neuer Suchindex wird erstellt
es: Generando índice de búsqueda nuevo
fr: Création de l'index de recherche
ja: 新しい検索インデックスを構築しています

source: Deleting search index
de: Suchindex wird gelöscht
es: Suprimiendo índice de búsqueda
fr: Suppression de l'index de recherche
ja: 検索インデックスを削除しています

source: Updating catalog
de: Katalog wird aktualisiert
es: Actualizando catálogo
fr: Mise à jour du catalogue
ja: カタログを更新しています

source: Analyzing removed packages
de: Entfernte Packages werden analysiert
es: Analizando paquetes eliminados
fr: Analyse des packages supprimés
ja: 削除されたパッケージを解析しています

source: Analyzing repository packages
de: Repository-Packages werden analysiert
es: Analizando paquetes de repositorio
fr: Analyse des packages du référentiel
ja: リポジトリパッケージを解析しています

source: Removing package manifests
de: Packagemanifeste werden entfernt
es: Eliminando manifiestos de paquete
fr: Suppression de manifestes de package
ja: パッケージマニフェストを削除しています

source: Removing package files
de: Packagedateien werden entfernt
es: Eliminando archivos de paquete
fr: Suppression de fichiers de package
ja: パッケージファイルを削除しています

source: Verifying repository content
de: Repository-Inhalt wird überprüft
es: Verificando contenido de repositorio
fr: Vérification du contenu du référentiel
ja: リポジトリの内容を検証しています

source: Fixing repository content
de: Repository-Inhalt wird korrigiert
es: Corrigiendo contenido de repositorio
fr: Correction du contenu du référentiel
ja: リポジトリの内容を修正しています

source: Lint setup {0:d}
es: Configuración de lint {0:d}
fr: Configuration de Lint {0:d}
ja: Lint のセットアップ {0:d}

source: Lint phase {0:d}
es: Fase de lint {0:d}
fr: Phase de Lint {0:d}
ja: Lint フェーズ {0:d}

source: Done
ca: Fet
de: Fertig
es: Listo
fr: Terminé
ja: 完了
ru: Готово

source: Done ({elapsed:>.3f}s)
de: Fertig ({elapsed:>.3f}s)
es: Listo ({elapsed:>.3f}s)
fr: Terminé ({elapsed:>.3f}s)
ja: 完了 ({elapsed:>.3f} 秒)

source: Checking that pkg(7) is up to date ...
de: Es wird geprüft, ob pkg(7) auf dem neuesten Stand ist...
es: Comprobando que pkg(7) esté actualizado...
fr: Vérification de l'utilisation de la dernière version de pkg(7)...
ja: pkg(7) が最新であることを確認しています...

source: Caching catalogs ...
ca: Capturant catàlegs ...
de: Kataloge werden gecacht ...
es: Recopilando catálogos...
fr: Mise en cache des catalogues...
ja: カタログをキャッシュしています...
ru: Кэширование каталогов...

source: Loading catalog cache ...
ca: Carregant cau del catàleg ...
de: Katalogcache wird geladen ...
es: Cargando caché de catálogos...
fr: Chargement du cache du catalogue...
ja: カタログキャッシュをロードしています...
ru: Загрузка кэша каталога...

source: Retrieving target catalog '{0}' ...
de: Zielkatalog '{0}' wird abgerufen ...
es: Recuperando catálogo de destino '{0}'...
fr: Récupération du catalogue cible '{0}'...
ja: ターゲットカタログ '{0}' を取得しています...

source: Retrieving catalog '{0}' ...
de: Katalog '{0}' wird abgerufen ...
es: Recuperando catálogo '{0}'...
fr: Récupération du catalogue '{0}'...
ja: カタログ '{0}' を取得しています...

source: Refreshing catalog '{0}' ...
de: Katalog '{0}' wird aktualisiert ...
es: Refrescando catálogo '{0}'...
fr: Actualisation du catalogue '{0}'...
ja: カタログ '{0}' をリフレッシュしています...

source: Planning completed in {0:>.2f} seconds
de: Planung in {0:>.2f} Sekunden abgeschlossen
es: Planificación finalizada en {0:>.2f} segundos
fr: Planification terminée en {0:>.2f} secondes
ja: 計画が {0:>.2f} 秒で完了しました

source: Fetching manifests: {num} {pctcomplete}% complete
de: Manifeste werden abgerufen: {num} {pctcomplete}% abgeschlossen
es: Recuperando manifiestos: {num} {pctcomplete} % completo
fr: Récupération des manifestes : {num} {pctcomplete}% terminé
ja: マニフェストを取得しています: {num} {pctcomplete}% 完了

source: Download: {num} items {mbs}MB {pctcomplete}% complete {speed}
de: Download: {num} Elemente {mbs} MB {pctcomplete} % abgeschlossen {speed}
es: Descarga: {num} elementos {mbs} MB {pctcomplete} % completo {speed}
fr: Téléchargement : {num} éléments {mbs}Mo {pctcomplete}% terminé {speed}
ja: ダウンロード: {num} 項目 {mbs}MB {pctcomplete}% 完了 {speed}

source: Download: Completed {num} in {sec:>.2f} seconds {speed}
de: Download: {num} in {sec:>.2f} Sekunden {speed} abgeschlossen
es: Descarga: {num} completo(s) en {sec:>.2f} segundos {speed}
fr: Téléchargement : {num} terminé en {sec:>.2f} secondes {speed}
ja: ダウンロード: {num} が {sec:>.2f} 秒で完了しました {speed}

source: Republish: {0} ...
de: Neu veröffentlichen: {0} ...
es: Publicar de nuevo: {0}...
fr: Republication : {0} ...
ja: 再公開: {0} ...

source: Archiving: Completed {num} in {secs:>.2f} seconds
de: Archivierung: {num} in {secs:>.2f} Sekunden abgeschlossen
es: Archivo: {num} completo en {secs:>.2f} segundos
fr: Archivage : {num} terminé en {secs:>.2f} secondes
ja: アーカイブ: {num} が {secs:>.2f} 秒で完了しました

source: Archiving: {pair} items {mbs}MB {pctcomplete}% complete
de: Archivierung: {pair} Elemente {mbs}MB {pctcomplete}% abgeschlossen
es: Archivo: {pair} elementos {mbs} MB {pctcomplete} % completo
fr: Archivage : {pair} éléments {mbs}Mo {pctcomplete}% terminé
ja: アーカイブ: {pair} 項目 {mbs}MB {pctcomplete}% 完了

source: {num} actions ({type})
de: {num} Aktionen ({type})
es: {num} acciones ({type})
ja: {num} アクション ({type})

source: Completed {numactions:d} actions in {time:>.2f} seconds.
de: {numactions:d} Aktionen in {time:>.2f} Sekunden abgeschlossen.
es: Se completaron {numactions:d} acciones en {time:>.2f} segundos.
fr: {numactions:d} actions terminées en {time:>.2f} secondes.
ja: {numactions:d} 個のアクションが {time:>.2f} 秒で完了しました。

source: Linked image publisher check ...
de: Prüfung des Herausgebers des verknüpften Abbilds...
es: Control de editor de imagen enlazada...
fr: Vérification de l'éditeur de l'image liée...
ja: リンクされたイメージのパブリッシャーの確認...

source: Finished processing linked images.
de: Verarbeitung verknüpfter Abbilder abgeschlossen.
es: Finalizó el procesamiento de imágenes enlazadas.
fr: Traitement des images liées terminé.
ja: リンクされたイメージの処理が終了しました。

source: Linked image '{0}' output:
de: Ausgabe von verknüpftem Image '{0}':
es: Salida de imagen enlazada '{0}':
fr: Sortie de l'image liée '{0}' :
ja: リンクされたイメージ '{0}' の出力:

source: Linked images: {pair} done; {numworking:d} working: {running}
de: Verknüpfte Images {pair} fertig; {numworking:d} in Verarbeitung: {running}
es: Imágenes enlazadas: {pair} terminado(s); {numworking:d} en proceso: {running}
fr: Images liées : {pair} terminées ; {numworking:d} en cours de traitement : {running}
ja: リンクされたイメージ: {pair} 完了; {numworking:d} 処理中: {running}
