Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: pkg: info: no packages matching the following patterns you specified were found in the catalog. Try relaxing the patterns, refreshing, and/or examining the catalogs:
de: pkg: info: Keines der Packages, die den folgenden angegebenen Mustern entsprechen, wurden im Katalog gefunden. Versuchen Sie, die Muster zu erweitern, zu aktualisieren und/oder die Kataloge zu durchsuchen:
es: pkg: info: no se encontraron paquetes que coincidan con los siguientes patrones especificados en el catálogo. Intente relajar los patrones, refrescar o examinar los catálogos:
fr: pkg : infos : aucun package correspondant aux critères spécifiés indiqués ci-dessous ne se trouve dans le catalogue. Essayez d'assouplir les modèles, d'actualiser et/ou d'examiner les catalogues :
ja: pkg: info: 指定された次のパターンに一致するパッケージが、カタログ内に見つ かりませんでした。パターンの条件緩和、リフレッシュ、カタログの検査の いずれか、あるいはそのすべてを試してください:

source: no license information could be found for the following packages:
de: Für die folgenden Packages konnten keine Lizenzinformationen gefunden werden:
es: no se pudo encontrar información de licencia para los paquetes siguientes:
fr: aucune information de licence n'a pu être trouvée pour les packages suivants :
ja: 次のパッケージのライセンス情報が見つかりませんでした:

source: can not report only unpackaged contents with package arguments.
de: Es können nicht nur unverpackte Inhalte mit Packageargumenten gemeldet werden.
es: No se pueden informar únicamente contenidos sin empaquetar con argumentos de paquete.
fr: ne peut pas signaler uniquement les contenus non packagés avec des arguments de package.
ja: パッケージ解除された内容のみをパッケージ引数を使用してレポートできません。

source: Publisher '{0}' does not have any SSL-based origins or mirrors.
de: Herausgeber '{0}' hat keine SSL-basierten Ursprünge oder Spiegel.
es: El editor '{0}' no tiene orígenes ni reflejos basados en SSL.
fr: L'éditeur '{0}' n'a pas d'origine ou de miroir basé sur SSL.
ja: パブリッシャー '{0}' には SSL ベースの起点またはミラーがありません。

source: Errors were encountered while attempting to retrieve package or file data for the requested operation.
de: Fehler beim Abrufen von Package-oder Dateidaten für den angeforderten Vorgang.
es: Se encontraron errores al intentar recuperar datos de paquete o de archivos para la operación solicitada.
fr: Des erreurs ont été détectées lors de la tentative de récupération des données du package ou du fichier pour l'opération requise.
ja: 要求された操作に対するパッケージまたはファイルデータの取得を試行しているときに、エラーが発生しました。

source: An error was encountered while attempting to read image state information to perform the requested operation. Details follow: {0}
de: Fehler bei dem Versuch, die Statusinformationen zum Image zu lesen, um den angeforderten Vorgang auszuführen. Details folgen: {0}
es: Se produjo un error al intentar leer la información de estado de la imagen para realizar la operación solicitada. Estos son los detalles: {0}
fr: Une erreur s'est produite lors d'une tentative de lecture d'informations d'état d'images nécessaires à l'exécution de l'opération demandée. Les détails sont les suivants : {0}
ja: 要求された操作を実行するためにイメージの状態情報を読み取ろうとしてエラーが発生しました。詳細は次のとおりです: {0}

source: Unable to contact a valid package repository. This may be due to a problem with the repository, network misconfiguration, or an incorrect pkg client configuration. Please verify the client's network configuration and repository's location. Additional details: {0}
de: Es konnte keine Verbindung zu einem gültigen Package-Repository hergestellt werden. Dies kann an einem Problem mit dem Repository, der Netzwerkkonfiguration oder der pkg-Clientkonfiguration liegen. Überprüfen Sie die Netzwerkkonfiguration des Clients und das Verzeichnis des Repositorys. Zusätzliche Details: {0}
es: No se puede establecer el contacto con un repositorio de paquetes válido. Esto puede deberse a un problema con el repositorio, a un error en la configuración de red o a una configuración incorrecta del cliente de paquete. Compruebe la configuración de red del cliente y la ubicación del repositorio. Detalles adicionales: {0}
fr: Impossible de contacter un référentiel de package valide. Le problème provient peut-être du référentiel, d'une mauvaise configuration réseau ou d'une configuration client pkg incorrecte. Vérifiez la configuration réseau du client et l'emplacement du référentiel. Détails supplémentaires : {0}
ja: 有効なパッケージリポジトリに接続できません。これはリポジトリの問題、ネットワークの構成ミス、または pkg クライアントの構成の誤りが原因と考えられます。クライアントのネットワーク構成とリポジトリの場所を確認してください。 追加詳細: {0}

source: An error was encountered while attempting to store information about the current operation in client history. Details follow: {0}
de: Fehler beim Speichern der Daten des aktuellen Vorgangs in der Clienthistorie. Details folgen: {0}
es: Error al intentar almacenar información sobre la operación actual en el historial del cliente. Estos son los detalles: {0}
fr: Une erreur s'est produite lors de la tentative d'enregistrement des informations sur l'opération actuelle dans l'historique client. Les détails sont les suivants : {0}
ja: 現在の操作に関する情報をクライアント履歴に格納しようとしたときに、 エラーが発生しました。詳細は次のとおりです: {0}

source: An error was encountered while attempting to purge client history. Details follow: {0}
de: Fehler beim Versuch, die Clienthistorie zu löschen. Details folgen: {0}
es: Error al intentar depurar el historial del cliente. Estos son los detalles: {0}
fr: Une erreur s'est produite lors de la tentative de purge de l'historique client. Les détails sont les suivants : {0}
ja: クライアント履歴の削除を試行しているときに、エラーが発生しました。詳細は次のとおりです: {0}

source: Firmware dependency error: Cannot exec {0}: {1}
de: Firmwareabhängigkeitsfehler: {0} kann nicht ausgeführt werden: {1}
es: Error de dependencia de firmware: No se puede ejecutar {0}: {1}
fr: Erreur de dépendance de microprogramme : impossible d'exécuter {0} : {1}
ja: ファームウェアの依存関係エラー: {0} を実行できません: {1}

source: cpu dependency error: '{0}' does not meet the the minimum requirement for {1} {2}
de: CPU-Abhängigkeitsfehler: "{0}" erfüllt nicht die Mindestanforderungen für {1} {2}
fr: Erreur de dépendance de CPU : '{0}' ne répond pas aux conditions minimales requises pour {1} {2}
ja: CPU 依存関係エラー: '{0}' は {1} {2} の最低要件を満たしていません。

source: cpu dependency error: Unable to verify cpu type
de: CPU-Abhängigkeitsfehler: CPU-Typ kann nicht verifiziert werden
es: Error de dependencia de CPU: No se puede verificar el tipo de CPU
fr: Erreur de dépendance de CPU : impossible de vérifier le type de CPU
ja: CPU 依存関係エラー: CPU タイプを確認できません

source: UNSPECIFIED
fr: NON INDIQUE
ja: 指定されていません

source: There are {0} instances of downrev firmware for the '{1}' devices present on this system. Update each to version {2} or newer.
de: Es gibt {0} Instanzen von downrev-Firmware für die in diesem System vorhandenen Geräte "{1}". Führen Sie für jedes Gerät ein Update auf Version {2} oder höher durch.
es: Hay {0} instancias de firmware de versión anterior para los dispositivos '{1}' en el sistema. Actualice a la versión {2} o superior.
fr: {0} instances de microprogramme de révision inférieure sont présentes sur ce système pour les périphériques '{1}'. Mettez à jour chacune d'entre elles vers la version {2} ou une version plus récente.
ja: '{1}' デバイス用の downrev ファームウェアのインスタンスがこのシステム上に {0} 個存在します。それぞれをバージョン {2} またはそれより新しいものに更新してください。

source: There are 240 or more instances of downrev firmware for the'{0}' devices present on this system. Update each to version {1} or better.
de: Es gibt mindestens 240 Instanzen von downrev-Firmware für die in diesem System vorhandenen Geräte '{0}'. Führen Sie für jedes Gerät ein Update auf Version {1} oder höher durch.
es: Hay 240 o más instancias de firmware de versión anterior para los dispositivos '{0}' en el sistema. Actualice a la versión {1} o superior.
fr: 240 instances de microprogramme de révision inférieure ou plus sont présentes sur ce système pour les périphériques '{0}'. Mettez à jour chacune d'entre elles vers la version {1} ou une version ultérieure.
ja: '{0}' デバイス用の downrev ファームウェアのインスタンスがこのシステム上に 240 個以上存在します。それぞれをバージョン {1} またはそれ以上に更新してください。

source: Firmware dependency error: {0} exited due to signal {1}
de: Firmware-Abhängigkeitsfehler: {0} aufgrund von Signal {1} beendet
es: Error de dependencia de firmware: {0} salió debido a la señal {1}
fr: Erreur de dépendance de microprogramme : fermeture de {0} en raison du signal {1}
ja: ファームウェアの依存関係エラー: シグナル {1} のために {0} が終了しました

source: Firmware dependency error: General internal error {0} running '{1}': '{2}'
de: Firmware-Abhängigkeitsfehler: allgemeiner interner Fehler {0} bei Ausführung von '{1}': '{2}'
es: Error de dependencia de firmware: error interno general {0} ejecutando '{1}': '{2}'
fr: Erreur de dépendance de microprogramme : erreur interne générale {0} lors de l'exécution de '{1}' : '{2}'
ja: ファームウェアの依存関係エラー: '{1}' の実行中に一般的な内部エラー {0} が発生しました: '{2}'

source: Canceled
de: Abgebrochen
es: Cancelado
fr: Annulé
ja: 取消し

source: Failed
de: Nicht erfolgreich
es: Error
fr: Echoué
ja: 失敗

source: Ignored
de: Ignoriert
es: Ignorado
fr: Ignoré
ja: 無視

source: Nothing to do
de: Keine Aktion erforderlich
es: No hay ninguna acción que realizar
fr: Aucune action requise
ja: 処理対象なし

source: Succeeded
de: Erfolgreich
es: Correcto
fr: Réussi
ja: 成功

source: Bad Request
de: Falsche Anforderung
es: Solicitud errónea
fr: Demande incorrecte
ja: 不正な要求

source: Configuration
de: Konfiguration
es: Configuración
ja: 構成

source: Constrained
de: Eingeschränkt
es: Restringido
fr: Avec contrainte
ja: 制約付き

source: Locked
de: Gesperrt
es: Bloqueado
fr: Verrouillé
ja: ロック

source: Search
ca: Cercar
de: Suchen
es: Búsqueda
fr: Rechercher
ja: 検索
ru: Поиск

source: Storage
ca: Emmagatzemament
de: Speicher
es: Almacenamiento
fr: Stockage
ja: ストレージ
ru: Хранилище

source: Transport
es: Transporte
ja: トランスポート

source: Actuator
de: Aktuator
es: Activador
fr: Actionneur
ja: アクチュエータ

source: Out of Memory
de: Nicht genügend Arbeitsspeicher
es: Memoria agotada
fr: Mémoire saturée
ja: メモリー不足

source: Conflicting Actions
de: Widersprüchliche Aktionen
es: Acciones en conflicto
fr: Actions incompatibles
ja: 競合するアクション

source: Unknown
de: Unbekannt
es: Desconocido
fr: Inconnu
ja: 不明

source: None
ca: Cap
de: Kein
es: Ninguno
fr: Aucun
ja: なし
ru: Нет

source: The trust anchors for the image were expected to be found in {0}, but that is not a directory. Please set the image property 'trust-anchor-directory' to the correct path.
de: Die Vertrauensanker für das Abbild wurden in {0} erwartet. Dies ist jedoch kein Verzeichnis. Geben Sie für die Abbildeigenschaft 'trust-anchor-directory' den richtigen Pfad an.
es: Se esperaba encontrar los anclajes de confianza de la imagen en {0}, pero no se trata de un directorio. Defina la propiedad de imagen 'trust-anchor-directory' en la ruta correcta.
fr: Les ancrages de confiance de l'image devaient se trouver dans {0}, qui n'est pas un répertoire. Attribuez le chemin approprié à la propriété d'image 'trust-anchor-directory'.
ja: イメージのトラストアンカーは {0} に見つかるはずでしたが、これはディレクトリではありません。イメージのプロパティー 'trust-anchor-directory' を正しいパスに設定してください。

source: {path} is expected to be a certificate but could not be parsed. The error encountered was: {err}
de: {path} wurde als Zertifikat erwartet, konnte jedoch nicht analysiert werden. Folgender Fehler ist aufgetreten: {err}
es: Se espera que {path} sea un certificado, pero no se pudo analizar. Se encontró el siguiente error: {err}
fr: {path} devait être un certificat mais n'a pas pu être analysé. L'erreur rencontrée est : {err}
ja: {path} は証明書であると思われますが、解析できませんでした。検出されたエラーを次に示します: {err}

source: Publisher '{0}' is a system publisher and cannot be moved.
de: Herausgeber '{0}' ist ein Systemherausgeber und kann nicht verschoben werden.
es: El editor '{0}' es un editor del sistema y no se puede mover.
fr: L'éditeur '{0}' est un éditeur système et ne peut pas être déplacé.
ja: パブリッシャー '{0}' はシステムパブリッシャーであり、移動できません。

source: File should not exist
de: Datei darf nicht vorhanden sein
es: El archivo no debe existir
fr: Le fichier ne devrait pas exister
ja: ファイルが存在してはいけません

source: pkg(7) update check failed.
de: Updateprüfung von pkg(7) fehlgeschlagen.
es: Error en la comprobación de la actualización de pkg(7).
fr: Echec de la vérification de la mise à jour de pkg(7).
ja: pkg(7) の更新チェックに失敗しました。
ru: Сбой при проверке обновления pkg(7).

source: At least one name must be provided for the signature-required-names policy.
de: Mindestens ein Name muss für die Richtlinie 'signature-required-names' angegeben werden.
es: Como mínimo se debe proporcionar un nombre para la directiva signature-required-names.
fr: Vous devez fournir au moins un nom à la politique signature-required-names.
ja: signature-required-names ポリシーには、少なくとも 1 つの名前を指定する必要があります。
ru: Для политики signature-required-names необходимо предоставить минимум одно свойство.

source: Publisher '{0}' is a system publisher and other publishers cannot be moved relative to it.
de: Herausgeber '{0}' ist ein Systemherausgeber. Andere Herausgeber können nicht in Relation zu diesem verschoben werden.
es: El editor '{0}' es un editor del sistema y otros editores no se pueden mover en relación a él.
fr: L'éditeur '{0}' est un éditeur système et d'autres éditeurs ne peuvent pas être déplacés par rapport à lui.
ja: パブリッシャー '{0}' はシステムパブリッシャーであり、それに関連してほかのパブリッシャーを移動することはできません。

source: {0} is a system publisher and cannot be unset.
de: {0} ist ein Systemherausgeber und kann nicht entfernt werden.
es: {0} es un editor del sistema y no se puede anular.
fr: {0} est un éditeur système et son paramétrage ne peut pas être annulé.
ja: '{0}' はシステムパブリッシャーであり、設定解除できません。

source: verify or fix overlaying package: {0}
de: Überlagerndes Package prüfen oder korrigieren: {0}
es: verifique o corrija el paquete superpuesto: {0}
fr: vérifiez ou corrigez le package du dessus : {0}
ja: オーバーレイパッケージの検証または修正: {0}

source: Cannot create or mount a copy of current be. Reporting unpackaged content aganist current live image.
de: Kopie von aktueller Bootumgebung kann nicht erstellt oder eingehängt werden. Unverpackte Inhalte werden mit aktuellem Liveimage gemeldet.
fr: Impossible de créer ou le monter une copie du BE actuel. Signalement d'un contenu non packagé pour l'image live actuelle.
ja: 現在の BE のコピーを作成またはマウントできません。現在のライブイメージに対してパッケージ解除された内容を報告しています。

source: dir: {0}
de: Verzeichnis: {0}
es: directorio: {0}
fr: rép. : {0}
ja: ディレクトリ: {0}

source: Unpackaged directory
de: Unverpacktes Verzeichnis
es: Directorio sin empaquetar
fr: Répertoire non packagé
ja: パッケージ解除されたディレクトリ

source: file: {0}
de: Datei: {0}
es: archivo: {0}
fr: fichier : {0}
ja: ファイル: {0}

source: Unpackaged file
de: Unverpackte Datei
es: Archivo sin empaquetar
fr: fichier non packagé
ja: パッケージ解除されたファイル

source: {path} is not found in the image
de: {path} im Image nicht gefunden
es: {path} no se encuentra en la imagen
fr: {path} introuvable dans l'image
ja: イメージに {path} が見つかりません

source: Download cache
de: Cache herunterladen
es: Caché de descarga
fr: Cache de téléchargement
ja: ダウンロードキャッシュ

source: Root filesystem
de: Root-Dateisystem
es: Sistema de archivos raíz
fr: Système de fichiers racine
ja: ルートファイルシステム

source: A link targeting itself or part of a link loop was found at '{0}'; a file or directory was expected. Please remove the link and try again.
de: Ein auf sich selbst verweisender Verweis oder Teil einer Schleife wurde in '{0}' gefunden. Es wurde eine Datei oder ein Verzeichnis erwartet. Entfernen Sie den Verweis und versuchen Sie es erneut.
es: Se encontró un enlace dirigido a sí mismo o parte de un bucle de enlace en '{0}'; se esperaba un archivo o un directorio. Elimine el enlace e inténtelo nuevamente.
fr: Un lien pointant vers lui-même ou une partie d'une boucle de lien a été trouvé dans '{0}', alors qu'un fichier ou un répertoire était attendu. Veuillez supprimer le lien et réessayer.
ja: 自己をターゲットとしたリンクまたはリンクループの一部が '{0}' に見つかりました。ファイルまたはディレクトリのはずでした。リンクを削除し、再試行してください。

source: property values to be {add} must be of the form '<name>=<value>'. This is what was given: {key}
de: Eigenschaftswerte, die mit {add} hinzugefügt werden sollen, müssen die Form '<Name>=<Wert>' aufweisen. Folgendes wurde angegeben: {key}
es: los valores de propiedad que {add} deben estar en el formato '<name>=<value>'. Se proporcionó lo siguiente: {key}
fr: les valeurs de propriété à {add} doivent respecter le format '<nom>=<valeur>'. Vous avez utilisé le format suivant : {key}
ja: {add} するプロパティー値は '<name>=<value>' の形式になっている必要があります。次のように指定されました: {key}

source: invalid linked image or zone name '{0}'.
de: Ungültiger Name "{0}" des verknüpften Abbilds oder der verknüpften Zone.
es: nombre de imagen enlazada o zona no válido: {0}.
fr: nom d'image ou de zone liées non valide : '{0}'.
ja: リンクされたイメージまたはゾーンの名前 '{0}' が無効です。

source: integer argument expected
de: Ganzzahlargument erwartet
es: argumento de entero esperado
fr: il manque un argument entier
ja: 整数の引数が必要です

source: invalid operation stage: '{0}'
de: Ungültige Vorgangsphase: '{0}'
es: etapa de operación no válida: '{0}'
fr: étape d'opération incorrecte : '{0}'
ja: 無効な操作段階: '{0}'

source: missing required parameter
de: Fehlender erforderlicher Parameter
es: parámetro requerido faltante
fr: paramètre requis manquant
ja: 必須パラメータが不足しています

source: value '{0}' invalid
de: Wert '{0}' ungültig
es: el valor '{0}' no es válido
fr: la valeur '{0}' n'est pas valide
ja: 値 '{0}' が無効です

source: value must be >= {0:d}
de: Wert muss >= {0:d} sein
es: el valor debe ser >= {0:d}
fr: la valeur doit être >= {0:d}
ja: 値は {0:d} 以上である必要があります

source: This version is excluded by a freeze on {0} at version {1}. The reason for the freeze is: {2}
de: Diese Version wurde durch einen Freeze von {0} in Version {1} ausgeschlossen. Grund für den Freeze: {2}
es: Esta versión está excluida debido a un bloqueo de {0} en la versión {1}. Motivo del bloqueo: {2}
fr: Cette version est exclue en raison d'un figement de {0} à la version {1}. Motif du figement : {2}
ja: このバージョンは、バージョン {1} での {0} の凍結から除外されます。凍結の理由は次のとおりです: {2}

source: This version is excluded by a freeze on {0} at version {1}.
de: Diese Version wurde durch einen Freeze von {0} in Version {1} ausgeschlossen.
es: Esta versión está excluida debido a un bloqueo de {0} en la versión {1}.
fr: Cette version est exclue en raison d'un figement de {0} à la version {1}.
ja: このバージョンは、バージョン {1} での {0} の凍結から除外されます。

source: No matching version of {0} can be installed:
de: Es kann keine entsprechende Version von {0} installiert werden:
es: No se puede instalar ninguna versión de {0} que coincida:
fr: Aucune version correspondante de {0} ne peut être installée :
ja: {0} の一致するバージョンはインストールできません:

source: This version rejected by user request
de: Diese Version wurde durch Benutzeranforderung abgewiesen
es: Versión rechazada por solicitud del usuario
fr: Cette version est rejetée par une demande utilisateur.
ja: このバージョンはユーザーの要求によって拒否されました

source: Package '{0}' must be uninstalled or upgraded if the requested operation is to be performed.
de: Sie müssen das Package '{0}' deinstallieren oder upgraden, um den angeforderten Vorgang ausführen zu können.
es: El paquete '{0}' se debe desinstalar o actualizar para realizar la operación solicitada.
fr: Le package {0} doit être désinstallé ou mis à niveau afin que l'opération demandée puisse être exécutée.
ja: 要求された操作を実行する場合は、パッケージ '{0}' をアンインストールするか、アップグレードする必要があります。

source: Plan Creation: dependency error(s) in proposed packages:
de: Planerstellung: Abhängigkeitsfehler in vorgeschlagenen Paketen:
es: Creación de plan: errores de dependencia en paquetes propuestos:
fr: Création de plan : erreur(s) de dépendance dans les packages proposés :
ja: 計画の作成: 提示されたパッケージに依存関係エラーがあります:

source: Plan Creation: Errors in installed packages due to proposed changes:
de: Planerstellung: Fehler in installierten Paketen aufgrund vorgeschlagener Änderungen:
es: Creación de plan: errores en paquetes instalados debido a cambios propuestos:
fr: Création de plan : erreurs dans les packages installés en raison des modifications proposées :
ja: 計画の作成: 提示された変更が原因で、インストールされたパッケージでエラーが発生しました:

source: Plan Creation: Package solver is unable to compute solution.
de: Planerstellung: Paket-Solver kann die Lösung nicht berechnen
es: Creación de plan: el optimizador de paquetes no puede calcular una solución.
fr: Création de plan : le solveur de package ne peut pas calculer la solution.
ja: 計画の作成: パッケージソルバーが解決策を計算できません。

source: Dependency analysis is unable to determine exact cause.
de: Die Abhängigkeitsanalyse hat keine genaue Ursache ergeben.
es: El análisis de dependencia no puede determinar la causa exacta.
fr: L'analyse des dépendances ne parvient pas à déterminer la cause exacte.
ja: 依存関係の分析で正確な原因を判断できません。

source: Try specifying expected results to obtain more detailed error messages.
de: Geben Sie erwartete Ergebnisse an, um ausführlichere Fehlermeldungen zu erhalten.
es: Intente especificar los resultados esperados para obtener mensajes de error más detallados.
fr: Tentez de spécifier les résultats escomptés afin de fournir des messages d'erreur plus détaillés.
ja: 予期される結果を指定して、さらに詳細なエラーメッセージを取得してください。

source: Include specific version of packages you wish installed.
de: Geben Sie die Version von Paketen an, die installiert werden sollen.
es: Incluya la versión específica de los paquetes que desea instalar.
fr: Indiquez la version précise des packages que vous souhaitez installer.
ja: インストールするパッケージの特定のバージョンを含めます。

source: This version excluded by specified installation version
ca: Aquesta versió està exclosa per la versió d'instal·lació especificada
de: Diese Version wird durch die angegebene Installationsversion ausgeschlossen
es: Se excluyó esta versión por la versión de instalación especificada
fr: Cette version est exclue par la version d'installation spécifiée.
ja: このバージョンは指定されたインストールのバージョンから除外されます
ru: Эта версия исключена указанной версией для установки

source: This version is excluded by installed incorporation {0}
de: Diese Version wird durch die installierte Inkorporation {0} ausgeschlossen
es: Versión excluida por la incorporación instalada {0}
fr: Cette version est exclue par l'incorporation installée {0}
ja: このバージョンはインストール済みの incorporation {0} から除外されます

source: No solution found to update to latest available versions.
de: Keine Lösung gefunden, um ein Update auf die aktuellsten verfügbaren Versionen durchzuführen.
es: No se encontró ninguna solución para actualizar a las últimas versiones disponibles.
fr: Aucune solution trouvée pour mettre à jour vers les versions les plus récentes disponibles.
ja: 使用可能な最新バージョンに更新するための解決方法が見つかりませんでした。

source: This may indicate an overly constrained set of packages are installed.
de: Dies kann mit zu vielen Einschränkungen der installierten Pakete zusammenhängen.
es: Es posible que esto indique que se instaló un conjunto de paquetes con demasiadas restricciones.
fr: Cela peut indiquer qu'un ensemble excessivement limité de packages est installé.
ja: これは、過度に制約が付けられた一連のパッケージがインストールされていることを示す可能性があります。

source: latest incorporations:
de: Neueste Inkorporationen:
es: últimas incorporaciones:
fr: dernières incorporations :
ja: 最新の incorporation:

source: The following indicates why the system cannot update to the latest version:
de: Im Folgenden wird erläutert, warum das System ein Update auf die neueste Version nicht durchführen kann:
es: A continuación, se indican los motivos por los cuales el sistema no se puede actualizar a la última versión:
fr: Voir ci-dessous les raisons de l'échec de la mise à jour du système vers la dernière version :
ja: システムが最新バージョンに更新できない理由を次に示します:

source: Dependency analysis is unable to determine the cause.
de: Die Abhängigkeitsanalyse hat keine Ursache ergeben.
es: El análisis de dependencia no puede determinar la causa.
fr: L'analyse des dépendances ne parvient pas à déterminer la cause.
ja: 依存関係の分析で原因を判断できません。
