Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Reversioned {revs} of {pkgs} packages and adjusted {adjs} packages.
de: {revs} von {pkgs} Packages wurde reversioniert und {adjs} Packages wurden angepasst.
es: {revs} reversiones de {pkgs} paquetes y {adjs} paquetes ajustados.
fr: Versionnage de {revs} packages sur {pkgs} modifié et {adjs} packages ajustés.
ja: {revs}/{pkgs} 個のパッケージを復元し、{adjs} 個のパッケージを調整しました。

source: Reversioning: {pkgs} processed, {revs} reversioned, {adjs} adjusted
de: Reversionierung: {pkgs} verarbeitet, {revs} reversioniert, {adjs} angepasst
es: Reversión: {pkgs} procesado(s), {revs} reversionado(s), {adjs} ajustado(s)
fr: Modification du versionnage : {pkgs} traités, {revs} modifiés, {adjs} ajustés
ja: 復元しています: {pkgs} が処理され、{revs} が復元され、{adjs} が調整されました

source: Planning completed
de: Planung abgeschlossen
es: Planificación completa
fr: Planification terminée
ja: 計画完了

source: second
de: Sekunde
es: segundo
fr: seconde
ja: 秒

source: Fetching manifests
de: Manifeste werden abgerufen
es: Recuperando manifiestos
fr: Récupération de manifestes
ja: マニフェストを取得しています

source: manifest
es: manifiesto
fr: manifeste
ja: マニフェスト

source: byte
fr: octet
ja: バイト

source: Download completed
de: Download abgeschlossen
es: Descarga completa
fr: Téléchargement terminé
ja: ダウンロードが完了しました

source: Archiving completed
de: Archivierung abgeschlossen
es: Archivado completo
fr: Archivage terminé
ja: アーカイブが完了しました

source: Archiving
de: Archivierung
es: Archivado
fr: Archivage
ja: アーカイブ

source: Action activity
de: Aktionsaktivität
es: Actividad de acción
fr: Activité d'action
ja: アクションのアクティビティー

source: action
de: Aktion
es: acción
ja: アクション

source: Completed actions activities
de: Abgeschlossene Aktionsaktivitäten
es: Actividades de acciones completadas
fr: Activités d'actions terminées
ja: 完了したアクションのアクティビティー

source: Setup
es: Configuración
fr: Configuration
ja: セットアップ

source: Execute
de: Ausführen
es: Ejecutar
fr: Exécution
ja: 実行

source: Linked images status
de: Status von verknüpften Images
es: Estado de imágenes enlazadas
fr: Etat des images liées
ja: リンクされたイメージのステータス

source: linked image
de: Verknüpftes Image
es: imagen enlazada
fr: image liée
ja: リンクされたイメージ

source: Reversion
es: Reversión
fr: Versionnage modifié
ja: 復元

source: package
es: paquete
ja: パッケージ

source: Checking that pkg(7) is up to date {0}
de: Es wird geprüft, ob pkg(7) auf dem neuesten Stand ist {0}
es: Comprobando que pkg(7) esté actualizado {0}
fr: Vérification de l'utilisation de la dernière version de pkg(7) {0}
ja: pkg(7) が最新であることを確認しています {0}

source: Retrieving target catalog
de: Zielkatalog wird abgerufen
es: Recuperando catálogo de destino
fr: Récupération du catalogue cible
ja: ターゲットカタログを取得しています

source: Retrieving catalog
de: Katalog wird abgerufen
es: Recuperando catálogo
fr: Récupération du catalogue
ja: カタログを取得しています

source: Refreshing catalog
ca: Refrescant catàleg
de: Katalog wird aktualisiert
es: Refrescando catálogo
fr: Actualisation du catalogue
ja: カタログをリフレッシュしています
ru: Обновление каталога

source: Creating Plan ({name}{info}): {spinner}
de: Plan wird erstellt ({name}{info}): {spinner}
es: Creando plan ({name}{info}): {spinner}
fr: Création du plan ({name}{info}) : {spinner}
ja: 計画の作成中 ({name}{info}): {spinner}

source: Creating Plan ({name} {pair}) {spinner}
de: Plan wird erstellt ({name} {pair}) {spinner}
es: Creando plan ({name} {pair}) {spinner}
fr: Création du plan ({name} {pair}) {spinner}
ja: 計画の作成中 ({name} {pair}) {spinner}

source: PKG
ja: パッケージ

source: Processed
de: Verarbeitet
es: Procesado
fr: Traité
ja: 処理済み

source: Reversioned
de: Reversioniert
es: Reversionado
fr: Versionnage modifié
ja: 復元済み

source: Adjusted
de: Angepasst
es: Ajustado
fr: Ajusté
ja: 調整済み

source: Creating Plan (Committing Manifests): {0}
de: Plan wird erstellt (Manifeste werden festgeschrieben): {0}
es: Creando plan (confirmando manifiestos): {0}
fr: Création du plan (validation des manifestes) : {0}
ja: 計画の作成中 (マニフェストのコミット中): {0}

source: Committing Manifests {0}
de: Manifeste {0} werden festgeschrieben
es: Confirmando manifiestos {0}
fr: Validation des manifestes {0}
ja: マニフェストのコミット中 {0}

source: Scanning repository (this could take some time)
de: Repository wird gescannt (dies kann etwas Zeit in Anspruch nehmen)
es: Analizando repositorio (esto puede demorar unos instantes)
fr: Analyse du référentiel (cette opération peut prendre un certain temps)
ja: リポジトリをスキャンしています (これにはしばらく時間がかかることがあります)

source: Unknown package
de: Unbekanntes Package
es: Paquete desconocido
fr: Package inconnu
ja: 不明なパッケージ

source: ARCHIVE
ja: アーカイブ

source: FILES
fr: FICHIERS
ja: ファイル
ru: ФАЙЛЫ

source: STORE (MB)
fr: STOCKAGE (Mo)
ja: 格納 (MB)

source: DOWNLOAD
fr: TELECHARGEMENT
ja: ダウンロード
ru: ЗАГРУЗКА

source: PKGS
fr: PACKAGES
ja: パッケージ
ru: ПАКЕТЫ

source: XFER (MB)
fr: XFER (Mo)
ja: 転送 (MB)

source: SPEED
fr: VITESSE
ja: 速度

source: Completed
de: Abgeschlossen
es: Completado
fr: Terminé
ja: 完了

source: PROCESS
fr: PROCESSUS
ja: 処理

source: ITEMS
fr: ELEMENTS
ja: 項目
ru: ЭЛЕМЕНТЫ

source: GET (MB)
fr: RECEVOIR (Mo)
ja: 取得 (MB)

source: SEND (MB)
fr: ENVOYER (Mo)
ja: 送信 (MB)

source: PHASE
ja: フェーズ
ru: ФАЗА

source: working
de: In Verarbeitung
es: en proceso
fr: traitement en cours
ja: 処理中

source: Linked image publisher check
de: Prüfung des Herausgebers des verknüpften Abbilds
es: Control de editor de imagen enlazada
fr: Vérification de l'éditeur de l'image liée
ja: リンクされたイメージのパブリッシャーの確認

source: {phasename} linked: {numdone} done
de: {phasename} verknüpft: {numdone} fertig
es: {phasename} enlazada: {numdone} terminada(s)
fr: {phasename} lié : {numdone} terminé
ja: {phasename} リンク済み: {numdone} 完了

source: {phase} linked: {numdone} done; {numworking:d} working: {running}
de: {phase} verknüpft: {numdone}; {numworking:d} in Verarbeitung: {running}
es: {phase} enlazada: {numdone} terminada(s); {numworking:d} en proceso: {running}
fr: {phase} lié : {numdone} terminé ; {numworking:d} en cours de traitement : {running}
ja: {phase} リンク済み: {numdone} 完了; {numworking:d} 処理中: {running}

source: Linked progress: {0}
de: Verknüpfter Fortschritt: {0}
es: Progreso de enlace: {0}
fr: Avancement images liées : {0}
ja: リンクの進行状況: {0}

source: Cannot enable or disable origin(s) for a system publisher
de: Ursprünge für einen Systemherausgeber können nicht aktiviert oder deaktiviert werden
es: No se pueden activar ni desactivar los orígenes de un editor del sistema
fr: Impossible d'activer ou de désactiver les origines pour un éditeur système
ja: システムパブリッシャーの起点を有効または無効にできません

source: Cannot enable or disable a system publisher
de: Ein Systemherausgeber kann nicht aktiviert oder deaktiviert werden
es: No se puede activar ni desactivar el editor del sistema
fr: Impossible d'activer ou de désactiver un éditeur système
ja: システムパブリッシャーを有効または無効にできません

source: Cannot change the stickiness of a system publisher
de: Die Stickiness eines Systemherausgebers kann nicht geändert werden
es: No se puede cambiar la permanencia de un editor del sistema
fr: Impossible de modifier l'adhérence d'un éditeur système
ja: システムパブリッシャーの持続性を変更できません

source: Unable to retrieve package data for publisher '{prefix}' from one of the following origin(s): {origins} The catalog retrieved from one of the origin(s) listed above only contains package data for: {pubs}.
de: Die Packagedaten des Herausgebers '{prefix}' können von einem der folgenden Ursprünge nicht abgerufen werden: {origins} Der von den oben aufgeführten Ursprüngen abgerufene Katalog enthält nur Packagedaten für {pubs}.
es: No se pueden recuperar para el editor '{prefix}' datos de paquete de uno de los siguientes orígenes: {origins} El catálogo recuperado de uno de los orígenes anteriormente mencionados solo contiene datos de paquete para: {pubs}.
fr: Impossible de récupérer les données de package de l'éditeur '{prefix}' à partir d'une des copies d'origines suivantes : {origins} Le catalogue récupéré de l'une des copies d'origine répertoriées ci-dessus contient uniquement les données de package de : {pubs}.
ja: パブリッシャー '{prefix}' のパッケージデータを 次の起点のいずれからも検出できません: {origins} 上記の起点一覧の 1 つから検出されたカタログには 次の日付のパッケージデータのみが含まれます: {pubs}。

source: This is either a result of invalid origin information being provided for publisher '{0}', or because the wrong publisher name was provided when this publisher was added.
de: Dies ist entweder darauf zurückzuführen, dass ungültige Ursprungsinformationen für den Herausgeber '{0}' angegeben wurden, oder dass beim Hinzufügen des Herausgebers ein falscher Herausgebername angegeben wurde.
es: El motivo es que la información de origen proporcionada para el editor '{0}' no es válida, o que el nombre del editor proporcionado cuando se agregó este editor es incorrecto.
fr: Le caractère non valide des informations de copie d'origine fournies pour l'éditeur '{0}' ou la spécification d'un nom d'éditeur incorrect lors de l'ajout de l'éditeur peut en être la cause.
ja: これはパブリッシャー '{0}' に関する誤った起点情報によるものか このパブリッシャーが追加されたときに誤ったパブリッシャー名をつけたことに よるものです。

source: To resolve this issue, correct the origin information provided for publisher '{prefix}' using the pkg set-publisher subcommand, or re-add the publisher using the correct name and remove the '{prefix}' publisher.
de: Um das Problem zu lösen, geben Sie entweder die richtigen Ursprungsinformationen für den Herausgeber '{prefix}' mit dem Unterbefehl pkg set-publisher an, oder fügen Sie den Herausgeber mit den richtigen Namen erneut hinzu, und löschen Sie den Herausgeber '{prefix}'.
es: Para solucionar este problema, corrija la información del origen proporcionada para el editor '{prefix}' mediante el subcomando pkg set-publisher o vuelva a agregar el editor usando el nombre correcto y elimine el editor '{prefix}'.
fr: Pour résoudre ce problème, corrigez les informations d'origine fournies pour l'éditeur '{prefix}' à l'aide de la sous-commande pkg set-publisher ou ajoutez à nouveau l'éditeur avec le nom approprié, puis supprimez l'éditeur '{prefix}'.
ja: この問題を解決するには、pkg set-publisher サブコマンドを使用して パブリッシャー '{prefix}' の起点情報を修正するか、正しい名前でパブリッシャーを再度追加してから パブリッシャー '{prefix}' を削除します。

source: To re-add this publisher with the correct name, execute the following commands as a privileged user: pkg set-publisher -P -g {origin} {pub} pkg unset-publisher {prefix}
de: Um diesen Herausgeber mit dem richtigen Namen neu hinzuzufügen, führen Sie die folgenden Befehle als privilegierter Benutzer aus: npkg set-publisher -P -g {origin} {pub} pkg unset-publisher {prefix}
es: Para volver a agregar este editor con el nombre correcto, ejecute los siguientes comandos como usuario con privilegios: pkg set-publisher -P -g {origin} {pub} pkg unset-publisher {prefix}
fr: Pour ajouter à nouveau cet éditeur en lui donnant le nom approprié, exécutez les commandes suivantes en tant qu'utilisateur privilégié : pkg set-publisher -P -g {origin} {pub} pkg unset-publisher {prefix}
ja: このパブリッシャーを正しい名前で再度追加するには、特権ユーザーとして次のコマンドを実行します: pkg set-publisher -P -g {origin} {pub} pkg unset-publisher {prefix}

source: The origin(s) listed above contain package data for more than one publisher, but this issue can likely be resolved by executing one of the following commands as a privileged user:
ca: Els orígens llistats a continuació contenen les dades de paquet per més d'un publicador, però aquesta incidència podria ser resolta d'una manera similar executant una de les següents comandes com usuari amb privilegis:
de: Die oben aufgeführten Ursprünge enthalten Paketdaten für mehr als einen Herausgeber. Sie können dieses Problem wahrscheinlich lösen, indem Sie einen der folgenden Befehle als privilegierter Benutzer ausführen:
es: Los orígenes mencionados anteriormente contienen datos de paquete para más de un editor, pero es probable que este problema se resuelva con la ejecución de uno de los siguientes comandos como usuario con privilegios:
fr: Les copies d'origine répertoriées ci-dessus contiennent les données de package issues de plusieurs éditeurs, mais ce problème peut être résolu simplement en exécutant l'une des commandes suivantes en tant qu'utilisateur privilégié :
ja: 上記の起点一覧は複数のパブリッシャーのパッケージデータを含んでいます。 ただしこの問題は特権ユーザーとして次のコマンドのいずれかを実行することで 解決できるでしょう:
ru: Источник или источники, перечисленные выше, содержат данные пакетов для нескольких издателей, однако для решения этой проблемы, вероятно, достаточно запустить одну из следующих команд от имени привилегированного пользователя:

source: Afterwards, the old publisher should be removed by executing the following command as a privileged user: pkg unset-publisher {0}
de: Anschließend müssen Sie den alten Herausgeber entfernen, indem Sie den folgenden Befehl als privilegierter Benutzer ausführen: pkg unset-publisher {0}
es: Posteriormente, el editor antiguo se debe eliminar mediante la ejecución del siguiente comando como usuario con privilegios: pkg unset-publisher {0}
fr: Ensuite, vous devez supprimer l'ancien éditeur en exécutant la commande suivante en tant qu'utilisateur privilégié : pkg unset-publisher {0}
ja: その後、特権ユーザーとして次のコマンドを実行することで 旧パブリッシャーを削除できます: pkg unset-publisher {0}

source: The file with hash {0} was expected to be a PEM certificate but it could not be read.
de: Es wurde erwartet, dass die Datei mit Hash {0} ein PEM-Zertifikat ist. Die Datei konnte jedoch nicht gelesen werden.
es: Se esperaba que el archivo con el hash {0} fuera un certificado PEM pero no se ha podido leer.
fr: Le fichier à hachage {0} devait être un certificat PEM mais il n'a pu être lu.
ja: ハッシュ {0} のファイルは PEM 証明書のはずでしたが、読み取れませんでした。

source: The following string was expected to be a PEM certificate, but it could not be parsed as such: {0}
de: Es wurde erwartet, dass die folgende Zeichenfolge ein PEM-Zertifikat ist. Sie konnte jedoch nicht als solche analysiert werden: {0}
es: Se esperaba que la siguiente cadena fuera un certificado PEM, pero no se pudo analizar como tal: {0}
fr: La chaîne suivante devait être un certificat PEM, mais elle n'a pas pu être analysée en tant que tel : {0}
ja: 次の文字列は PEM 証明書のはずでしたが、そのように構文解析できませんでした: {0}

source: Cannot add a value to a single valued property, The property name is '{name}' and the current value is '{value}'
de: Zu einer einwertigen Eigenschaft kann kein Wert hinzugefügt werden. Der Eigenschaftsname ist '{name}', und der aktuelle Wert ist '{value}'
es: No se puede agregar un valor a una propiedad con un solo valor. El nombre de la propiedad es '{name}' y el valor actual es '{value}'
fr: Impossible d'ajouter une valeur à une propriété à valeur unique. Le nom de la propriété est '{name}' et sa valeur actuelle est '{value}'
ja: 単一値プロパティーに値を追加できません。プロパティー名は '{name}'、現在の値は '{value}' です

source: Cannot remove a value from the property {name} because the property does not exist.
de: Wert kann nicht aus der Eigenschaft {name} entfernt werden, da diese Eigenschaft nicht vorhanden ist.
es: No se puede eliminar un valor de la propiedad {name} porque la propiedad no existe.
fr: Impossible de supprimer une valeur de la propriété {name} car cette dernière n'existe pas.
ja: プロパティー {name} は存在しないため、このプロパティーから値を削除できません。

source: Cannot remove a value from a single valued property, unset must be used. The property name is '{name}' and the current value is '{value}'
de: Aus einer Eigenschaft mit nur einem Wert kann kein Wert entfernt werden. Verwenden Sie 'unset'. Der Name der Eigenschaft lautet '{name}' und der aktuelle Wert ist '{value}'
es: No se puede eliminar un valor de una propiedad con un solo valor; debe usar el argumento unset. El nombre de la propiedad es '{name}' y el valor actual es '{value}'
fr: Impossible de supprimer une valeur d'une propriété à valeur unique ; vous devez annuler son paramétrage. Le nom de la propriété est '{name}' et sa valeur actuelle est '{value}'
ja: 単一値プロパティーから値を削除できません。unset を使用する必要があります。プロパティー名は '{name}'、現在の値は '{value}' です

source: Cannot remove the value {value} from the property {name} because the value is not in the property's list.
de: Der Wert {value} kann nicht aus der Eigenschaft {name} entfernt werden, da er sich nicht in der Eigenschaftsliste befindet.
es: No se puede eliminar el valor {value} de la propiedad {name} porque este valor no se encuentra en la lista de la propiedad.
fr: Impossible de supprimer la valeur {value} de la propriété {name} car cette valeur ne figure pas dans la liste de la propriété.
ja: プロパティー {name} のリストに値 {value} は含まれていないため、プロパティーからこの値を削除できません。

source: Cannot set a property for a system publisher. The property was:{0}
de: Die Eigenschaft eines Systemherausgebers kann nicht festgelegt werden. Die Eigenschaft war: {0}
es: No se puede configurar una propiedad para un editor del sistema. La propiedad era:{0}
fr: Impossible de définir une propriété pour un éditeur système. La propriété était :{0}
ja: システムパブリッシャーのプロパティーを設定できません。プロパティー: {0}

source: {val} is not a valid value for this property:{prop}
de: {val} ist kein gültiger Wert für diese Eigenschaft: {prop}
es: {val} no es un valor válido para esta propiedad:{prop}
fr: {val} n'est pas une valeur valide pour cette propriété :{prop}
ja: {val} は、次のプロパティーに有効な値ではありません: {prop}

source: The {0} signature-policy takes no argument.
de: Die Signaturrichtlinie {0} akzeptiert kein Argument.
es: La directiva de firma {0} no acepta argumentos.
fr: La politique des signatures {0} n'utilise aucun argument.
ja: {0} 署名ポリシーは引数をとりません。

source: Cannot unset a property for a system publisher. The property was:{0}
de: Die Eigenschaft eines Systemherausgebers kann nicht entfernt werden. Die Eigenschaft war: {0}
es: No se puede anular una propiedad para un editor del sistema. La propiedad era:{0}
fr: Impossible d'annuler le paramétrage d'une propriété pour un éditeur système. La propriété était :{0}
ja: システムパブリッシャーのプロパティーを解除できません。プロパティー: {0}

source: Cannot unset a property for a system publisher.
de: Die Eigenschaft eines Systemherausgebers kann nicht entfernt werden.
es: No se puede anular una propiedad para un editor del sistema.
fr: Impossible d'annuler le paramétrage d'une propriété pour un éditeur système.
ja: システムパブリッシャーのプロパティーを解除できません。

source: (happened {0:d} times)
de: ({0:d} mal aufgetreten)
es: (ocurrió {0:d} veces)
fr: (s'est produit {0:d} fois)
ja: ({0:d} 回発生しました)

source: This account is not entitled to access this repository. Ensure that the correct certificate is being used and that the support contract for the product being accessed is still valid.
de: Dieses Konto verfügt über keine Berechtigung zum Zugriff auf dieses Repository. Vergewissern Sie sich, dass das korrekte Zertifikat verwendet wird, und prüfen Sie, ob der Supportvertrag des Produktes, auf das zugegriffen wird, noch gültig ist.
es: Esta cuenta no está autorizada para acceder a este repositorio. Asegúrese de que se utilice el certificado correcto y de que el contrato de asistencia del producto al que se está accediendo aún sea válido.
fr: Ce compte n'est pas autorisé à accéder à ce référentiel. Vérifiez que le certificat correct est utilisé et que le contrat de support du produit auquel vous accédez est toujours valide.
ja: このアカウントには、このリポジトリにアクセスする資格がありません。正しい証明書を 使用していることと、アクセスしている製品のサポート契約がまだ有効であることを 確認してください。

source: The license agreement required to access this repository has not been accepted yet or the license agreement for the product has changed. Please go to https://pkg-register.oracle.com and accept the license for the product you are trying to access.
de: Die für den Zugriff auf dieses Repository erforderliche Lizenzvereinbarung wurde noch nicht akzeptiert, oder die Lizenzvereinbarung wurde geändert. Rufen Sie https://pkg-register.oracle.com auf, und akzeptieren Sie die Lizenz für das Produkt, auf das Sie zugreifen möchten.
es: El contrato de licencia requerido para acceder a este repositorio no se ha aceptado aún o el contrato de licencia del producto ha cambiado. Vaya a https://pkg-register.oracle.com y acepte la licencia del producto al que está intentando acceder.
fr: L'accord de licence requis pour accéder à ce référentiel n'a pas encore été accepté, ou l'accord de licence du produit a changé. Rendez-vous sur https://pkg-register.oracle.com et acceptez la licence du produit que vous tentez d'utiliser.
ja: このリポジトリへのアクセスに必要なライセンス契約に まだ同意していないか、製品のライセンス契約が変更されています。 https://pkg-register.oracle.com にアクセスし、アクセスしようとしている製品のライセンスに 同意してください。

source: Repository access is currently unavailable due to service issues. Please retry later or contact your customer service representative.
de: Das Repository ist aufgrund von Serviceproblemen derzeit nicht verfügbar. Versuchen Sie es später erneut, oder kontaktieren Sie den für Sie zuständigen Kundenservicemitarbeiter.
es: El acceso al repositorio actualmente no está disponible por problemas de servicio. Vuelva a intentarlo más tarde o comuníquese con el representante de atención al cliente.
fr: Le référentiel n'est pas actuellement accessible en raison de problèmes de service. Réessayez plus tard ou contactez un représentant du service client.
ja: サービスの問題のため、リポジトリへのアクセスは現在使用できません。あとで 再試行するか、顧客サービス担当者に問い合せてください。

source: Repository access rights can currently not be verified due to server maintenance. Please retry later.
de: Zugriffsrechte für das Repository können aufgrund von Wartungsarbeiten am Server derzeit nicht überprüft werden. Versuchen Sie es später erneut.
es: En este momento no se pueden verificar los derechos de acceso al repositorio debido al mantenimiento del servidor. Vuelva a intentarlo más tarde.
fr: La vérification des droits d'accès au référentiel est actuellement impossible car le serveur est en maintenance. Veuillez réessayer plus tard.
ja: サーバーの保守のため、リポジトリへのアクセス権を現在検証できません。 あとで再試行してください。

source: The configuration file for the repository is invalid or incomplete: {0}
de: Die Konfigurationsdatei für das Repository ist ungültig oder unvollständig: {0}
es: El archivo de configuración para el repositorio no es válido o está incompleto: {0}
fr: Le fichier de configuration du référentiel n'est pas valide ou est incomplet : {0}
ja: リポジトリの構成ファイルが無効または不完全です: {0}

source: Search temporarily unavailable.
de: Die Suchfunktion ist vorübergehend nicht verfügbar.
es: La función de búsqueda no está disponible temporalmente.
fr: La recherche est temporairement non disponible.
ja: 検索は一時的に使用できません。
ru: Поиск временно недоступен.

source: The CRL file {0} is not in a recognized format.
de: Die CRL-Datei {0} hat kein bekanntes Format.
es: El archivo CRL {0} no está en un formato reconocido.
fr: Le fichier CRL {0} n'utilise pas un format reconnu.
ja: CRL ファイル {0} は認識できない形式です。

source: CRL root: {0}
es: CRL raíz: {0}
fr: Root CRL : {0}
ja: CRL ルート: {0}

source: Property name '{0}' is not valid. Section names may not contain: tabs, newlines, carriage returns, form feeds, vertical tabs, slashes, backslashes, or non-ASCII characters.
de: Eigenschaftsname '{0}' ist ungültig. Folgende Zeichen dürfen in Eigenschaftsnamen nicht enthalten sein: Tabulatoren,Zeilenumbrüche, Wagenrückläufe, Seitenvorschübe, vertikale Tabulatoren, Schrägstriche, umgekehrte Schrägstriche oder Nicht-ASCII-Zeichen.
es: El nombre de la propiedad '{0}' no es válido. Los nombres de propiedades no pueden contener tabulaciones, líneas nuevas, retornos de carro, avances de página, tabulaciones verticales, barras diagonales, barras diagonales inversas ni caracteres que no sean ASCII.
fr: Le nom de propriété '{0}' n'est pas valide. Les noms de propriétés ne peuvent pas contenir les caractères suivants : tabulations, nouvelles lignes, retours chariot, sauts de page, tabulations verticales, barres obliques, barres obliques inverses, ni des caractères qui ne sont pas des caractères ASCII.
ja: プロパティー名 '{0}' は有効ではありません。セクション名に次の文字を含めることはできません: タブ、改行、キャリッジリターン、用紙送り、垂直タブ、スラッシュ、バックスラッシュ、ASCII 以外の文字。

source: Property template name '{0}' is not valid.
de: Eigenschaftsvorlagenname '{0}' ist ungültig.
es: El nombre de la plantilla de propiedades '{0}' no es válido.
fr: Le nom du modèle de propriété '{0}' n'est pas valide.
ja: プロパティーテンプレート名 '{0}' は無効です。
