Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Argument '{op1}' for option '{op2}' may not be repeated.
de: Argument '{op1}' für Option '{op2}' kann nicht wiederholt werden.
es: El argumento '{op1}' para la opción '{op2}' no se puede repetir.
fr: L'argument '{op1}' pour l'option '{op2}' ne peut pas être répété.
ja: オプション '{op2}' の引数 '{op1}' を繰り返すことはできません。

source: Argument '{op1}' for option '{op2}' is invalid.
de: Argument '{op1}' für Option '{op2}' ist ungültig.
es: El argumento '{op1}' para la opción '{op2}' no es válido.
fr: L'argument '{op1}' pour l'option '{op2}' n'est pas valide.
ja: オプション '{op2}' の引数 '{op1}' が無効です。

source: Supported: {0}
de: Unterstützt: {0}
es: Compatible: {0}
fr: Pris en charge : {0}
ja: サポート: {0}

source: The '{op1}' and '{op2}' option may not be combined.
de: Die Optionen '{op1}' und '{op2}' können nicht kombiniert werden.
es: Las opciones '{op1}' y '{op2}' no se pueden combinar.
fr: Il est impossible de combiner les options '{op1}' et '{op2}'.
ja: '{op1}' および '{op2}' オプションを組み合わせることはできません。

source: '{op1}' may only be used with '{op2}'.
de: '{op1}' kann nur mit '{op2}' verwendet werden.
es: '{op1}' solo se puede usar con '{op2}'.
fr: '{op1}' peut uniquement être utilisé avec '{op2}'.
ja: '{op1}' は '{op2}' とのみ組み合わせることができます。

source: '{op1}' may only be used with '{op2}' or {op3}.
de: '{op1}' kann nur mit '{op2}' oder {op3} verwendet werden.
es: '{op1}' solo se puede usar con '{op2}' o {op3}.
fr: '{op1}' peut uniquement être utilisé avec '{op2}' ou {op3}.
ja: '{op1}' は '{op2}' または '{op3}' とのみ組み合わせることができます。

source: Either '{op1}' or '{op2}' must be specified
de: '{op1}' oder '{op2}' muss angegeben werden
es: Se debe especificar '{op1}' o '{op2}'
fr: Vous devez indiquer '{op1}' ou '{op2}
ja: '{op1}' または '{op2}' のどちらかを指定する必要があります

source: invalid option(s):
de: Ungültige Option(en):
es: opción(es) no válida(s):
fr: option(s) non valide(s) :
ja: 無効なオプション:

source: Cannot update file: '{file}' at path '{path}', contains a symlink. [Error '{errno:d}': '{error}']
de: Datei '{file}' in Pfad '{path}' kann nicht aktualisiert werden, enthält einen Symlink. [Fehler '{errno:d}': '{error}']
es: No se puede actualizar el archivo: '{file}' en la ruta '{path}'; contiene un symlink. [Error '{errno:d}': '{error}']
fr: Impossible de mettre à jour le fichier : '{file}' sur le chemin '{path}', contient un lien symbolique. [Erreur '{errno:d}' : '{error}']
ja: ファイルを更新できません: パス '{path}' にある '{file}' にシンボリックリンクが含まれています。[エラー '{errno:d}': '{error}']

source: Cannot parse configuration file {path}'.
de: Konfigurationsdatei {path}' kann nicht geparst werden.
es: No se puede analizar el archivo de configuración '{path}'.
fr: Impossible d'analyser le fichier de configuration '{path}'.
ja: 構成ファイル {path}' を解析できません。

source: Globbing is not supported for variants.
de: Globbing wird für Varianten nicht unterstützt.
es: No se admite realizar glob para variantes.
fr: Le développement (globbing) n'est pas pris en charge pour les variantes.
ja: バリアントのグロビング機能はサポートされていません。

source: pkg: A system error {e} was caught executing {cmd}
de: pkg: Ein Systemfehler {e} wurde bei der Ausführung von {cmd} abgefangen
es: pkg: error del sistema {e} al ejecutar {cmd}
fr: pkg : une erreur système {e} a été détectée lors de l'exécution de {cmd}
ja: pkg: システムエラー {e} が {cmd} の実行中に検出されました

source: pkg: '{cmd}' failed. with a return code of {ret:d}.
de: pkg: '{cmd}' war nicht erfolgreich. mit einem Rückgabecode von {ret:d}.
es: pkg: se produjo un error en '{cmd}' con el código de error de {ret:d}.
fr: pkg : échec de {cmd}. avec un code de retour de {ret:d}.
ja: pkg: '{cmd}' が失敗しました。 リターンコードは {ret:d} です。

source: pkg: unable to create an auto snapshot. pkg recovery is disabled.
ca: pkg: no es pot crear una instantània automàtica. pkg recovery està deshabilitat.
de: pkg: Auto-Snapshot kann nicht erstellt werden. Paketwiederherstellung wurde deaktiviert.
es: pkg: no se puede crear una instantánea automática. La recuperación de pkg está desactivada.
fr: pkg : impossible de créer un instantané automatique. La récupération de package est désactivée.
ja: pkg: 自動スナップショットを作成できません。pkg の復元が無効になっています。
ru: pkg: невозможно создать автоснимок. Восстановление pkg запрещено.

source: pkg: unable to activate {0}
de: pkg: {0} kann nicht aktiviert werden
es: pkg: no se puede activar {0}
fr: pkg : impossible d'activer {0}
ja: pkg: {0} をアクティブにすることができません

source: unable to unmount BE {be_name} mounted at {be_path}
de: BU {be_name}, die in {be_path} eingehängt ist, kann nicht ausgehängt werden
es: no se puede desmontar el entorno de inicio {be_name} montado en {be_path}
fr: impossible de démonter l'environnement d'initialisation {be_name} monté sur {be_path}
ja: {be_path} にマウントされている BE {be_name} をアンマウントできません

source: A clone of {be_name} exists and has been updated and activated. On the next boot the Boot Environment {be_name_clone} will be mounted on '/'. Reboot when ready to switch to this updated BE.
de: Ein Klon von {be_name} ist bereits vorhanden und wurde aktualisiert und aktiviert. Beim nächsten Boot-Vorgang wird die Boot- Umgebung {be_name_clone} bei '/' eingehängt. Starten Sie neu, sobald Sie zu dieser aktualisierten BU wechseln können.
es: Existe un clon de {be_name} y se ha actualizado y activado. En el próximo inicio, el entorno de inicio {be_name_clone} se montará en '/'. Reinicie cuando esté listo para cambiar a este entorno de inicio actualizado.
fr: Un clone de {be_name} existe et a été mis à jour et activé. A la prochaine initialisation, l'environnement d'initialisation {be_name_clone} sera monté sur '/'. Réinitialisez dès que vous êtes prêt à passer à cet environnement d'initialisation.
ja: {be_name} のクローンが存在しており、それが更新およびアクティブ化されました。 次回ブート時にはブート環境 {be_name_clone} が '/' にマウントされます。準備が 整ったらリブートしてこの更新済みの BE に切り替えてください。

source: A clone of {be_name} exists and has been updated. To set the new BE as the active one on next boot, execute the following command as a privileged user and reboot when ready to switch to the updated BE: beadm activate {be_name_clone}
de: Ein Klon von {be_name} ist bereits vorhanden und wurde aktualisiert. Um beim nächsten Start die neue BU als die aktive festzulegen, führen Sie den folgenden Befehl als privilegierter Benutzer aus, und führen Sie einen Neustart aus, sobald Sie den Wechsel zur aktualisierten BU durchführen können: beadm activate {be_name_clone}
es: Existe un clon de {be_name} y se ha actualizado. Para configurar el nuevo entorno de inicio como el entorno activo en el próximo inicio, ejecute el siguiente comando como usuario con privilegios y reinicie cuando esté listo para cambiar a este entorno de inicio actualizado: beadm activate {be_name_clone}
fr: Un clone de {be_name} existe et a été mis à jour. Pour faire du nouvel environnement d'initialisation (BE) le BE actif à la prochaine initialisation, exécutez la commande suivante en tant qu'utilisateur privilégié lorsque vous êtes prêt à passer au BE mis à jour : beadm activate {be_name_clone}
ja: {be_name} のクローンが存在しており、それが更新されました。新しい BE を次回 ブート時のアクティブな BE に設定するには、特権ユーザーとして次のコマンドを 実行し、準備が整ったらリブートしてこの更新済みの BE に切り替えてください。 beadm activate {be_name_clone}

source: {0} has been updated successfully
de: {0} wurde erfolgreich aktualisiert
es: {0} se ha actualizado correctamente
fr: {0} a été mis à jour
ja: {0} の更新に成功しました

source: The running system has not been modified. Modifications were only made to a clone of the running system. This clone is mounted at {0} should you wish to inspect it.
de: Das derzeit ausgeführte System wurde nicht verändert. Die Änderungen wurden lediglich an einem Klon vorgenommen. Dieser Klon ist in {0} geladen, falls Sie ihn prüfen möchten.
es: El sistema en ejecución no se modificó. Solo se han hecho modificaciones en una clonación del sistema en ejecución. Esta clonación está montada en {0} si desea inspeccionarla.
fr: Le système en cours d'exécution n'a pas été modifié. Les modifications ont uniquement été apportées à un clone du système en cours d'exécution. Ce clone est monté sur {0}, si vous souhaitez l'examiner.
ja: 稼働中のシステムは変更されませんでした。変更が加えられたのは、稼働中のシステムのクローンに対してだけです。このクローンは {0} にマウントされているため、必要に応じて調査を行なってください。

source: pkg: unable to rollback BE {0} and restore image
de: pkg: Zurücksetzen der BU {0} und Wiederherstellung des Abbilds nicht möglich
es: pkg: no se puede invertir el entorno de inicio {0} y restaurar la imagen
fr: pkg : impossible de restaurer l'environnement d'initialisation {0} et l'image
ja: pkg: BE {0} をロールバックしてイメージを復元できません

source: {bename} failed to be updated. No changes have been made to {bename}.
de: {bename} konnte nicht aktualisiert werden. Es wurden keine Änderungen an {bename} vorgenommen.
es: {bename} no se ha podido actualizar. No se han efectuado cambios en {bename}.
fr: Echec de la mise à jour de {bename}. Aucune modification n'a été apportée à {bename}.
ja: {bename} の更新に失敗しました。{bename} は変更されていません。

source: pkg: unable to destroy snapshot {0}
de: pkg: Snapshot {0} kann nicht entfernt werden
es: pkg: no se puede destruir la instantánea {0}
fr: pkg : impossible de détruire l'instantané {0}
ja: pkg: スナップショット {0} を破棄できません

source: pkg: unable to create BE from snapshot {0}
de: pkg: BU kann nicht aus Snapshot {0} erstellt werden
es: pkg: no se puede crear el entorno de inicio a partir de la instantánea {0}
fr: pkg : impossible de créer l'environnement d'initialisation depuis l'instantané {0}
ja: pkg: スナップショット {0} から BE を作成できません

source: pkg: unable to mount BE {name} on {clone_dir}
de: pkg: BU {name} kann nicht in {clone_dir} eingehängt werden
es: pkg: no se puede montar el entorno de inicio {name} en {clone_dir}
fr: pkg : impossible de monter l'environnement d'initialisation {name} sur {clone_dir}
ja: pkg: BE {name} を {clone_dir} にマウントできません

source: The Boot Environment {name} failed to be updated. A snapshot was taken before the failed attempt and is mounted here {clone_dir}. Use 'beadm unmount {clone_name}' and then 'beadm activate {clone_name}' if you wish to boot to this BE.
de: Die Boot-Umgebung {name}s konnte nicht aktualisiert werden. Vor dem nicht erfolgreichen Versuch wurde ein Snapshot erstellt und hier eingehängt: {clone_dir}. Verwenden Sie 'beadm unmount {clone_name}' und 'beadm activate {clone_name}', wenn Sie diese BU booten möchten.
es: El entorno de inicio {name} no se pudo actualizar. Se tomó una instantánea antes del intento fallido y se montó aquí {clone_dir}. Use 'beadm unmount {clone_name}' y, a continuación, 'beadm activate {clone_name}' si desea iniciar en este entorno.
fr: Echec de la mise à jour de l'environnement d'initialisation {name}. Un instantané pris avant la tentative infructueuse est monté ici : {clone_dir}. Pour effectuer une initialisation sur cet environnement d'initialisation, utilisez les commandes 'beadm unmount {clone_name}', puis 'beadm activate {clone_name}'.
ja: ブート環境 {name} の更新に失敗しました。失敗した試行をする前に取られたスナップショットが存在しており、それが {clone_dir} にマウントされています。この BE にブートする場合は、'beadm unmount {clone_name}' を使用してから 'beadm activate {clone_name}' を使用してください。

source: The Boot Environment {bename} failed to be updated. A snapshot was taken before the failed attempt and has been restored so no changes have been made to {bename}.
de: Die Boot-Umgebung {bename} konnte nicht aktualisiert werden. Vor dem nicht erfolgreichen Versuch wurde ein Snapshot erstellt und wiederhergestellt. Es wurden also keine Änderungen an {bename} vorgenommen.
es: El entorno de inicio {bename} no se pudo actualizar. Se tomó una instantánea antes del intento fallido y se la restauró, de modo que no se han efectuado cambios en {bename}.
fr: Echec de la mise à jour de l'environnement d'initialisation {bename}. Un instantané a été pris avant la tentative infructueuse et a été restauré. Ainsi, aucune modification n'a été apportée à {bename}.
ja: ブート環境 {bename} の更新に失敗しました。この試みが失敗する前に取得していたスナップショットが復元されたため、{bename} は変更されていません。

source: pkg: unable to create BE {0}
de: pkg: BU {0} kann nicht erstellt werden
es: pkg: no se puede crear el entorno de inicio {0}
fr: pkg : impossible de créer l'environnement d'initialisation {0}
ja: pkg: BE {0} を作成できません

source: {0}/{1} repositories for publisher '{2}' could not be refreshed.
de: {0}/{1} Repositorys für Herausgeber '{2}' konnten nicht aktualisiert werden.
es: No fue posible refrescar {0}/{1} repositorios para el editor '{2}'.
fr: {0}/{1} référentiels pour l'éditeur '{2}' n'ont pas pu être actualisés.
ja: パブリッシャー '{2}' のリポジトリ {0}/{1} 個がリフレッシュできませんでした。

source: no packages installed or available for installation
de: Keine Pakete installiert oder zur Installation verfügbar
es: no hay paquetes instalados ni disponibles para instalar
fr: aucun package n'est installé ni disponible pour l'installation
ja: インストール済みのパッケージまたはインストールに使用可能なパッケージが存在しません
ru: отсутствуют установленные или доступные для установки пакеты

source: no packages have newer versions available
de: kein Paket verfügt über eine neuere Version
es: no hay paquetes con versiones más recientes disponibles
fr: aucune version plus récente n'est disponible pour aucun package
ja: より新しいバージョンが使用可能になっているパッケージが存在しません

source: no packages are installed
de: keine Pakete installiert
es: no hay paquetes instalados
fr: aucun package n'est installé
ja: インストール済みのパッケージが存在しません

source: no known packages matching: {0}
de: Keine bekannte Packageübereinstimmung: {0}
es: no hay paquetes conocidos que coincidan con: {0}
fr: aucun package correspondant à {0} n'existe
ja: 一致する既知のパッケージが存在しません: {0}

source: no packages matching the following patterns are allowed by installed incorporations, or image variants that are known or installed {0}
de: Keine Packages, die den folgenden Mustern entsprechen, werden von den installierten Inkorporationen oder den installierten bzw. bekannten Imagevarianten zugelassen. {0}
es: no hay paquetes que coincidan con los siguientes patrones que estén permitidos por las incorporaciones instaladas ni por las variantes de imagen conocidas o instaladas {0}
fr: aucun package correspondant aux critères suivants n'est autorisé par les incorporations installées et aucune variante d'image n'existe ou n'est installée {0}
ja: インストール済みの incorporation あるいは既知またはインストール済みのイメージバリアントで許可されている、次のパターンに一致するパッケージが存在しません {0}

source: no packages matching the following patterns are installed: {0}
de: Keine Packages, die den folgenden Mustern entsprechen, sind installiert: {0}
es: no hay paquetes instalados que coincidan con los siguientes patrones: {0}
fr: aucun package correspondant aux critères suivants n'est installé : {0}
ja: 次のパターンに一致するパッケージはインストールされていません: {0}

source: no updates are available for the following packages: {0}
de: Für die folgenden Packages sind keine Updates verfügbar: {0}
es: no hay actualizaciones disponibles para los siguientes paquetes: {0}
fr: aucune mise à jour n'est disponible pour les packages suivants : {0}
ja: 次のパッケージに使用できる更新はありません: {0}

source: The following packages require their licenses to be accepted before they can be installed or updated: {0}
de: Die Lizenzen für die folgenden Packages müssen akzeptiert werden, bevor sie installiert oder aktualisiert werden können: {0}
es: Los siguientes paquetes necesitan licencia para ser aceptados antes de proceder a su instalación o actualización: {0}
fr: Il est nécessaire que les licences des packages suivants soient acceptées pour qu'ils puissent être installés ou mis à jour : {0}
ja: 次のパッケージはインストールないし更新する前にライセンスに同意する必要があります: {0}

source: An unexpected error happened while preparing for {op}: {err}
de: Bei der Vorbereitung von {op} ist ein unerwarteter Fehler aufgetreten: {err}
es: Se produjo un error inesperado durante la preparación para {op}: {err}
fr: Une erreur inattendue s'est produite lors de la préparation de la commande {op} : {err}
ja: {op} の準備中に予期しないエラーが発生しました: {err}

source: The following unexpected or editable files and directories were salvaged while executing the requested package operation; they have been moved to the displayed location in the image:
de: Folgende unerwartete oder bearbeitbare Dateien und Verzeichnisse wurden beim Ausführen des angeforderten Packagevorgangs wiederhergestellt. Sie wurden in das angezeigte Verzeichnis im Image verschoben:
es: Se recuperaron los siguientes archivos y directorios editables o inesperados al ejecutar la operación de paquetes solicitada; se movieron a la ubicación que se muestra en la imagen:
fr: Les fichiers et répertoires inattendus ou modifiables suivants ont été récupérés lors de l'exécution de l'opération de package demandée ; ils ont été placés à l'emplacement affiché dans l'image :
ja: 要求されたパッケージ操作の実行中に次の予期しないまたは 編集可能なファイルおよびディレクトリが回収されました。 これらは、イメージ内の表示された場所に移動されています:

source: at least one package name required
ca: com a mínim es necessita el nom d'un paquet
de: Mindestens ein Paketname ist erforderlich
es: se necesita al menos un nombre de paquete
fr: au moins un nom de package est requis
ja: パッケージ名を少なくとも 1 つ指定する必要があります
ru: необходимо хотя бы одно название пакета

source: requires a publisher name
ca: El nom del publicador és obligatori
de: Der Name eines Herausgebers ist erforderlich.
es: precisa el nombre de un editor
fr: Un nom d'éditeur est requis.
ja: パブリッシャー名が必要です
ru: требуется имя издателя

source: only one publisher name may be specified
ca: solament s'ha d'especificar el nom d'un publicador
de: Sie können nur einen Namen für den Herausgeber angeben.
es: sólo se puede especificar el nombre de un editor
fr: Vous ne pouvez spécifier qu'un seul nom d'éditeur.
ja: 指定できるパブリッシャー名は 1 つだけです
ru: можно ввести только одно имя издателя

source: The specified repository did not contain any publisher configuration information. This is likely the result of a repository configuration error. Please contact the repository administrator for further assistance.
de: Das angegebene Repository enthielt keine Informationen zur Herausgeberkonfiguration. Möglicherweise ist die Repository-Konfiguration fehlerhaft. Wenden Sie sich an den Repository-Administrator, um weitere Unterstützung zu erhalten.
es: El repositorio especificado no contenía datos de configuración de editor. Éste puede ser el resultado de un error de configuración del repositorio. Póngase en contacto con el administrador del repositorio para obtener asistencia.
fr: Le référentiel spécifié ne contient aucune information de configuration d'éditeur. Il s'agit probablement d'une erreur de configuration du référentiel. Veuillez contacter l'administrateur du référentiel pour obtenir de l'aide.
ja: 指定されたリポジトリにはパブリッシャーの構成情報が含まれていませんでした。 これはリポジトリ構成のエラーが原因と考えられます。 サポートが必要な場合は、リポジトリの管理者に 連絡してください。
ru: Указанное хранилище не содержит данные об издателе. Возможно, это результат ошибки в настройках хранилища. Обратитесь к администратору хранилища для получения поддержки.

source: at least one publisher must be specified
ca: com a mínim s'ha d'especificar un publicador
de: Es muss mindestens ein Herausgeber angegeben werden
es: se debe especificar al menos un editor
fr: au moins un éditeur doit être spécifié
ja: パブリッシャーが少なくとも 1 つ指定されている必要があります
ru: необходимо указать минимум одного издателя

source: Removal failed for '{pub}': {msg}
de: Entfernen von '{pub}' nicht erfolgreich: {msg}
es: Se produjo un error al eliminar '{pub}': {msg}
fr: Echec de la suppression pour '{pub}' : {msg}
ja: '{pub}' の削除に失敗しました: {msg}

source: TYPE
ca: TIPUS
ja: タイプ

source: LOCATION
fr: EMPLACEMENT
ja: 場所

source: STICKY
fr: RESIDENT
ja: 固定的
ru: КЛЕЙКИЙ

source: ENABLED
fr: ACTIVE
ja: 有効
ru: ВКЛЮЧЕНО

source: PROXY
ja: プロキシ

source: disabled
ca: deshabilitat
de: deaktiviert
es: desactivado
fr: désactivé
ja: 無効
ru: отменено

source: origin
ca: origen
de: Quelle
es: origen
fr: origine
ja: 起点
ru: источник

source: online
es: en línea
fr: en ligne
ja: オンライン
ru: интерактивный; онлайн

source: mirror
ca: rèplica
de: Spiegel
es: reflejo
fr: miroir
ja: ミラー
ru: зеркало

source: must request remote info for specific packages
ca: ha de sol·licitar informació remota per paquets específics
de: Remote-Info muss für spezifische Pakete angefordert werden
es: debe solicitar información remota para paquetes específicos
fr: doit demander des informations distantes pour des packages spécifiques
ja: 特定のパッケージではリモートの情報を要求する必要があります
ru: для определенных пакетов необходимо запрашивать сведения удаленно

source: Installed
ca: Instal·lat
de: Installiert
es: Instalado
fr: Installé
ja: インストール済み
ru: Установлено

source: Unsupported
de: Nicht unterstützt
es: No admitido
fr: Non pris(e) en charge
ja: サポートされていない
ru: Не поддерживается

source: Not installed
ca: No instal·lat
de: Nicht installiert
es: No instalado
fr: Non installé
ja: インストール済みでない
ru: Не установлено

source: Obsolete
ca: Obsolet
de: Veraltet
es: Obsoleto
fr: Obsolète
ja: 廃止
ru: Устаревший

source: Renamed
ca: Reanomenat
de: Umbenannt
es: Renombrado
fr: Renommé
ja: 名前変更済み
ru: Переименованный

source: Frozen
de: Eingefroren
es: Congelado
fr: Figé
ja: 凍結済み

source: Name
ca: Nom
es: Nombre
fr: Nom
ja: 名前
ru: Имя

source: Summary
de: Zusammenfassung
es: Resumen
fr: Récapitulatif
ja: サマリー
ru: Сводка

source: Description
ca: Descripció
de: Beschreibung
es: Descripción
ja: 説明

source: Category
de: Kategorie
es: Categoría
fr: Catégorie
ja: カテゴリ

source: State
de: Status
es: Estado
fr: Etat
ja: 状態

source: Renamed to
de: Umbenannt in
es: Renombrado como
fr: Renommé en
ja: 変更後の名前

source: Branch
de: Zweig
es: Sucursal
fr: Branche
ja: 分岐

source: Packaging Date
de: Packaging-Datum
es: Fecha de empaquetado
fr: Date de conditionnement
ja: パッケージ化の日付

source: Last Install Time
de: Zuletzt installiert um
es: Hora de última instalación
fr: Heure de la dernière installation
ja: 最終インストール時間

source: Last Update Time
de: Zuletzt aktualisiert um
es: Hora de última actualización
fr: Heure de la dernière mise à jour
ja: 最終更新時間

source: Size
ca: Mida
de: Größe
es: Tamaño
fr: Taille
ja: サイズ
ru: Размер

source: Additional Keywords
de: Zusätzliche Schlüsselwörter
es: Palabras clave adicionales
fr: Mots clés supplémentaires
ja: 追加のキーワード

source: Project Contact
de: Projektkontaktperson
es: Contacto de proyecto
fr: Interlocuteur du projet
ja: プロジェクト担当者

source: Project Maintainer
de: Projektverwalter
es: Mantenedor de proyecto
fr: Chargé de maintenance du projet
ja: プロジェクト保守担当者

source: Project Maintainer URL
de: Projektverwalter-URL
es: URL de mantenedor de proyecto
fr: URL du chargé de maintenance du projet
ja: プロジェクト保守担当者 URL

source: Project URL
de: Projekt-URL
es: URL de proyecto
fr: URL du projet
ja: プロジェクト URL

source: Repository Changeset
es: Conjunto de cambios de repositorio
fr: Ensemble de modifications du référentiel
ja: リポジトリの変更セット

source: Source URL
de: Quell-URL
es: URL de origen
fr: URL source
ja: ソース URL

source: pkg: info: no packages matching the following patterns you specified are installed on the system. Try querying remotely instead:
de: pkg: info: Keines der Packages, die den folgenden angegebenen Mustern entsprechen, sind auf dem System installiert. Versuchen Sie stattdessen eine Remote-Abfrage:
es: pkg: info: no hay paquetes que coincidan con los siguientes patrones especificados instalados en el sistema. Intente consultar de manera remota:
fr: pkg : infos : aucun package correspondant aux critères spécifiés indiqués ci-dessous n'est installé sur le système. Essayez une interrogation à distance :
ja: pkg: info: 指定された次のパターンに一致するパッケージの中で、 システムにインストール済みのものが存在しません。代わりにリモートでクエリーを実行してください:
