Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: publisher argument must be of the form '<prefix>=<uri> or '<uri>''.
ru: аргумент издателя должен иметь форму '<prefix>=<uri> или '<uri>''.

source: The URI '%(pub_url)s' does not appear to point to a valid pkg repository. Please check the repository's location and the client's network configuration. Additional details: %(error)s
ru: Идентификатор URI '%(pub_url)s' не указывает на допустимое хранилище pkg. Проверьте местоположение хранилища и параметры настройки сети клиента. Дополнительные сведения: %(error)s

source: illegal global option -- %s
ca: opció global il·legal -- %s
ru: недопустимый глобальный параметр -- %s

source: %(opt)s takes argument of form name=value, not %(arg)s
ca: %(opt)s pren arguments de la forma nom=valor, no %(arg)s
ru: %(opt)s принимает аргумент в форме название=значение, а не %(arg)s

source: unknown subcommand '%s'
ca: subcommanda desconeguda '%s'
ru: неизвестная субкоманда '%s'

source: -R not allowed for %s subcommand
ca: -R no permès per la subcomanda %s
ru: -R не разрешен для субкоманды %s

source: illegal option -- %s
ca: opció no permesa -- %s
ru: недопустимый параметр -- %s

source: version: command does not take operands ('%s')
ca: versió: la comanda no pren arguments ('%s')
ru: version: команда не принимает операнды ('%s')

source: Could not find image. Use the -R option or set $PKG_IMAGE to point to an image, or change the working directory to one inside the image.
ca: No es pot trobar l'imatge. Utilitzeu l'opció -R o establiu $PKG_IMAGE per a apuntar a una imatge, o canvieu el directori de treball a un que estigui dins de l'imatge.
ru: Образ не найден. Используйте параметр -R или настройте $PKG_IMAGE для указания образа, или измените рабочий каталог на каталог внутри образа.

source: This is an internal error. Please let the developers know about this problem by filing a bug at http://defect.opensolaris.org and including the above traceback and this message. The version of pkg(7) is '%s'.
ru: Это внутренняя ошибка. Сообщите разработчикам об этой неполадке заполнив отчет по адресу http://defect.opensolaris.org и включив результат отслеживания причины неполадки и данное сообщение. Версия pkg(7): '%s'.

source: Details follow: %s
ca: Prestar atenció als detalls: %s
ru: Подробные сведения приведены ниже: %s

source: An error was encountered while attempting to read image state information to perform the requested operation. Details follow: %s
ru: Возникла ошибка при попытке считывания данных о состоянии образа для выполнения требуемой операции. Подробные сведения: %s

source: Additional details: %s
ca: Detalls addicionals: %s
ru: Дополнительные сведения: %s

source: The pkg command appears out of sync with the libraries provided by pkg:/package/pkg. The client version is %(client)s while the library API version is %(api)s.
ru: Команда pkg не синхронизирована с предоставленными в pkg:/package/pkg библиотеками. Версия клиента – %(client)s, а версия интерфейса API библиотеки – %(api)s.

source: Despite the error while indexing, the update, install, or uninstall has completed successfully.
ru: Несмотря на ошибку во время индексирования, команда update, install или uninstall выполнена успешно.

source: Add More Software
ca: Afegir més programari
ru: Добавить дополнительное программное обеспечение

source: Install, update and remove software packages
ca: Instal·lar, actualitzar i eliminar paquets de programari
ru: Установить, обновить или удалить программные пакеты

source: AMP Stack
ca: Pila AMP
ru: Стек AMP

source: Accessories
ca: Accessoris
ru: Стандартные приложения

source: Administration and Configuration
ca: Administració i configuració
ru: Администрирование и настройка

source: Application and Web Servers
ca: Aplicació i serveis web
ru: Приложение и веб-серверы

source: Builds
ca: Construccions
ru: Компоновки

source: Communications
ca: Comunicacions
ru: Средства связи

source: Configuration and Preferences
ca: Configuració i preferències
ru: Настройка и параметры

source: Core
ca: Nucli
ru: Ядро

source: Databases
ca: Bases de dades
ru: Базы данных

source: Developer Tools
ca: Eines de desenvolupament
ru: Инструменты разработчика

source: Display
ca: Monitor
ru: Дисплей

source: Distribution Tools
ca: Eines de distribució
ru: Средства дистрибутива

source: Documentation
ca: Documentació
ru: Документация

source: Editors
ru: Редакторы

source: Enterprise Management
ca: Gestió d'empreses
ru: Управление предприятием

source: File Managers
ca: Gestors de fitxers
ru: Диспетчеры файлов

source: File System
ca: Sistema de fitxers
ru: Файловая система

source: Fonts
ru: Шрифты

source: GNOME and GTK+
ca: GNOME i GTK+
ru: GNOME и GTK+

source: Games
ca: Jocs
ru: Игры

source: Graphics and Imaging
ca: Gràfics i imatges
ru: Графика и работа с изображениями

source: Hardware
ca: Maquinari
ru: Оборудование

source: High Performance Computing
ca: Computació d'alt rendiment
ru: Высокопроизводительные вычисления

source: Integrated Development Environments
ca: Entorns de desenvolupament integrats
ru: Интегрированные среды разработки

source: Internationalization
ca: Internacionalització
ru: Интернационализация

source: Internet
ru: Интернет

source: Libraries
ca: Biblioteques
ru: Библиотеки

source: Localizations
ca: Localitzacions
ru: Локализация

source: Media
ca: Multimèdia
ru: Мультимедиа

source: Multimedia Libraries
ca: Biblioteques multimèdia
ru: Мультимедийные библиотеки

source: Networking
ca: Xarxa
ru: Подключение к сети

source: Office
ca: Oficina
ru: Офис

source: Office Tools
ca: Eines d'oficina
ru: Офисные инструменты

source: Other Languages
ca: Altres llenguatges
ru: Другие языки

source: Other Peripherals
ca: Altres perifèrics
ru: Другие периферийные устройства

source: Packaging
ca: Empaquetament
ru: Упаковка

source: Panels and Applets
ca: Panells i mini-aplicacions
ru: Панели и апплеты

source: Plug-ins and Run-times
ca: Extensions i Entorns d'execució
ru: Дополнения и время выполнения

source: Ports
ru: Порты

source: Printing
ca: Impressió
ru: Печать

source: Releases
ca: Versions
ru: Выпуски

source: Scripts
ru: Сценарии

source: Security
ca: Seguretat
ru: Безопасность

source: Services
ca: Serveis
ru: Службы

source: Sessions
ru: Сеансы

source: Shells
ca: Consoles
ru: Интерпретаторы команд

source: Software Management
ca: Gestió programari
ru: Управление программным обеспечением

source: Sound and Video
ca: Àudio i vídeo
ru: Звук и видео

source: Source Code Management
ca: Gestió de codi font
ru: Управление исходным кодом

source: System
ca: Sistema
ru: Система

source: System Utilities
ca: Eines de sistema
ru: Системные служебные программы

source: Text Tools
ca: Eines de text
ru: Текстовые средства

source: Theming
ca: Temes
ru: Темы

source: Trusted
ca: De confiança
ru: Надежный

source: Universal Access
ca: Accés universal
ru: Универсальный доступ

source: Virtualization
ca: Virtualització
ru: Виртуализация

source: Window Managers
ca: Gestors de finestres
ru: Диспетчеры окон

source: A boolean which determines if the Details panel in the Install Remove progress dialog is expanded or not.
ru: Булево значение, определяющее, развернута ли панель "Подробные данные" в диалоговом окне хода выполнения установки и удаления.

source: A boolean which determines if the Start Page should be shown on startup or the initial list view.
ca: Un booleà que determina si s'ha de mostrar la pàgina d'inici a l'inici, o bé el llistat inicial.
ru: Логическое значение, определяющее, что выводится при запуске - начальная страница или начальный список.

source: A boolean which determines whether Package Manager should save its state on exit and use it on restart. The state is the selected publisher and the size and position of horizontal and vertical dividers.
ca: Un booleà que determina si el Gestor de Paquets ha de desar el seu estat de sortida i utilitzar-lo quant es reinicii. L'estat és el publicador seleccionat i la mida i posició dels divisors horitzontal i vertical.
ru: Логическое значение, указывающее необходимость сохранения состояния Диспетчера пакетов при выходе и использования его при перезапуске. В данное состояние входит выбранный издатель, размер и позиция горизонтальных и вертикальных разделителей.

source: A boolean which determines whether Package Manager should show confirmation dialog when the updates are found after performing Updates operation (Checks if updates are available) or it should go straight to the update all operation.
ca: Un booleà que determina si el Gestor de paquets ha de mostrar el diàleg de confirmació quant es troben actualitzacions després de realitzar operacions d'actualització (Comprova si hi han actualitzacions disponibles) o si ha de segui l'operació d'actualitzar tot.
ru: Булево значение, определяющее, необходимо ли открывать диалоговое окно подтверждения в диспетчере пакетов при обнаружении обновлений после выполнения операции "Обновления" (проверка наличия обновлений). Альтернативой является выполнение операции обновления всех пакетов без подтверждения.

source: A boolean which determines whether Package Manager should show confirmation dialog when the user selected some packages for installation or update.
ca: Un booleà que determina si el Gestor de paquets ha de mostrar el diàleg de confirmació quant l'usuari ha seleccionat alguns paquets per a instal·lar o actualitzar.
ru: Булево значение, определяющее, необходимо ли открывать диалоговое окно подтверждения в диспетчере пакетов при выборе ряда пакетов для установки или обновления.

source: A boolean which determines whether Package Manager should show confirmation dialog when the user selected some packages for removal.
ca: Un booleà que determina si el Gestor de paquets ha de mostrar el diàleg de confirmació quant l'usuari ha seleccionat alguns paquets per a eliminar.
ru: Булево значение, определяющее, необходимо ли открывать диалоговое окно подтверждения в диспетчере пакетов при выборе ряда пакетов для удаления.

source: A boolean which determines whether Package Manager should start in search mode.
ca: Un booleà que determina si el Gestor de Paquets ha d'iniciar-se amb mode de cerca.
ru: Логическое значение, указывающее необходимость запуска Диспетчера пакетов в режиме поиска.

source: A string which determines if the repository is shown or not in the error dialog.
ca: Una cadena de text que determina si el repositori es mostrat o no en el diàleg d'error.
ru: Строка, указывающая необходимость вывода хранилища в диалоговом окне ошибки.

source: A string which stores the last publisher used by package manager.
ca: Una cadena de text que emmagatzema l'últim publicador utilitzat pel Gestor de Paquets.
ru: Строка, в которой сохраняется последний издатель, используемый в Диспетчере пакетов.

source: An integer which identifies the initial show filter value to be displayed when packagemanager starts. 0 corresponds to All Packages.
ca: Un enter que identifica el valor del filtre inicial per a ser mostrat quan packagemanager s'inicia. 0 correspon a tots els paquets.
ru: Целочисленное значение, определяющее начальное значение фильтра отображения при запуске Диспетчера пакетов. 0 соответствует выводу всех пакетов.

source: An integer which identifies the initial toplevel section to be expanded when packagemanager starts. 0 = "All Categories", 2 = "Applications" (the default)
ca: Un enter que identifica la secció de nivell alt inicial a ser expandida quan el packagemanager s'inicia. 0 = "Totes les categories", 2 = "Aplicacions" (la predeterminada)
ru: Целочисленное значение, определяющее начальный раздел верхнего уровня расширения при запуске Диспетчера пакетов. 0 = "Все категории", 2 = "Приложения" (по умолчанию)

source: An integer which specifies the initial height of the application main window, overridden if there is not enough screen available.
ca: Un enter que especifica l'altura inicial per a la finestra de l'aplicació principal, sobreescriure si no es disposa de prouta pantalla.
ru: Целочисленное значение, указывающее начальную высоту главного окна приложения; не используется при недостатке экранного пространства.

source: An integer which specifies the initial horizonatal divider position of the application, which separates the category panel from the list panel.
ca: Un enter que especifica la posició inicial del divisor horitzontal de l'aplicació, amb la que es separa el panell de categories del panell amb el llistat.
ru: Целочисленное значение, указывающее начальное положение горизонтального разделителя приложения, отделяющего панель категорий от панели списка.

source: An integer which specifies the initial vertical divider position of the application, which separates the details panel from the list panel.
ca: Un enter que especifica la posició inicial del divisor vertical de l'aplicació, amb la que es separa el panell amb els detalls del panell amb el llistat.
ru: Целочисленное значение, указывающее начальное положение вертикального разделителя приложения, отделяющего панель подробных данных от панели списка.

source: An integer which specifies the initial width of the application main window, overridden if there is not enough screen available.
ca: Un enter que especifica l'amplada inicial per a la finestra de l'aplicació principal, sobreescriure si no es disposa de prou pantalla.
ru: Целочисленное значение, указывающее начальную ширину главного окна приложения; не используется при недостатке экранного пространства.

source: An integer which specifies the maximum number of entries to store for search completion.
ca: Un enter que especifica el nombre màxim d'entrades a emmagatzemar per la cerca completa
ru: Целочисленное значение, указывающее максимальное число сохраняемых записей для выполнения поиска.

source: Comma separated list of repositories which we show if there are API errors when searching them
ca: Llistat de repositoris separats amb comes que mostrem si hi han errors d'API quant se'ls cerca
ru: Список хранилища с запятой в качестве разделителя, который выводится при наличии ошибок API во время их поиска

source: Display confirmation dialog after Check for updates
ca: Mostrar el diàleg de confirmació després de comprovar actualitzacions
ru: Открывать диалоговое окно подтверждения после выполнения операции проверки наличия обновлений

source: Display install/update packages confirmation dialog
ca: Mostrar el diàleg de confirmació d'instal·lació/actualització de paquets
ru: Открывать диалоговое окно подтверждения при установке/обновлении пакетов

source: Display remove packages confirmation dialog
ca: Mostrar el diàleg de confirmació d'eliminació de paquets
ru: Открывать диалоговое окно подтверждения при удалении пакетов

source: Display selected publisher at startup
ca: Mostrar el publicador seleccionat al començament
ru: Просмотр выбранного издателя при запуске

source: Expand Details in Install Remove
ru: Развернуть панель "Подробные данные" в диалоговом окне установки и удаления

source: Initial application height
ca: Altura inicial de l'aplicació
ru: Начальная высота приложения

source: Initial application horizonatal divider position
ca: Posició del separador horitzontal inicial de l'aplicació
ru: Начальное положение горизонтального разделителя

source: Initial application vertical divider position
ca: Posició del separador vertical inicial de l'aplicació
ru: Начальное положение вертикального разделителя

source: Initial application width
ca: Amplada inicial de l'aplicació
ru: Начальная ширина приложения

source: Initial section value
ca: Valor de secció inicial
ru: Начальное значение раздела

source: Initial show filter value
ca: Mostrar valor de filtratge inicial
ru: Начальное значение фильтра отображения

source: Last Export Selections Path
ca: Última ruta de selecció d'exportacions
ru: Путь к последим выбранным параметрам экспорта

source: Last publisher used by package manager
ca: Últim publicador utilitzat pel Gestor de Paquets
ru: Последний издатель, используемый в Диспетчере пакетов

source: Maximum entries for Search Completion
ca: Entrades màximes per la cerca completa
ru: Максимальное число записей для выполнения поиска

source: Show Start Page on startup
ca: Mostrar la pàgina d'inici a l'inici
ru: Вывод начальной страницы при запуске

source: Start Page Update URL
ca: URL de la pàgina d'inici d'actualització
ru: Адрес URL обновления начальной страницы

source: Start in search mode
ru: Запуск в режиме поиска

source: The location from which to fetch updates to the Package Manager Start Page.
ca: La localització des de la qual obtenir les actualitzacions de la pàgina d'inici del Gestor de Paquets.
ru: Местоположение, из которого извлекаются обновления начальной страницы Диспетчера пакетов.

source: The path for the last set of selections exported from packagemanager.
ca: La ruta per l'ultim conjunt de seleccions exportat a packagemanager.
ru: Путь к последнему набору выбранных параметров, экспортируемых из Диспетчера пакетов.

source: Package Manager
ca: Gestor de Paquets
ru: Диспетчер пакетов

source: The <b>libbe</b> library was not found on your system. All functions for managing Boot Environments are disabled
ca: La llibreria <b>libbe</b> no ha estat trobada al vostre sistema. Totes les funcions per a gestionar els entorns d'arranc han estat deshabilitades
ru: Библиотека <b>libbe</b> в системе не найдена. Все функции управления загрузочными средами отключены

source: BE management
ca: Gestió Entorns d'arranc
ru: Управление загрузочной средой

source: Boot Environment Confirmation
ca: Confirmació de l'entorn d'arranc
ru: Подтверждение среды загрузки

source: Loading Boot Environment Information
ca: Carregant informació de l'entorn d'arranc
ru: Загрузка информации о загрузочной среде

source: Fetching BE entries...
ca: Obtenint entrades BE...
ru: Получение записей загрузочной среды...

source: Boot Environment
ca: Entorn d'arranc
ru: Загрузочная среда

source: Created
ca: Creat
ru: Создано

source: Active on Reboot
ca: Activar i reiniciar
ru: Активен после перезагрузки

source: Delete
ca: Eliminar
ru: Удалить

source: Applying changes
ca: Aplicant canvis
ru: Применение изменений

source: Applying changes, please wait ...
ca: Aplicant canvis, si us plau espereu ...
ru: Применение изменений, подождите...

source: Active on reboot
ca: Actiu al reiniciar
ru: Активен после перезагрузки

source: Delete
ca: Eliminar
ru: Удалить

source: Rename
ca: Reanomenar
ru: Переименовать

source: to
ca: a
ru: в

source: <b>Couldn't change Active Boot Environment to:</b>
ca: <b>No es pot canviar l'entorn d'arranc actual a:</b>
ru: <b>Не удалось изменить активную загрузочную среду на:</b>

source: <b>Couldn't delete Boot Environments:</b>
ca: <b>No es poden eliminar els entorns d'arranc:</b>
ru: <b>Не удалось удалить загрузочные среды:</b>

source: <b>Couldn't rename Boot Environments:</b>
ca: <b>No es poden reanomenar els entorns d'arranc:</b>
ru: <b>Не удалось переименовать среды загрузки:</b>

source: %s <b>to</b> %s
ca: %s <b>a</b> %s
ru: %s <b>в</b> %s

source: BE error
ca: Error entorn d'arranc
ru: Ошибка среды загрузки

source: The <b>libbe</b> library couldn't prepare list of Boot Environments. All functions for managing Boot Environments are disabled
ca: La llibreria <b>libbe</b> no ha pogut preparar el llistat amb els entorns d'arranc. Totes les funcions per a gestionar els entorns d'arranc han estat deshabilitades
ru: Библиотека <b>libbe</b> не может подготовить список загрузочных сред. Все функции управления загрузочными средами отключены

source: Fetching information...
ca: Obtenint informació...
ru: Получение информации...

source: Installable versions...
ru: Устанавливаемые версии...

source: Fetching dependencies information...
ru: Получение данных о зависимостях...

source: Fetching legal information...
ca: Obtenint informació legal...
ru: Получение правовой информации...

source: This might be caused by network problem while accessing the repository.
ca: Aquest pot ser causat per un problema de xarxa mentre s'estava accedint al repositori.
ru: Это может быть связано с проблемами сетевых соединений при доступе к хранилищу.

source: Dependencies info not available for this package...
ca: Informació de dependències no disponible per a aquest paquet...
ru: Нет информации о зависимостях для данного пакета...

source: Files Details not available for this package...
ca: Detalls dels fitxers no disponibles per a aquest paquet...
ru: Нет подробных сведений о файлах для данного пакета...

source: Information not available for this package...
ca: Informació no disponible per a aquest paquet...
ru: Нет информации для данного пакета...

source: Not Installed
ca: No instal·lat
ru: Не установлено

source: No versions available
ru: Отсутствуют доступные версии

source: Search (Ctrl-F)
ca: Cercar (Ctrl-F)
ru: Поиск (Ctrl-F)

source: Export Selections Confirmation
ca: Confirmació exportar seleccions
ru: Подтверждение экспорта выбранных параметров

source: <b>Export the following to a Web Install .p5i file:</b>
ca: <b>Exportar el següent a un fitxer d'instal·lació web .p5i file:</b>
ru: <b>Экспортировать в файл программы веб-установки .p5i следующие элементы:</b>

source: Export Selections Error
ca: Error exportació seleccions
ru: Ошибка экспорта выбранных параметров

source: Export Selections
ca: Exportar seleccions
ru: Экспорт выбранных параметров

source: p5i Files
ca: Fitxers p5i
ru: Файлы p5i

source: All Files
ca: Tots els fitxers
ru: Все файлы

source: An unknown error occurred
ca: S'ha produït un error desconegut
ru: Произошла неизвестная ошибка

source: Please let the developers know about this problem by filing a bug together with the error details listed below at:
ru: Сообщите разработчикам об этой проблеме.Для этого требуется отправить отчет об ошибке вместе с подробными данными об ошибке по следующему адресу:

source: Unexpected Error
ca: Error inesperat
ru: Непредвиденная ошибка

source: Error details:
ca: Detalls de l'error:
ru: Подробные данные об ошибке :

source: List of configured publishers:
ca: Llistat dels publicadors configurats:
ru: Список настроенных издателей:

source: Please include output from:
ca: Incloeu la sortida des de:
ru: Включите в сообщение результат выполнения команды:

source: Update Manager
ca: Gestió d'actualitzacions
ru: Диспетчер обновлений

source: Preparing...
ca: Preparant...
ru: Подготовка...

source: Preparation
ca: Preparació
ru: Подготовка

source: Downloading...
ca: Descarregant...
ru: Загрузка...

source: Installing...
ca: Instal·lant...
ru: Установка...

source: Install
ca: Instal·lar
ru: Установить

source: _Proceed
ca: _Procedir
ru: _Продолжить

source: _Reject
ca: _Rebutjar
ru: О_тклонить

source: Removing...
ca: Eliminant...
ru: Удаление...

source: Remove
ca: Eliminar
ru: Удалить

source: Remove Confirmation
ca: Eliminar confirmació
ru: Удалить подтверждение

source: Review the package to be removed
ca: Revisar el paquet a ser eliminat
ru: Просмотр удаляемого пакета

source: Updates
ca: Actualitzacions
ru: Обновления

source: Install/Update
ca: Instal·lar/Actualitzar
ru: Установка/обновление

source: Install/Update Confirmation
ca: Confirmació instal·lació/actualització
ru: Подтверждение установки/обновления

source: Review the package to be Installed/Updated
ca: Revisar el paquet a ser instal·lat/actualitzat
ru: Просмотр пакета для установки/удаления

source: Updates Confirmation
ru: Подтверждение обновлений

source: Review the package to be Updated
ca: Revisar el paquet a ser actualitzat
ru: Просмотр пакета для обновления

source: Install Confirmation
ca: Confirmació instal·lació
ru: Подтверждение установки

source: Review the package to be Installed
ca: Revisar el paquet a ser instal·lat
ru: Просмотр пакета для установки

source: Canceling...
ca: Cancel·lant...
ru: Отмена...

source: Ensuring %s is up to date...
ca: Garantint que %s estigui al dia...
ru: Проверка актуальности %s...
