Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: '{value}' is less than the minimum of '{minimum}' permitted for property '{prop}' in section '{section}'.
de: '{value}' ist kleiner als der zulässige Mindestwert '{minimum}' für Eigenschaft '{prop}' in Abschnitt '{section}'.
es: '{value}' es menor que el mínimo de '{minimum}' permitido para la propiedad '{prop}' en la sección '{section}'.
fr: '{value}' est inférieur à la valeur minimale '{minimum}' autorisée pour la propriété '{prop}' dans la section '{section}'.
ja: '{value}' はセクション '{section}' のプロパティー '{prop}' に対する許容最小値 '{minimum}' より小さい値です。

source: '{value}' is greater than the maximum of '{maximum}' permitted for property '{prop}' in section '{section}'.
de: '{value}' ist größer als der zulässige Höchstwert '{maximum}' für Eigenschaft '{prop}' in Abschnitt '{section}'.
es: '{value}' es mayor que el máximo de '{maximum}' permitido para la propiedad '{prop}' en la sección '{section}'.
fr: '{value}' est supérieur à la valeur maximale de '{maximum}' autorisée pour la propriété '{prop}' dans la section '{section}'.
ja: '{value}' はセクション '{section}' のプロパティー '{prop}' に対する許容最大値 '{maximum}' より大きい値です。

source: Invalid value '{value}' for property '{prop}' in section '{section}'.
de: Ungültiger Wert '{value}' für Eigenschaft '{prop}' in Abschnitt '{section}'.
es: Valor no válido '{value}' para la propiedad '{prop}' en la sección '{section}'.
fr: Valeur incorrecte '{value}' pour la propriété '{prop}' dans la section '{section}'.
ja: セクション '{section}' のプロパティー '{prop}' の無効な値 '{value}'。

source: Invalid value '{value}' for {prop}.
de: Ungültiger Wert {value} für {prop}.
es: Valor '{value}' no válido para {prop}.
fr: Valeur non valide '{value}' pour {prop}.
ja: {prop} の無効な値 '{value}'。

source: Property '{prop}' in section '{section}' doesn't allow multiple values.
de: Eigenschaft '{prop}' in Abschnitt '{section}' lässt mehrere Werte nicht zu.
es: La propiedad '{prop}' en la sección '{section}' no permite varios valores.
fr: La propriété '{prop}' de la section '{section}' n'autorise pas plusieurs valeurs.
ja: セクション '{section}' のプロパティー '{prop}' には複数の値は許可されません。

source: Property {0} doesn't allow multiple values.
de: Eigenschaft {0} lässt mehrere Werte nicht zu.
es: La propiedad {0} no permite varios valores.
fr: La propriété {0} n'autorise pas plusieurs valeurs.
ja: プロパティー {0} には複数の値は許可されません。

source: Value '{value}' not found in the list of values for property '{prop}' in section '{section}'.
de: Wert '{value}' in der Werteliste für Eigenschaft '{prop}' in Abschnitt '{section}' nicht gefunden.
es: No se encontró el valor '{value}' en la lista de valores para la propiedad '{prop}' en la sección '{section}'.
fr: La valeur '{value}' est introuvable dans la liste des valeurs pour la propriété '{prop}' dans la section '{section}'.
ja: セクション '{section}' のプロパティー '{prop}' の値のリストに値 '{value}' がありません。

source: Value '{value}' not found in the list of values for {prop} .
de: Wert '{value}' in der Werteliste für {prop} nicht gefunden.
es: No se encontró el valor '{value}' en la lista de valores para {prop}.
fr: La valeur '{value}' est introuvable dans la liste des valeurs pour la propriété '{prop}'.
ja: '{prop}' の値のリストに値 '{value}' がありません。

source: Section name '{0}' is not valid. Section names may not contain: tabs, newlines, carriage returns, form feeds, vertical tabs, slashes, backslashes, or non-ASCII characters.
de: Abschnittname '{0}' ist ungültig. Folgende Zeichen dürfen in Abschnittnamen nicht enthalten sein: Tabulatoren,Zeilenumbrüche, Wagenrückläufe, Seitenvorschübe, vertikale Tabulatoren, Schrägstriche, umgekehrte Schrägstriche oder Nicht-ASCII-Zeichen.
es: El nombre de sección '{0}' no es válido. Los nombres de sección no pueden contener tabulaciones, líneas nuevas, retornos de carro, avances de página, tabulaciones verticales, barras diagonales, barras diagonales inversas ni caracteres que no sean ASCII.
fr: Le nom de section '{0}' n'est pas valide. Les noms de section ne peuvent pas contenir les caractères suivants : tabulations, nouvelles lignes, retours chariot, sauts de page, tabulations verticales, barres obliques, barres obliques inverses ni des caractères qui ne sont pas des caractères ASCII.
ja: セクション名 '{0}' は有効ではありません。セクション名に次の文字を含めることはできません: タブ、改行、キャリッジリターン、用紙送り、垂直タブ、スラッシュ、バックスラッシュ、ASCII 以外の文字。

source: Section template name '{0}' is not valid.
de: Abschnittsvorlagenname '{0}' ist ungültig.
es: El nombre de la plantilla de secciones '{0}' no es válido.
fr: Le nom du modèle de la section '{0}' n'est pas valide.
ja: セクションテンプレート名 '{0}' は無効です。

source: Unknown property '{prop}' in section '{section}'.
de: Unbekannte Eigenschaft '{prop}' in Abschnitt '{section}'.
es: Propiedad desconocida '{prop}' en la sección '{section}'.
fr: Propriété '{prop}' dans la section '{section}' inconnue.
ja: セクション '{section}' の不明なプロパティー '{prop}'。

source: Unknown property {0}
de: Unbekannte Eigenschaft {0}
es: Propiedad desconocida {0}
fr: Propriété inconnue {0}
ja: 不明なプロパティー {0}

source: Unknown property section: {0}.
de: Unbekannter Eigenschaftsabschnitt: {0}.
es: Sección de propiedad desconocida: {0}.
fr: Section de propriété inconnue : {0}.
ja: 不明なプロパティーセクション: {0}。

source: Property name '{name}' is not valid. Property names may not contain: tabs, newlines, carriage returns, form feeds, vertical tabs, slashes, or backslashes and must also match the regular expression: {exp}
de: Eigenschaftsname '{name}' ist ungültig. Folgende Zeichen dürfen in Eigenschaftsnamen nicht enthalten sein: Tabulatoren, Zeilenumbrüche, Wagenrückläufe, Seitenvorschübe, vertikale Tabulatoren, Schrägstriche oder umgekehrte Schrägstriche. Außerdem muss der Name dem regulären Ausdruck {exp} entsprechen.
es: El nombre de propiedad '{name}' no es válido. Los nombres de propiedades no pueden contener tabulaciones, líneas nuevas, retornos de carro, avances de página, tabulaciones verticales, barras diagonales ni barras diagonales inversas, y deben coincidir con la expresión regular: {exp}
fr: Le nom de propriété '{name}' n'est pas valide. Les noms de propriété ne peuvent pas contenir les caractères suivants : tabulations, nouvelles lignes, retours chariot, sauts de page, tabulations verticales, barres obliques, barres obliques inverses, et doivent par ailleurs correspondre à l'expression régulière suivante : {exp}
ja: プロパティー名 '{name}' は有効ではありません。プロパティー名に次の文字を含めることはできません: タブ、改行、キャリッジリターン、用紙送り、垂直タブ、スラッシュ、バックスラッシュ。また、次の正規表現と一致する必要があります: {exp}

source: Section name '{name}' is not valid. Section names may not contain: tabs, newlines, carriage returns, form feeds, vertical tabs, slashes, or backslashes and must also match the regular expression: {exp}
de: Abschnittsname '{name}' ist ungültig. Folgende Zeichen dürfen in Abschnittsnamen nicht enthalten sein: Tabulatoren, Zeilenumbrüche, Wagenrückläufe, Seitenvorschübe, vertikale Tabulatoren, Schrägstriche oder umgekehrte Schrägstriche. Außerdem muss der Name dem regulären Ausdruck {exp} entsprechen.
es: El nombre de sección '{name}' no es válido. Los nombres de secciones no pueden contener tabulaciones, líneas nuevas, retornos de carro, avances de página, tabulaciones verticales, barras diagonales ni barras diagonales inversas, y deben coincidir con la expresión regular: {exp}
fr: Le nom de section '{name}' n'est pas valide. Les noms de section ne peuvent pas contenir les caractères suivants : tabulations, nouvelles lignes, retours chariot, sauts de page, tabulations verticales, barres obliques, barres obliques inverses, et doivent par ailleurs correspondre à l'expression régulière suivante : {exp}
ja: セクション名 '{name}' は有効ではありません。セクション名に次の文字を含めることはできません: タブ、改行、キャリッジリターン、用紙送り、垂直タブ、スラッシュ、バックスラッシュ。また、次の正規表現と一致する必要があります: {exp}

source: Unable to read configuration data for SMF FMRI '{fmri}': {errmsg}
de: Konfigurationsdaten für SMF FMRI '{fmri}' können nicht gelesen werden: {errmsg}
es: No se pueden leer los datos de configuración para el FMRI de SMF '{fmri}': {errmsg}
fr: Impossible de lire les données de configuration du FMRI de SMF '{fmri}' : {errmsg}
ja: SMF FMRI '{fmri}' の構成データを読み取れません: {errmsg}

source: Unable to write configuration data for SMF FMRI '{fmri}': {errmsg}
de: Konfigurationsdaten für SMF FMRI '{fmri}' können nicht geschrieben werden: {errmsg}
es: No se pueden escribir los datos de configuración para el FMRI de SMF '{fmri}': {errmsg}
fr: Impossible d'écrire les données de configuration du FMRI de SMF '{fmri}' : {errmsg}
ja: SMF FMRI '{fmri}' の構成データを書き込めません: {errmsg}

source: Writing configuration data to SMF is not supported at this time.
de: Das Schreiben von Konfigurationsdaten in SMF wird gegenwärtig nicht unterstützt.
es: La escritura de datos de configuración en SMF no está admitida actualmente.
fr: L'écriture des données de configuration dans SMF n'est à l'heure actuelle pas prise en charge.
ja: SMF への構成データの書き込みは、この時点ではサポートされていません。
ru: Запись данных настройки в SMF в данный момент не поддерживается.

source: The FileManager cannot {cre} {ent} because it is configured read-only.
de: {cre} {ent} kann von FileManager nicht ausgeführt werden, weil schreibgeschützt konfiguriert.
es: El gestor de archivos no puede {cre} {ent} porque está configurado como de solo lectura.
fr: Le Gestionnaire de fichiers ne peut pas créer {cre} {ent} car il est configuré en lecture seule.
ja: 読み取り専用に構成されているため、FileManager は {ent} を {cre} できません。

source: {src} was removed while FileManager was attempting to insert it into the cache as {dest}.
de: {src} wurde entfernt, während FileManager versucht hat, es als {dest} im Cache zu speichern.
es: Se eliminó {src} mientras el gestor de archivos intentaba insertarlo en la caché como {dest}.
fr: {src} a été supprimé alors que le Gestionnaire de fichiers tentait de l'insérer dans le cache en tant que {dest}.
ja: {src} は、FileManager が {dest} としてキャッシュに挿入しようとしたときに削除されました。

source: FileManager was unable to create {0} or the directories containing it.
de: FileManager konnte {0} oder die Verzeichnisse, in denen es enthalten ist, nicht erstellen.
es: El Gestor de archivos no pudo crear {0} ni los directorios que lo contienen.
fr: Le Gestionnaire de fichiers n'a pas pu créer {0} ou les répertoires le contenant.
ja: FileManager は、{0} またはそれを含むディレクトリを作成できませんでした。

source: The following paths were found but cannot be accounted for by any of the known layouts: {0}
de: Dir folgenden Pfade wurden gefunden, können jedoch von keinem der bekannten Layouts berücksichtigt werden: {0}
es: Se encontraron las siguientes rutas pero no se pueden tener en cuenta en ninguno de los diseños conocidos: {0}
fr: Les chemins suivants ont été trouvés mais ne peuvent pas être pris en charge par l'une des configurations connues : {0}
ja: 次のパスが見つかりましたが、どの既知のレイアウトによっても説明できません: {0}

source: Couldn't find '{0}'
de: '{0}' konnte nicht gefunden werden
es: No se encontró '{0}'
fr: Impossible de trouver '{0}'
ja: '{0}' が見つかりませんでした

source: Couldn't find '{hash}' needed for '{path}' in any of the specified search directories: {dirs}
de: Erforderlicher '{hash}' für '{path}' konnte in keinem der angegebenen Suchverzeichnisse gefunden werden: {dirs}
es: No se encontró el hash '{hash}' necesario para '{path}' en ninguno de los directorios de búsqueda especificados: {dirs}
fr: Impossible de trouver l'élément '{hash}' requis pour '{path}' dans les répertoires de recherche spécifiés : {dirs}
ja: '{path}' に必要な '{hash}' は指定されたどの検索ディレクトリにも見つかりませんでした: {dirs}

source: Couldn't find '{path}' in any of the specified search directories: {dirs}
de: '{path}' konnte in keinem der angegebenen Suchverzeichnisse gefunden werden: {dirs}
es: No se encontró '{path}' en ninguno de los directorios de búsqueda especificados: {dirs}
fr: Impossible de trouver '{path}' dans les répertoires de recherche spécifiés : {dirs}
ja: '{path}' は指定されたどの検索ディレクトリにも見つかりませんでした: {dirs}

source: More than one $PKGDEPEND_RUNPATH token was set on the same action in this manifest.
de: In diesem Manifest waren mehrere $PKGDEPEND_RUNPATH-Token für die gleiche Aktion festgelegt.
es: Se estableció más de un token $PKGDEPEND_RUNPATH en la misma acción en este manifiesto.
fr: Plusieurs jetons $PKGDEPEND_RUNPATH ont été définis pour la même action dans ce manifeste.
ja: 複数の $PKGDEPEND_RUNPATH トークンが、このマニフェストの同じアクションに設定されました。

source: Invalid pkg.depend.bypass-generate value {val}: {err}
de: Ungültiger Wert für pkg.depend.bypass-generate {val}: {err}
es: Valor pkg.depend.bypass-generate no válido {val}: {err}
fr: Valeur pkg.depend.bypass-generate non valide {val} : {err}
ja: 無効な pkg.depend.bypass-generate 値 {val}: {err}

source: Invalid publishing dependency: {0}
de: Ungültige Veröffentlichungsabhängigkeit: {0}
es: Dependencia de edición no válida: {0}
fr: Dépendance d'édition non valide : {0}
ja: 無効な発行の依存関係: {0}

source: Subclasses of Dependency must implement dep_key. Current class is {0}
de: Subklassen der Dependency-Klasse müssen dep_key implementieren. Die aktuelle Klasse ist {0}
es: Las subclases de dependencia deben implementar dep_key. La clase actual es {0}
fr: Les sous-classes de dépendance doivent mettre en oeuvre dep_key. La classe actuelle est {0}
ja: 依存関係のサブクラスには、dep_key を実装する必要があります。現在のクラスは {0}

source: {file} had this elf error:{err}
de: {file} wies den folgenden elf-Fehler auf:{err}
es: {file} contenía este error elf:{err}
fr: {file} présentait cette erreur elf :{err}
ja: {file} には次の elf エラーがあります:{err}

source: {pp} (which will be installed at {ip}) had this token, {tok}, in its run path: {rp}. It is not currently possible to automatically expand this token. Please specify its value on the command line.
de: {pp} wird unter {ip} installiert und hat das Token {tok} im Ausführungspfad {rp}. Es ist derzeit nicht möglich, dieses Token automatisch zu erweitern. Geben Sie dessen Wert in der Befehlszeile an.
es: {pp} (que se instalará en {ip}) tenía este token, {tok}, en su ruta de ejecución: {rp}. Actualmente no es posible expandir el token de manera automática. Especifique su valor en la línea de comandos.
fr: Le chemin d'exécution de {pp} (qui sera installé au chemin {ip}) possède le jeton {tok} : {rp}. Il est actuellement impossible d'étendre ce jeton automatiquement. Spécifiez sa valeur dans la ligne de commande.
ja: {pp} ({ip} にインストールされる) は、実行パス: {rp} にトークン {tok} があります。現時点でこのトークンを自動的に拡張できません。コマンド行で値を指定してください。

source: Could not find the file for {name} imported in {localpath}
de: Die Datei für {name}, die in {localpath} importiert wurde, konnte nicht gefunden werden
es: No se pudo encontrar el archivo para {name} importado en {localpath}
fr: Impossible de trouver le nom de fichier de {name} importé dans {localpath}
ja: {localpath} にインポートされた {name} のファイルが見つかりませんでした

source: The file to be installed at {ip} declares a python version of {decl_v}. However, the path suggests that the version should be {inst_v}. The text of the file can be found at {lp}
de: In der unter {ip} zu installierenden Datei ist Python-Version {decl_v} deklariert. Der Pfad deutet jedoch darauf hin, dass die Version {inst_v} sein muss. Der Text der Datei befindet sich unter {lp}
es: El archivo que se debe instalar en {ip} declara una versión de python de {decl_v}. No obstante, la ruta sugiere que la versión debería ser {inst_v}. El texto del archivo se puede encontrar en {lp}
fr: Le fichier à installer sur {ip} déclare une version Python de {decl_v}. Toutefois, le chemin suggère qu'il devrait s'agir d'une version {inst_v}. Le texte du fichier figure sur {lp}
ja: {ip} にインストールするファイルでは、Python のバージョン {decl_v} が宣言されています。ただし、パスによれば、バージョンは {inst_v} であるべきです。ファイルのテキストは {lp} にあります

source: The file to be installed at {ip} appears to be a python file but contains a syntax error that prevents it from being analyzed. The text of the file can be foundat {lp}. The error happened on line {line} at offset {col}. The problem was: {txt}
de: Die unter {ip} zu installierende Datei scheint eine Python-Datei zu sein, die einen Syntaxfehler enthält und daher nicht analysiert werden kann. Der Dateitext befindet sich unter {lp}. Der Fehler tritt in Zeile {line} bei Offset {col} auf. Das Problem war: {txt}
ja: {ip} にインストールするファイルは Python ファイルのようですが、構文エラーがあるため解析できません。ファイルのテキストは {lp} にあります。エラーは行 {line} のオフセット {col} で発生しました。問題は次のとおりです: {txt}

source: The command {cmd} exited with return code {rc} and this message: {err}
de: Der Befehl {cmd} wurde mit Rückgabecode {rc} und folgender Meldung beendet: {err}
es: El comando {cmd} finalizó con el código de retorno {rc} y este mensaje: {err}
fr: La commande {cmd} s'est interrompue et a renvoyé le code {rc}, ainsi que le message suivant : {err}
ja: コマンド {cmd} は、 リターンコード {rc} と次のメッセージで終了しました: {err}

source: The command {cmd} produced the following lines which cannot be understood: {lines}
de: Der Befehl {cmd} hat die folgenden unverständlichen Zeilen erzeugt: {lines}
es: El comando {cmd} generó las líneas siguientes que no se entienden: {lines}
fr: La commande {cmd} a renvoyé les lignes suivantes qui sont incompréhensibles : {lines}
ja: コマンド {cmd} で、次に示す理解不能な行が生成されました: {lines}

source: The file to be installed in {ip} does not specify a specific version of python either in its installed path nor in its text. Such a file cannot be analyzed for dependencies since the version of python it will be used with is unknown. The text of the file is here: {lp}.
de: In der unter {ip} zu installierenden Datei wird keine bestimmte Phyton-Version angegeben, weder im Installationspfad noch im Text. Diese Datei kann nicht auf Abhängigkeiten untersucht werden, da die zu verwendende Phyton-Version unbekannt ist. Der Text der Datei befindet sich hier: {lp}.
es: El archivo que se debe instalar en {ip} no especifica una versión concreta de python ni en la ruta instalada ni en el texto. Un archivo de este tipo no se puede analizar en busca de dependencias puesto que se desconoce la versión de python con la que se utilizará. El texto del archivo está aquí: {lp}.
fr: Le fichier à installer dans {ip} ne spécifie pas de version spécifique de Python, que ce soit sur son chemin d'installation ou dans son texte. Un tel fichier ne peut pas être analysé vis à vis de ses dépendances car la version de Python qu'il doit utiliser est inconnue. Le texte du fichier figure ici : {lp}.
ja: {ip} にインストールするファイルでは、そのインストールパスにもテキストにも、Python の特定のバージョンが指定されていません。そのようなファイルは、どのバージョンの Python で使用されるかが不明なため、依存関係を解析できません。ファイルのテキストは次の場所にあります: {lp}。

source: {lp} says it should be run with '{bin}' which is a relative path.
de: {lp} gibt an, dass die Ausführung mit '{bin}' erfolgen muss, der ein relativer Pfad ist.
es: Según {lp}, se debe ejecutar con '{bin}', que es una ruta relativa.
fr: {lp} indique qu'il doit être exécuté avec '{bin}' qui est un chemin relatif.
ja: {lp} によれば、相対パス '{bin}' を使用して実行されるべきです。

source: FMRI does not appear to be valid
de: FMRI scheint nicht gültig zu sein
es: El FMRI no parece que sea válido.
fr: Le FMRI semble être incorrect
ja: FMRI が有効ではないようです
ru: FMRI оказался недействительным

source: more than one set of dependencies found: {0}
de: Mehrere Abhängigkeitensätze wurden gefunden: {0}
es: se ha encontrado más de un conjunto de dependencias: {0}
fr: plusieurs jeux de dépendances trouvés : {0}
ja: 依存性のセットが複数見つかりました: {0}

source: cannot resolve FMRI to a delivered file
de: FMRI kann nicht zu einer bereitgestellten Datei aufgelöst werden
es: no se puede resolver el FMRI en un archivo entregado
fr: impossible d'interpréter le FMRI pour un fichier distribué
ja: もたらされたファイルに FMRI を解決できません
ru: не удалось определить поставляемый файл по идентификатору FMRI

source: {0} actions cannot deliver SMF manifests
de: {0} Aktionen können SMF-Manifeste nicht bereitstellen
es: Las acciones {0} no pueden entregar manifiestos SMF
fr: {0} actions ne peuvent pas distribuer des manifestes SMF
ja: {0} アクションでは SMF マニフェストはもたらされません

source: Unable to parse SMF manifest {0}
de: Parsen von SMF-Manifest {0} nicht möglich.
es: No se puede analizar el manifiesto SMF {0}
fr: Impossible d'analyser le manifeste SMF {0}
ja: SMF マニフェスト {0} を解析できません

source: Problem resolving {fmri}: {err}
de: Problem beim Auflösen von {fmri}: {err}
es: Se produjo un problema al resolver {fmri}: {err}
fr: Une erreur s'est produite lors de l'interprétation de {fmri} : {err}
ja: {fmri} の解決中に問題が発生しました: {err}

source: Problem determining dependencies for {fmri}:{err}
de: Problem beim Ermitteln der Abhängigkeiten für {fmri}:{err}
es: Se produjo un problema al determinar las dependencias para {fmri}:{err}
fr: Une erreur s'est produite pour déterminer les dépendances de {fmri} :{err}
ja: {fmri} の依存関係の判定中に問題が発生しました: {err}

source: Unable to generate SMF dependency on {dep_fmri} declared in {proto_file} by {fmri}: {err}
de: SMF-Abhängigkeit von {dep_fmri}, die in {proto_file} von {fmri} deklariert wird, kann nicht generiert werden: {err}
es: No se puede generar la dependencia SMF en el {dep_fmri} declarado en {proto_file} por {fmri}: {err}
fr: Impossible de générer la dépendance SMF sur {dep_fmri} déclarée dans {proto_file} par {fmri} : {err}
ja: {fmri} によって {proto_file} で宣言されている {dep_fmri} の SMF 依存関係を生成できません: {err}

source: Unable to generate SMF dependency on the service FMRI {dep_fmri} declared in {proto_file} by {fmri}. SMF dependencies should always resolve to SMF instances rather than SMF services and multiple files deliver instances of this service: {manifests}
de: Es kann keine SMF-Abhängigkeit von FMRI {dep_fmri} mit Deklaration in {proto_file} durch {fmri} generiert werden. SMF-Abhängigkeiten müssen immer in SMF-Instanzen anstelle von SMF-Services aufgelöst werden, und mehrere Dateien liefern Instanzen dieses Service: {manifests}
es: No se puede generar la dependencia SMF en el {dep_fmri} del FMRI de servicio declarado en {proto_file} por {fmri}: Las dependencias de SMF siempre se deben resolver en instancias SMF en lugar de servicios SMF, y varios archivos proporcionan instancias de este servicio: {manifests}
fr: Impossible de générer la dépendance SMF sur le service FMRI {dep_fmri} déclaré dans {proto_file} par {fmri}. Les dépendances SMF doivent toujours renvoyer à des instances SMF plutôt qu'à des services SMF et plusieurs fichiers fournissent des instance de ce service : {manifests}
ja: {fmri} によって {proto_file} で宣言されているサービス FMRI {dep_fmri} の SMF 依存関係を生成できません。SMF 依存関係は SMF サービスではなく常に SMF インスタンスに解決されるべきであり、複数のファイルからこのサービスのインスタンスが生成されます: {manifests}

source: FMRI '{0}' is missing version information.
de: FMRI '{0}' weist fehlende Versionsinformationen auf.
es: Falta información de la versión en FMRI '{0}'.
fr: Le FMRI '{0}' ne contient pas les informations de version.
ja: FMRI '{0}' はバージョン情報がありません。

source: Missing '/' after publisher name
de: Fehlender '/' nach Herausgebername
es: Falta '/' después del nombre de editor
fr: '/' manquant après le nom de l'éditeur
ja: パブリッシャー名の後ろに '/' がありません

source: sort_file_max_size must be greater than 0
de: sort_file_max_size muss größer als 0 sein
es: sort_file_max_size debe ser mayor que 0
fr: sort_file_max_size doit être supérieur à 0
ja: sort_file_max_size は 0 より大きい必要があります

source: no sections found in data file {0}
de: Keine Abschnitte in Datendatei {0} gefunden
es: no se encontraron secciones en el archivo de datos {0}
fr: Aucune section n'a été trouvée dans le fichier de données {0}
ja: データファイル {0} にはセクションがありません

source: unable to parse data file {path}: {err}
de: Datendatei {path} kann nicht geparst werden: {err}
es: no se puede analizar el archivo de datos {path}: {err}
fr: impossible d'analyser le fichier de données {path} : {err}
ja: {path} のデータファイルを解析できません: {err}

source: missing file {0}
de: Fehlende Datei {0}
es: falta el archivo {0}
fr: fichier manquant {0}
ja: ファイル {0} がありません

source: Multiple values for {key} in {actions}
de: Mehrere Werte für {key} in {actions}
es: Varios valores para {key} en {actions}
fr: Valeurs multiples pour {key} dans {actions}
ja: {actions} で {key} に複数の値が指定されています
