Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: {0} is not a directory
de: {0} ist kein Verzeichnis
es: {0} no es un directorio
fr: {0} n'est pas un répertoire
ja: {0} はディレクトリではありません

source: invalid port: {0}
de: Ungültiger Port: {0}
es: puerto no válido: {0}
fr: port non valide : {0}
ja: 無効なポート: {0}

source: invalid cache size: {0}
de: Ungültige Cachegröße: {0}
es: tamaño de caché no válido: {0}
fr: taille de cache non valide : {0}
ja: 無効なキャッシュサイズ: {0}

source: Unable to write Apache configuration: {host}: {err}
de: Apache-Konfiguration kann nicht geschrieben werden: {host}: {err}
es: No se puede escribir la configuración de Apache {host}: {err}
fr: Impossible d'écrire la configuration Apache : {host} : {err}
ja: Apache 構成を書き込めません: {host}: {err}

source: Unable to write depot_httpd.conf: {0}
de: depot_httpd.conf kann nicht geschrieben werden: {0}
es: No se puede escribir depot_httpd.conf: {0}
fr: Impossible d'écrire depot_httpd.conf : {0}
ja: depot_httpd.conf を書き込めません: {0}

source: Unable to write versions response: {0}
de: Versionsantwort kann nicht geschrieben werden: {0}
es: No se puede escribir la respuesta de las versiones: {0}
fr: Impossible d'écrire la réponse des versions : {0}
ja: バージョンの応答を書き込めません: {0}

source: Unable to write publisher response: {0}
de: Herausgeberantwort kann nicht geschrieben werden: {0}
es: No se puede escribir la respuesta de editor: {0}
fr: Impossible d'écrire la réponse de l'éditeur : {0}
ja: パブリッシャーの応答を書き込めません: {0}

source: Unable to write status response: {0}
de: Statusantwort kann nicht geschrieben werden: {0}
es: No se puede escribir la respuesta de estado: {0}
fr: Impossible d'écrire la réponse d'état : {0}
ja: ステータスの応答を書き込めません: {0}

source: Cannot find user provided CA certificate file: {0}
de: Die vom Benutzer übermittelte CA-Zertifikatsdatei kann nicht gefunden werden: {0}
es: No se ha encontrado el archivo del certificado de CA proporcionado por el usuario: {0}
fr: Impossible de trouver le certificat CA fourni par l'utilisateur : {0}
ja: ユーザーが指定した CA 証明書ファイルが見つかりません: {0}

source: Cannot find user provided CA key file: {0}
de: Die vom Benutzer übermittelte CA-Schlüsseldatei kann nicht gefunden werden: {0}
es: No se ha encontrado el archivo de la clave de CA proporcionado por el usuario: {0}
fr: Impossible de trouver le fichier de clé de certificat CA fourni par l'utilisateur : {0}
ja: ユーザーが指定した CA 鍵ファイルが見つかりません: {0}

source: Unable to remove an existing 'htdocs' directory in the runtime directory: {0}
de: Entfernen eines vorhandenen "htdocs"-Verzeichnisses im Laufzeit-Verzeichnis nicht möglich: {0}
es: No se pudo eliminar un directorio 'htdocs' existente en el directorio de tiempo de ejecución: {0}
fr: Impossible de supprimer un répertoire 'htdocs' existant dans le répertoire d'exécution : {0}
ja: 実行時ディレクトリ内の既存の「htdocs」ディレクトリを削除できません: {0}

source: no repositories found
de: Keine Repositorys gefunden
es: no se encontraron repositorios
fr: aucun référentiel n'a été trouvé
ja: リポジトリが見つかりません

source: Unable to write configuration: {0}
de: Konfiguration kann nicht geschrieben werden: {0}
es: No se puede escribir la configuración: {0}
fr: Impossible d'écrire la configuration : {0}
ja: 構成を書き込めません: {0}

source: Created {0}/depot.conf
de: {0}/depot.conf erstellt
es: Se creó {0}/depot.conf
fr: {0}/depot.conf créé
ja: {0}/depot.conf を作成しました

source: No online, readonly, non-standalone instances of {0} found.
de: Keine Online-, schreibgeschützten, Nicht-Standalone-Instanzen von {0} gefunden.
es: No se encontraron instancias de {0} en línea, de sólo lectura, no independientes.
fr: Aucune instance en ligne, en lecture seule ou non autonome de {0} n'a été trouvée.
ja: オンラインでもスタンドアロンでもない、読み取り専用の {0} のインスタンスが見つかりました。

source: prefix {0} cannot be used more than once in a given depot configuration
de: Präfix {0} kann in einer Depotkonfiguration nicht mehrmals verwendet werden
es: el prefijo {0} no puede utilizarse más de una vez en una configuración de depósito determinada
fr: impossible d'utiliser le préfixe {0} plusieurs fois dans une configuration de dépôt donnée
ja: 接頭辞 {0} を指定のデポ構成内で複数回使用することはできません

source: repo_root {0} cannot be used more than once in a given depot configuration
de: repo_root {0} kann in einer Depotkonfiguration nicht mehrmals verwendet werden
es: repo_root {0} no puede utilizarse más de una vez en una configuración de depósito determinada.
fr: impossible d'utiliser repo_root {0} plusieurs fois dans une configuration de dépôt donnée
ja: repo_root {0} を指定のデポ構成内で複数回使用することはできません

source: writable_root {0} cannot be used more than once in a given depot configuration
de: writable_root {0} kann in einer Depotkonfiguration nicht mehrmals verwendet werden
es: writable_root {0} no puede utilizarse más de una vez en una configuración de depósito determinada.
fr: Impossible d'utiliser writable_root {0} plusieurs fois dans une configuration de dépôt donnée
ja: writable_root {0} を指定のデポ構成内で複数回使用することはできません

source: cannot use '/' chars in prefixes
de: Zeichen '/' darf nicht in Präxifen verwendet werden
es: no se puede usar caracteres '/' en prefijos
fr: impossible d'utiliser le caractère '/' dans des préfixes
ja: 接頭辞に '/' 文字を使用できません

source: %s is not a valid prefix
de: %s ist kein gültiges Präfix
es: %s no es un prefijo válido
fr: %s n'est pas un préfixe valide
ja: %s は有効な接頭辞ではありません

source: -d arguments must be in the form <prefix>=<repo path>[=writable root]
de: -d-Argumente müssen das Format <Präfix>=<Repository-Pfad>[=beschreibbare Root] aufweisen
es: los argumentos -d deben tener la forma <prefix>=<repo path> [=writable root]
fr: Les arguments -d doivent adopter le format <prefix>=<repo path>[=writable root]
ja: -d 引数の形式は <prefix>=<repo path>[= 書き込み可能ルート] である必要があります

source: required runtime dir option -r missing.
de: erforderliche Laufzeitverzeichnisoption -r fehlt.
es: falta la opción dir de tiempo de ejecución -r requerida.
fr: l'option de répertoire d'exécution -r est manquante.
ja: 必須の実行時ディレクトリオプション -r がありません。

source: cache_dir option -c is required if -F is not used.
de: cache_dir-Option -c ist erforderlich, wenn -F nicht verwendet wird.
es: la opción -c de cache_dir se requiere si no se usa -F.
fr: l'option de répertoire du cache -c est requise si -F n'est pas utilisé.
ja: -F を使用しない場合は、キャッシュディレクトリオプション -c が必要です。

source: required port option -p missing.
de: erforderliche Portoption -p fehlt.
es: falta la opción -p de puerto.
fr: l'option de port requise -p est manquante.
ja: 必須のポートオプション -p がありません。

source: at least one -d option is required if -S is not used.
de: mindestens eine -d-Option ist erforderlich, wenn -S nicht verwendet wird.
es: se requiere al menos una opción -d si no se usa -S.
fr: une option -d au moins est requise si -S n'est pas utilisé.
ja: -S を使用しない場合は、-d オプションが少なくとも 1 つ必要です。

source: cannot use -d and -S together.
de: -d und -S können nicht zusammen verwendet werden.
es: no se puede usar -d y -S al mismo tiempo.
fr: impossible d'utiliser -d et -S simultanément.
ja: -d と -S は同時に使用できません。

source: https configuration is not supported in fragment mode.
de: Die https-Konfiguration wird im Fragmentmodus nicht unterstützt.
es: la configuración de https no se admite en el modo de fragmento.
fr: la configuration https n'est pas prise en charge en mode fragment.
ja: フラグメントモードでは HTTPS 構成はサポートされていません。

source: certificate and key files must be presented at the same time.
de: Zertifikats- und Schlüsseldateien müssen gleichzeitig vorliegen.
es: los archivos del certificado y la clave deben estar presentes al mismo tiempo.
fr: le certificat et les fichiers de clé doivent être présentés en même temps.
ja: 証明書と鍵ファイルは同時に指定する必要があります。

source: cert-key-dir option is require to store the generated certificates and keys
de: Die Option "cert-key-dir" wird benötigt, um die generierten Zertifikate und Schlüssel zu speichern
es: la opción cert-key-dir es necesaria para almacenar los certificados y las claves que se generaron
fr: l'option cert-key-dir est requise pour stocker les certificats et clés générés.
ja: 生成された証明書と鍵を格納するには cert-key-dir オプションが必要です。

source: Cannot use --cert-chain without --cert and --key
de: --cert-chain kann nicht ohne --cert und --key verwendet werden
es: No se puede usar --cert-chain sin --cert y --key
fr: Impossible d'utiliser la chaîne --cert-sans --cert ni --key
ja: --cert-chain は --cert と --key なしでは使用できません。

source: server CA certificate and key files must be presented at the same time.
de: Server-CA-Zertifikats- und Schlüsseldateien müssen gleichzeitig vorliegen.
es: los archivos del certificado y la clave de CA del servidor deben estar presentes al mismo tiempo.
fr: Le certificat CA de serveur et les fichiers de clé doivent être présentés en même temps.
ja: サーバーの CA 証明書と鍵ファイルは同時に指定する必要があります。

source: Server CA certificate is located at {0}. Please deploy it into /etc/certs/CA directory of each client.
de: Das Server-CA-Zertifikat befindet sich unter {0}. Stellen Sie es im Verzeichnis /etc/certs/CA eines jeden Clients bereit.
es: El certificado de CA del servidor está ubicado en {0}. Impleméntelo en el directorio /etc/certs/CA de cada cliente.
fr: Le certificat CA de serveur se trouve sur {0}. Veuillez le déployer dans le répertoire /etc/certs/CA de chaque client.
ja: サーバーの CA 証明書は {0} にあります。それを各クライアントの /etc/certs/CA ディレクトリに配備してください。

source: User provided server certificate file {0} does not exist.
de: Die vom Benutzer übermittelte Server-Zertifikatsdatei {0} ist nicht vorhanden.
es: El archivo del certificado del servidor {0} que proporcionó el usuario no existe.
fr: Le fichier {0} de certificat de serveur fourni par l'utilisateur n'existe pas.
ja: ユーザーが指定したサーバー証明書ファイル {0} が存在しません。

source: User provided server key file {0} does not exist.
de: Die vom Benutzer übermittelte Server-Schlüsseldatei {0} ist nicht vorhanden.
es: El archivo de la clave del servidor {0} que proporcionó el usuario no existe.
fr: Le fichier {0} de clé de serveur fourni par l'utilisateur n'existe pas.
ja: ユーザーが指定したサーバー鍵ファイル {0} が存在しません。

source: User provided certificate chain file {0} does not exist.
de: Die vom Benutzer übermittelte Zertifikatskettendatei {0} ist nicht vorhanden.
es: El archivo de cadena de certificado {0} que proporcionó el usuario no existe.
fr: Le fichier {0} de chaîne de certificat fourni par l'utilisateur n'existe pas.
ja: ユーザーが指定した証明書チェーンファイル {0} が存在しません。

source: certificate or key files are given before https service is turned on. Use --https to turn on the service.
de: Zertifikats- oder Schlüsseldateien werden bereitgestellt, bevor der https-Service aktiviert wird. Verwenden Sie --https, um den Service zu aktivieren.
es: los archivos del certificado o la clave se proporcionan antes de que se active el servicio https. Use --https para activar el servicio.
fr: les fichiers de certificat ou de clé sont donnés avant l'activation du service https. Utilisez --https pour activer le service.
ja: 証明書または鍵ファイルが HTTPS サービスを有効にする前に指定されています。--https を使用してこのサービスを有効にします。

source: cannot use --smf-fmri without --https.
de: --smf-fmri kann nicht ohne --https verwendet werden.
es: no puede usar --smf-fmri sin --https.
fr: Impossible d'utiliser --smf-fmri sans --https.
ja: --smf-fmri は --https なしでは使用できません。

source: cannot use -d with writable roots and -F together.
de: -d mit beschreibbaren Roots und -F können nicht zusammen verwendet werden.
es: no se puede usar -d con raíces escribibles y -F al mismo tiempo.
fr: Impossible d'utiliser -d avec des droits d'écriture pour la racine et -F simultanément.
ja: 書き込み可能ルートを指定した -d は -F と同時に使用できません。

source: cannot use -F and -p together.
de: -F und -p können nicht zusammen verwendet werden.
es: no se puede usar -F y -p al mismo tiempo.
fr: impossible d'utiliser -F et -p simultanément.
ja: -F と -p は同時に使用できません。

source: cannot use -F and -A together.
de: -F und -A können nicht zusammen verwendet werden.
es: no se puede usar -F y -A al mismo tiempo.
fr: impossible d'utiliser -F et -A simultanément.
ja: -F と -A は同時に使用できません。

source: cannot use -P without -F.
de: -P kann nicht ohne -F verwendet werden.
es: no se puede usar -P sin -F.
fr: impossible d'utiliser -P sans -F.
ja: -P は -F なしでは使用できません。

source: unknown server type {type}. Known types are: {known}
de: Unbekannter Servertyp {type}. Bekannte Typen sind: {known}
es: tipo de servidor desconocido {type}. Los tipos conocidos son: {known}
fr: type de serveur inconnu {type}. Les types connus sont : {known}
ja: 不明なサーバータイプ {type}。既知のタイプは {known} です

source: Try `pkg.depotd --help or -?' for more information.
ca: Proveu amb `pkg.depotd --help o -?' per a més informació.
de: Geben Sie 'pkg.depotd --help bzw. -?' ein, um weitere Informationen zu erhalten.
es: Intente `pkg.depotd --help or -?' para obtener más información.
fr: Pour obtenir de plus amples informations, essayez 'pkg.depotd --help ou -?'.
ja: 詳細は、pkg.depotd --help または -? を参照してください。
ru: Для получения дополнительной информации воспользуйтесь командой "pkg.depotd --help или -?".

source: property arguments must be of the form '<section.property>=<value>'.
ca: els valors de propietat ha de tenir la forma '<secció.propietat>=<valor>'.
de: Eigenschaftsargumente müssen die Form '<Abschnitt.Eigenschaft>=<Wert>' haben.
es: los argumentos property deben tener el formato '<sección.propiedad>=<valor>'.
fr: les arguments de propriété doivent adopter la forme '<section.property>=<value>'.
ja: プロパティーの引数は '<section.property>=<value>' の形式になっている必要があります。
ru: аргументы свойства должны иметь форму '<section.property>=<value>'.

source: Need to try installing {action} again
de: Die Installation von {action} muss erneut versucht werden
es: Se debe intentar la instalación de {action} nuevamente
fr: Vous devez réessayer d'installer {action}
ja: {action} のインストールを再度試みる必要があります

source: unknown action type '{type}' in package '{fmri}' in action '{action}'
de: Unbekannter Aktionstyp '{type}' in Package '{fmri}' in Aktion '{action}'
es: tipo desconocido de acción '{type}' en el paquete '{fmri}' en la acción '{action}'
fr: type d'action inconnu '{type}' dans le package '{fmri}' pour l'action '{action}'
ja: アクション '{action}' のパッケージ '{fmri}' の不明なアクションタイプ '{type}'

source: unknown action type '{type}' in action '{action}'
de: Unbekannter Aktionstyp '{type}' in Aktion '{action}'
es: tipo desconocido de acción '{type}' en la acción '{action}'
fr: type d'action inconnu '{type}' pour l'action '{action}'
ja: アクション '{action}' の不明なアクションタイプ '{type}'

source: Malformed action in package '{fmri}' at position: {pos:d}: {error}: {action} {marker}
de: Aktion mit falschem Format in Package '{fmri}' in Position: {pos:d}: {error}: {action} {marker}
es: Acción incorrecta en el paquete '{fmri}' en la posición: {pos:d}: {error}: {action} {marker}
fr: Action mal formulée dans le package '{fmri}' à la position : {pos:d} : {error} : {action} {marker}
ja: パッケージ '{fmri}' の次の位置にある不正な形式のアクション: {pos:d}: {error}: {action} {marker}

source: Malformed action at position: {pos:d}: {error}: {action} {marker}
de: Aktion mit falschem Format in Position: {pos:d}: {error}: {action} {marker}
es: Acción incorrecta en la posición: {pos:d}: {error}: {action} {marker}
fr: Action mal formulée à la position : {pos:d} : {error} : {action} {marker}
ja: 次の位置にある不正な形式のアクション: {pos:d}: {error}: {action} {marker}

source: invalid action in package {fmri}: {action}: {error}
de: Ungültige Aktion in Package {fmri}: {action}: {error}
es: Acción no válida en el paquete {fmri}: {action}: {error}
fr: action non valide dans le package {fmri} : {action} : {error}
ja: パッケージ {fmri} の無効なアクション: {action}: {error}

source: invalid action, '{action}': {error}
de: Ungültige Aktion, '{action}': {error}
es: acción no válida, '{action}': {error}
fr: action non valide, '{action}' : {error}
ja: 無効なアクション: '{action}': {error}

source: no value specified for key attribute '{0}'
de: kein Wert für Schlüsselattribut '{0}' angegeben
es: no se especificó ningún valor para el atributo clave '{0}'
fr: aucune valeur n'a été spécifiée pour l'attribut principal '{0}'
ja: キー属性 '{0}' に値が指定されていません

source: {0} attribute may only be specified once
de: {0}-Attribut darf nur einmal angegeben werden
es: el atributo {0} sólo se puede especificar una vez
fr: l'attribut {0} ne peut être spécifié qu'une seule fois
ja: {0} 属性は 1 回だけ指定できます

source: Empty or invalid path attribute
de: Leeres oder ungültiges Pfadattribut
es: El atributo path está vacío o no es válido
fr: Attribut de chemin vide ou non valide
ja: 空または無効なパス属性です

source: The action '{action}' in package '{fmri}' has invalid attribute(s): {act_errors}
de: Die Aktion '{action}' in Package '{fmri}' enthält ungültige Attribute: {act_errors}
es: La acción '{action}' del paquete '{fmri}' tiene atributos no válidos: {act_errors}
fr: L'action '{action}' dans le package '{fmri}' contient un ou plusieurs attributs non valides : {act_errors}
ja: パッケージ '{fmri}' のアクション '{action}' には無効な属性があります: {act_errors}

source: The action '{action}' has invalid attribute(s): {act_errors}
de: Die Aktion '{action}' enthält ungültige Attribute: {act_errors}
es: La acción '{action}' tiene atributos no válidos: {act_errors}
fr: L'action '{action}' contient un ou plusieurs attributs non valides : {act_errors}
ja: アクション '{action}' には無効な属性があります: {act_errors}

source: Action payload '{name}' was not found in any of the provided locations: {basedirs}
de: Aktions-Payload '{name}' wurde in keinem der angegebenen Verzeichnisse gefunden: {basedirs}
es: La carga útil de acción '{name}' no se encontró en ninguna de las ubicaciones proporcionadas: {basedirs}
fr: Les données traitées de l'action '{name}' n'ont été trouvées à aucun des emplacements spécifiés : {basedirs}
ja: アクションのペイロード '{name}' は指定された場所のいずれにも見つかりませんでした: {basedirs}

source: Action payload '{name}' was not found in any of the provided sources: {sources}
de: Aktions-Payload '{name}' wurde in keiner der angegebenen Quellen gefunden: {sources}
es: La carga útil de acción '{name}' no se encontró en ninguno de los orígenes proporcionados: {sources}
fr: Les données traitées de l'action '{name}' n'ont été trouvées à aucune des sources spécifiées : {sources}
ja: アクションのペイロード '{name}' は指定されたソースのいずれにも見つかりませんでした: {sources}

source: Package is not installed in parent image {0}
de: Paket ist im übergeordneten Abbild {0} nicht installiert
es: El paquete no está instalado en la imagen principal {0}
fr: Le package n'est pas installé dans l'image parente {0}
ja: 親イメージ {0} にパッケージがインストールされていません

source: Package in parent is from a different publisher: {0}
de: Paket im übergeordneten Abbild ist von einem anderen Herausgeber: {0}
es: El paquete de la imagen principal proviene de un editor diferente: {0}
fr: Le package inclus dans le parent provient d'un éditeur différent : {0}
ja: 親に含まれているパッケージが別のパブリッシャーによるものです: {0}

source: Parent image has a newer version of package {0}
de: Übergeordnetes Abbild verfügt über eine neuere Version des Pakets {0}
es: La imagen principal tiene una versión más reciente del paquete {0}
fr: L'image parente a une version plus récente du package {0}
ja: 親イメージに新しいバージョンのパッケージ {0} が含まれています

source: Parent image has an older version of package {0}
de: Übergeordnetes Abbild verfügt über eine ältere Version des Pakets {0}
es: La imagen principal tiene una versión anterior del paquete {0}
fr: L'image parente a une version plus ancienne du package {0}
ja: 親イメージに古いバージョンのパッケージ {0} が含まれています

source: {dep_type} dependency {dep_val} is downrev ({inst_ver})
de: {dep_type}-Abhängigkeit {dep_val} ist downrev ({inst_ver})
es: La dependencia {dep_type} {dep_val} se refiere a la versión anterior ({inst_ver})
fr: La dépendance {dep_type} {dep_val} est révisée vers le bas ({inst_ver})
ja: {dep_type} の依存関係 {dep_val} は downrev ({inst_ver}) です

source: {dep_type} dependency {dep_val} is uprev ({inst_ver})
de: {dep_type}-Abhängigkeit {dep_val} ist uprev ({inst_ver})
es: La dependencia {dep_type} {dep_val} se refiere a la versión posterior ({inst_ver})
fr: La dépendance {dep_type} {dep_val} est révisée vers le haut ({inst_ver})
ja: {dep_type} の依存関係 {dep_val} は uprev ({inst_ver}) です

source: {dep_type} dependency on an obsolete package ({obs_pkg}); this package must be uninstalled manually
de: {dep_type}-Abhängigkeit von veraltetem Package ({obs_pkg}); dieses Package muss manuell deinstalliert werden
es: La dependencia {dep_type} está en un paquete obsoleto ({obs_pkg}); este paquete debe desinstalarse manualmente
fr: Dépendance {dep_type} sur un package obsolète ({obs_pkg}) ; ce package doit être désinstallé manuellement
ja: {dep_type} は廃止されたパッケージ ({obs_pkg}) に依存しています。このパッケージは手動でアンインストールする必要があります

source: Unknown type ({0}) in depend action
de: Unbekannter Typ ({0}) in Abhängigkeitsaktion
es: Tipo desconocido ({0}) en acción dependiente
fr: Type inconnu ({0}) dans une action de dépendance
ja: 依存アクションのタイプ ({0}) は不明です

source: Group dependency on one of {0} not met
de: Gruppenabhängigkeit von einem der {0} nicht erfüllt
es: Dependencia de grupo en uno de los {0} no cumplida
fr: La dépendance sur l'un des {0} n'est pas satisfaite
ja: いずれかの {0} のグループ依存関係が満たされていません

source: Required dependency on one of {0} not met
de: Erforderliche Abhängigkeit von einem der {0} nicht erfüllt
es: Dependencia requerida en uno de los {0} no cumplida
fr: La dépendance requise sur l'un des {0} n'est pas satisfaite
ja: いずれかの {0} の必須の依存関係が満たされていません

source: Required dependency {0} is not installed
de: Erforderliche Abhängigkeit {0} ist nicht installiert
es: La dependencia requerida {0} no está instalada
fr: La dépendance requise {0} n'est pas installée
ja: 必須の依存関係 {0} がインストールされていません

source: Unknown type '{0}' in depend action
de: Unbekannter Typ '{0}' in Abhängigkeitsaktion
es: Tipo desconocido '{0}' en acción dependiente
fr: Type inconnu '{0}' dans une action de dépendance
ja: 依存アクションのタイプ '{0}' は不明です

source: a predicate may only be specified for conditional dependencies
de: Ein Prädikat darf nur für bedingte Abhängigkeiten angegeben werden
es: sólo se puede especificar un predicado para dependencias condicionales
fr: un prédicat peut uniquement être spécifié pour les dépendances conditionnelles
ja: 述語は条件付き依存性にのみ指定できます

source: the root-image attribute is only valid for origin dependencies
de: Das Root-Abbildattribut ist nur für Ursprungsabhängigkeiten gültig.
es: el atributo de imagen raíz sólo es válido para dependencias de origen
fr: l'attribut d'image root est uniquement valide pour les dépendances d'origine
ja: root-image 属性は起点の依存性に対してのみ有効です

source: invalid {attr} value '{value}': {error}
de: Ungültiger {attr}-Wert '{value}': {error}
es: valor {attr} no válido '{value}': {error}
fr: valeur {attr} non valide '{value}' : {error}
ja: 無効な {attr} の値 '{value}': {error}

source: Unable to create directory {0}; it has been replaced with a link. To continue, please remove the link or restore the directory to its original location and try again.
de: Verzeichnis {0}; kann nicht erstellt werden, da es durch einen Link ersetzt wurde. Zum Fortsetzen entfernen Sie den Link oder stellen Sie das Verzeichnis am ursprünglichen Speicherort wieder her,und versuchen es erneut.
es: No se puede crear el directorio {0}; se ha reemplazado por un vínculo. Para continuar, elimine el vínculo o restaure el directorio a su ubicación original y vuelva a intentarlo.
fr: Impossible de créer le répertoire {0} ; il a été remplacé par un lien. Pour continuer, supprimez ce lien ou restaurez le répertoire à son emplacement d'origine, puis réessayez.
ja: ディレクトリ {0} を作成できません。リンクで置き換えられています。続行するには、リンクを削除するかディレクトリを元の場所に復元してから、やり直してください。
