Repository: oracle/solaris-ips
Catalog: src/po/*.po
Languages: ca, de, es, fr, ja, ru

source: Inventory exception:
ca: Excepció d'inventari:
ru: Исключительная ситуация инвентаризационной информации:

source: Please check the network connection. Is the repository accessible? %s
ca: Si us plau comproveu la connexió de xarxa. És accessible el repositori? %s
ru: Проверьте сетевое соединение. Возможен ли доступ к хранилищу? %s

source: Unable to contact a valid package depot. Please check your network settings and attempt to contact the server using a web browser. %s
ru: Невозможно установить связь с действительным хранилищем пакетов. Проверьте параметры настройки сетии попытайтесь установить связь с сервером через веб-обозреватель. %s

source: pkg(7) appears to be out of date and should be updated. Please update %s package
ru: pkg(7) устарел, его необходимо обновить. Обновите пакет %s

source: Cannot remove: %s Due to the following packages that depend on it:
ca: No es pot eliminar: %s Degut a que els següent paquets en depenen:
ru: Невозможно удалить: %s вследствие зависимости следующих пакетов:

source: Press %(button)s button to continue removal without %(package)s
ru: Нажмите кнопку %(button)s для продолжения удаления без %(package)s

source: Failure of consistent use of pfexec or gksu when running %s is often a source of this problem.
ru: Непоследовательное использование pfexec или gksu при запуске %s часто вызывает эту проблему.

source: To rebuild index, please use the terminal command:
ca: Per a reconstruir l'índex, si us plau utilitzeu la comanda de terminal:
ru: Для перестройки индекса используется команда терминала:

source: There was an error during installation. The search index is corrupted. You might want try to fix this problem by running command: pfexec pkg rebuild-index
ru: Во время установки произошла ошибка. Индекс поиска поврежден. Можно попытаться исправить эту проблему, выполнив команду: pfexec pkg rebuild-index

source: This is a Live Image. The install operation can't be performed.
ru: Это образ Live Image. Невозможно выполнить операцию установки.

source: The requested operation would affect files that cannot be modified in the Live Image. Please retry this operation on an alternate boot environment.
ru: Запрошенная операция может повлиять на файлы, которые нельзя изменить в образеLive Image. Повторите эту операцию в альтернативной загрузочной среде.

source: There was an error during installation. The Plan of the operation is missing and the operation can't be finished. You might want try to fix this problem by restarting %s
ru: Во время установки произошла ошибка. Отсутствует план операции или операция не может быть завершена. Можно попытаться решить эту проблему, перезагрузив %s

source: There was an error during installation. The State of the image is incorrect and the operation can't be finished. You might want try to fix this problem by restarting %s
ru: Во время установки произошла ошибка. Состояние образа является некорректным и операция не может быть выполнена. Для устранения этой проблемы можно попробовать перезагрузить %s

source: Specifying BE Name not supported.
ca: El nom de l'entorn d'arranc especificat no està suportat.
ru: Указанное имя среды загрузки не поддерживается.

source: Updating %s
ca: Actualitzant %s
ru: Обновление %s

source: Executing...
ca: Executant...
ru: Выполнение...

source: Despite the error while indexing, the update, install, or uninstall has completed successfully.
ru: Несмотря на ошибку во время индексирования, команда update, install или uninstall выполнена успешно.

source: Gathering package information, please wait...
ca: Recollint informació del paquet, espereu...
ru: Сбор информации о пакетах, ждите...

source: Gathering package information
ca: Recopilant l'informació del paquet
ru: Сбор сведений о пакете

source: All packages already installed.
ca: Ja estan instal·lats tots el paquets.
ru: Все пакеты уже установлены.

source: No updates necessary
ru: Обновление не требуется

source: No updates available
ca: No ni han actualitzacions disponibles
ru: Обновления отсутствуют

source: Review the package which will be affected by Updates
ru: Просмотр пакета, на который повлияет операция "Обновления"

source: No further information available
ca: No hi ha més informació disponible
ru: Дополнительная информация отсутствует.

source: Error:
ru: Ошибка:

source: - Failed </b>
ca: - Fallit </b>
ru: - отказ </b>

source: An unknown error occurred in the %s stage. Please let the developers know about this problem by filing a bug together with the error details listed below at:
ru: На этапе %s произошла неизвестная ошибка. Сообщите разработчикам об этой проблеме, отправив отчет об ошибке вместе с подробными данными об ошибке по адресу:

source: Exception traceback:
ca: Traceig de l'excepció:
ru: Результат отслеживания исключения:

source: pkg version:
ca: versió pkg:
ru: Версия pkg:

source: List of configured publishers:
ca: Llistat dels publicadors configurats:
ru: Список настроенных издателей:

source: Downloaded %(current)s of %(total)s
ca: Descarregats %(current)s de %(total)s
ru: Загружено %(current)s из %(total)s

source: %(cur)d of %(goal)d - %(name)s
ru: %(cur)d %(goal)d - %(name)s

source: Installation completed successfully
ca: Instal·lació correctament completada
ru: Установка успешно завершена

source: Packages removed successfully
ca: Paquets eliminats correctament
ru: Удаление пакетов успешно завершено

source: Packages updated successfully
ca: Paquets actualitzats correctament
ru: Обновление пакетов успешно завершено

source: Not enough disk space, the selected action cannot be performed. Click OK to manage your existing BEs and free up disk space or Cancel to cancel the action.
ca: No hi ha prou espai lliure, l'acció seleccionada no es pot realitzar. Cliqueu a Acceptar per a gestionar els vostres entorns d'arranc i allibereu espai al disc, o Cancel·lar per a cancel·lar l'acció.
ru: Недостаточно места на диске, выполнение выбранного действия невозможно. Нажмите кнопку "OK" для управления имеющимися средами загрузки в целях освобождения дискового пространства либо нажмите кнопку "Отмена" для отмены действия.

source: Not Enough Disk Space
ca: No hi ha espai suficient al disc
ru: Недостаточно места на диске

source: Packages To Be Updated:
ca: Paquets a ser actualitzats:
ru: Обновляемые пакеты:

source: Packages To Be Installed:
ca: Paquets a ser instal·lats:
ru: Устанавливаемые пакеты:

source: Packages To Be Removed:
ca: Paquets a ser eliminats:
ru: Удаляемые пакеты:

source: A_ccept
ca: A_cceptar
ru: _Принять

source: You must accept the terms of the license before downloading this package.
ca: Heu d'acceptar els termes de la llicència abans de descarregar aquest paquet.
ru: Перед загрузкой этого пакета необходимо принять условия лицензии.

source: You must view the terms of the license before downloading this package.
ca: Heu de visualitzar els termes de la llicència abans de descarregar aquest paquet.
ru: Перед загрузкой этого пакета необходимо ознакомиться с условиями лицензии.

source: %s License
ca: %s Llicència
ru: Лицензия %s

source: Errors logged: click to view
ca: Errors registrats: clicar per a visualitzar
ru: В журнал занесены ошибки: щелкните для просмотра

source: Version mismatch: expected version %d, got version %d
ca: Incongruència de versió: versió esperada %d, versió adquirida %d
ru: Несоответствие версий: ожидаемая версия %d, полученная версия %d

source: %s is not an install image
ca: %s no és una imatge d'instal·lació
ru: %s не является образом установки

source: Error
ru: Ошибка

source: Build
ru: Компоновка

source: (not installed)
ca: (no instal·lat)
ru: (не установлено)

source: Installed Version
ru: Установленная версия

source: No dependencies
ru: Зависимости отсутствуют

source: Name:
ca: Nom:
ru: Имя:

source: Summary:
ru: Заключение:

source: Description:
ca: Descripció
ru: Описание:

source: Size:
ca: Mida:
ru: Размер:

source: Category:
ca: Categoria:
ru: Категория:

source: Installed:
ca: Instal·lat:
ru: Установлено:

source: Version Available:
ca: Versió disponible:
ru: Доступная версия:

source: Renamed To:
ru: Переименовано на:

source: Latest Version:
ca: Última versió:
ru: Последняя версия:

source: Publisher:
ca: Publicador:
ru: Издатель:

source: (Obsolete)
ru: (Устаревший)

source: %(version)s (Build %(build)s-%(branch)s)
ca: %(version)s (Construcció %(build)s-%(branch)s)
ru: %(version)s (сборка %(build)s-%(branch)s)

source: (disabled)
ca: (deshabilitat)
ru: (отменены)

source: (removed)
ca: (eliminat)
ru: (удалено)

source: Not available
ca: No disponible
ru: Недоступен

source: License could not be shown due to conversion problem.
ca: La llicència no pot ser carregada degut a un problema de conversió.
ru: Не удалось отобразить лицензию из-за проблемы преобразования.

source: Catalog refresh error:
ca: Error de refresc de catàleg:
ru: Ошибка обновления каталога:

source: Only %(suc)s out of %(tot)s catalogs successfully updated.
ca: Únicament s'han actualitzat correctament %(suc)s de %(tot)s catàlegs.
ru: Только %(suc)s из %(tot)s каталогов успешно обновлены.

source: Logs
ca: Registres
ru: Журналы

source: Loading ...
ca: Carregant...
ru: Загрузка...

source: None:
ca: Sense:
ru: Отсутствует:

source: Retrieving catalog '%s'...
ca: Recuperant catàleg '%s'...
ru: Извлечение каталога '%s'...

source: Caching catalogs ...
ca: capturant catàlegs ...
ru: Кэширование каталогов...

source: Loading catalog cache ...
ca: Carregant cau del catàleg ...
ru: Загрузка кэша каталога...

source: Refreshing catalog %s
ca: Refrescant catàleg %s
ru: Обновление каталога %s

source: Finished refreshing catalog %s
ca: Finalitzat refresc del catàleg %s
ru: Завершенное обновление каталога %s

source: Evaluating: %s
ca: Avaluant: %s
ru: Анализ: %s

source: Package %d of %d: %s
ca: Paquet %d de %d: %s
ru: Пакет %d из %d: %s

source: e.g. http://pkg.opensolaris.org/release
ca: pex. http://pkg.opensolaris.org/release
ru: например http://pkg.opensolaris.org/release

source: Manage Publishers Confirmation
ca: Gestionar la configuració dels publicadors
ru: Подтверждение управления издателями

source: Alias
ca: Àlies
ru: Псевдоним

source: Enabled
ca: Habilitat
ru: Включено

source: Sticky
ru: Клейкий

source: Alias contains invalid characters
ru: Псевдоним содержит недопустимые символы

source: Alias already in use
ru: Псевдоним уже используется

source: Adding Publisher
ca: Afegint publicador
ru: Добавление издателя

source: Canceling...
ca: Cancel·lant...
ru: Отмена...

source: Removing publisher %s
ca: Eliminant publicador %s
ru: Удаление издателя %s

source: Publisher %s succesfully removed
ca: El publicador %s ha estat correctament eliminat
ru: Удаление издателя %s успешно завершено

source: Adding publisher %s
ca: Afegint publicador %s
ru: Добавление издателя %s

source: Updating publisher %s
ca: Actualitzant publicador %s
ru: Обновление издателя %s

source: Publisher %s succesfully added
ca: El publicador %s ha estat correctament afegit
ru: Добавление издателя %s успешно завершено

source: Publisher %s succesfully updated
ca: El publicador %s ha estat correctament actualitzat
ru: Обновление издателя %s успешно завершено

source: Disable Publisher:
ca: Des-habilitar publicador:
ru: Отключить издатель:

source: Enable Publisher:
ca: Habilitar publicador:
ru: Включить издатель:

source: Remove Publisher:
ca: Eliminar el publicador:
ru: Удалить издателя:

source: Set sticky Publisher:
ru: Установить клейкое значение для издателя:

source: Unset sticky Publisher:
ru: Отменить установку клейкого значения для издателя:

source: Change Priorities:
ca: Canviar les prioritats:
ru: Изменить приоритеты:

source: Apply the following change:
ca: Aplicar el següent canvi:
ru: Применить следующее изменение:

source: Disabling
ca: Deshabilitant
ru: Отключение

source: Enabling
ca: Habilitant
ru: Включение

source: %(enable)s publisher %(name)s
ca: %(enable)s publicador %(name)s
ru: %(enable)s издатель %(name)s

source: Changing priority for publisher %s
ca: Canviant la prioritat pel publicador %s
ru: Изменение приоритета издателя %s

source: Updating
ru: Обновление

source: %(update)s publisher %(name)s
ru: %(update)s издатель %(name)s

source: Mirrors for a secure publisher need to begin with https://
ca: Les rèpliques per a publicadors segurs necessiten començar amb https://
ru: Адреса зеркал защищенного издателя должны начинаться с https://

source: Origins for a secure publisher need to begin with https://
ca: Els orígens per a publicadors segurs necessiten començar amb https://
ru: Адреса источников защищенного издателя должны начинаться с https://

source: URI already added
ca: La URI ja ha estat afegida
ru: Идентификатор URI уже добавлен

source: Applying Changes
ca: Aplicant canvis
ru: Применение изменений

source: Origin:
ca: Origen:
ru: Источник:

source: Publisher error
ca: Error publicador
ru: Ошибка издателя

source: Specify SSL Key File
ca: Especificar fitxer de clau SSL
ru: Укажите файл ключей SSL

source: Specify SSL Certificate File
ca: Especificar fitxer de certificat SSL
ru: Укажите файл сертификатов SSL

source: URI is not valid
ca: La URI no és vàlida
ru: Недействительный идентификатор URI

source: SSL should not be specified
ca: S'ha d'especificar SSL
ru: Не требуется указывать SSL

source: SSL Key not found at specified location
ca: No s'ha trobat la clau SSL a la localització especificada
ru: В указанном местоположении не найден ключ SSL

source: SSL Certificate not found at specified location
ca: No s'ha trobat el certificat SSL a la localització especificada
ru: В указанном местоположении не найден сертификат SSL

source: Mirror URI
ca: URI rèplica
ru: URI зеркала

source: Enabling Publisher
ca: Habilitar publicador
ru: Включение издателя

source: Disabling Publisher
ca: Deshabilitant publicador
ru: Отключение издателя

source: Loading... %s
ca: Carregant... %s
ru: Загрузка... %s

source: Stopped
ca: Parat
ru: Остановлено

source: View packages in %(s1)s%(pub)s%(e1)s
ca: Visualitzar paquets en %(s1)s%(pub)s%(e1)s
ru: Просмотр пакетов в %(s1)s%(pub)s%(e1)s

source: Go to Search %(s1)sAll Publishers%(e1)s page
ru: Перейти к странице поиска по %(s1)sВсе издатели%(e1)s

source: Search within %(s1)sAll Publishers%(e1)s
ca: Cercar dins %(s1)sTots els publicadors%(e1)s
ru: Поиск по %(s1)sВсе издатели%(e1)s

source: View %(s1)sAll Installed Packages%(e1)s
ru: Просмотреть %(s1)sВсе установленные пакеты%(e1)s

source: Display %(s1)sSearch Help%(e1)s
ca: Mostrar l'%(s1)sAjuda de la cerca%(e1)s
ru: Отобразить %(s1)sСправка по поиску%(e1)s

source: Loading %(s1)sSearch Help%(e1)s ...
ca: Carregant l'%(s1)sAjuda de la cerca%(e1)s ...
ru: Загрузка %(s1)sСправка по поиску%(e1)s...

source: View results for %s
ca: Visualitzar els resultats per %s
ru: Просмотр результатов для %s

source: Change View to %(s1)sAll Packages%(e1)s
ca: Canviar vista a %(s1)sTots els paquets%(e1)s
ru: Изменить вид на %(s1)sВсе пакеты%(e1)s

source: No URI specified
ca: No s'ha especificat cap URI
ru: Идентификатор URI не указан

source: Empty Action not supported
ca: Acció buida no suportada
ru: Пустые действия не поддерживаются

source: Action not supported: %s
ca: Acció no suportada: %s
ru: Действие не поддерживается: %s

source: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Search All Publishers</b></h3><TD></TD></TR><TR><TD></TD><TD> Use the Search field to search for packages within the following Publishers:</TD></TR>
ca: alt='[Informació]' title='Informació' ALIGN='bottom'></TD><TD><h3><b>Cercar a tors els publicadors</b></h3><TD></TD></TR><TR><TD></TD><TD> Utilitzeu el camp de cerca per cercar paquets dins dels següents publicadors:</TD></TR>
ru: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Поиск по всем издателям</b></h3><TD></TD></TR><TR><TD></TD><TD> Используйте поле поиска для выполнения поиска пакетов по следующим издателям:</TD></TR>

source: <TR><TD></TD><TD></TD></TR><TR><TD></TD><TD>Click on the Publishers below to view their list of packages:</TD></TR>
ca: <TR><TD></TD><TD></TD></TR><TR><TD></TD><TD>Clique en els següents publicadors per a visualitzar el seu llistat de paquets:</TD></TR>
ru: <TR><TD></TD><TD></TD></TR><TR><TD></TD><TD>Нажмите находящуюся ниже кнопку "Издатели" для просмотра списка пакетов этих издателей:</TD></TR>

source: <TR><TD></TD><TD></TD></TR><TR><TD></TD><TD>Click on the link below to view the full list of packages:</TD></TR>
ru: <TR><TD></TD><TD></TD></TR><TR><TD></TD><TD>Щелкните ссылку, расположенную ниже, для просмотра полного списка пакетов:</TD></TR>

source: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Search in All Installed Packages</b></h3><TD></TD></TR><TR><TD></TD><TD> Search is <b>not</b> supported in All Installed Packages.</TD></TR>
ru: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Поиск во всех установленных пакетах</b></h3><TD></TD></TR><TR><TD></TD><TD> Поиск <b>не</b> поддерживается во всех установленных пакетах.</TD></TR>

source: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Suggestions:</b><br></TD></TR><TR><TD></TD><TD<TD>
ca: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Suggeriments:</b><br></TD></TR><TR><TD></TD><TD<TD>
ru: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Предложения:</b><br></TD></TR><TR><TD></TD><TD<TD>

source: <li style='padding-left:7px'>Return to view All Installed Packages <a href='pm?pm-action=internal&search=%s'>(Installed)</a></li>
ru: <li style='padding-left:7px'>Перейдите к просмотру всех установленных пакетов <a href='pm?pm-action=internal&search=%s'>(установлено)</a></li>

source: <li style='padding-left:7px'>Search for <b>%(text)s</b> using All Publishers <a href='pm?pm-action=internal&search=%(all_pubs)s'>(Search)</a></li>
ca: <li style='padding-left:7px'>Cercar <b>%(text)s</b> utilitzant tots els publicadors<a href='pm?pm-action=internal&search=%(all_pubs)s'>(Cerca)</a></li>
ru: <li style='padding-left:7px'>Поиск <b>%(text)s</b> в режиме "Все издатели" <a href='pm?pm-action=internal&search=%(all_pubs)s'>(поиск)</a></li>

source: <li style='padding-left:7px'>See <a href='pm?pm-action=internal&search=%s'>Search Help</a></li></TD></TR>
ca: <li style='padding-left:7px'>Vegeu l'<a href='pm?pm-action=internal&search=%s'>Ajuda de la cerca</a></li></TD></TR>
ru: <li style='padding-left:7px'>См. <a href='pm?pm-action=internal&search=%s'>Справка по поиску</a></li></TD></TR>

source: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Search Results</b></h3><TD></TD></TR><TR><TD></TD><TD>No packages found in <b>%(pub)s</b> matching <b>%(text)s</b></TD></TR>
ca: alt='[Informació]' title='Informació' ALIGN='bottom'></TD><TD><h3><b>Resultats de la cerca</b></h3><TD></TD></TR><TR><TD></TD><TD>No s'ha trobat cap paquet en <b>%(pub)s</b> que coincideixi amb <b>%(text)s</b></TD></TR>
ru: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Результаты поиска</b></h3><TD></TD></TR><TR><TD></TD><TD>Не найдены пакеты в <b>%(pub)s</b>, соответствующие <b>%(text)s</b></TD></TR>

source: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Suggestions:</b><br></TD></TR><TR><TD></TD><TD<TD><li style='padding-left:7px'>Check your spelling</li><li style='padding-left:7px'>Try new search terms</li>
ca: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Suggeriments:</b><br></TD></TR><TR><TD></TD><TD<TD><li style='padding-left:7px'>Comproveu que ho hageu escrit correctament</li><li style='padding-left:7px'>Provar amb nous termes de cerca</li>
ru: <TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD></TD></TR><TR><TD></TD><TD<TD><b>Предложения:</b><br></TD></TR><TR><TD></TD><TD<TD><li style='padding-left:7px'>Выполните проверку на орфографические ошибки</li><li style='padding-left:7px'>Попробуйте новые условия поиска</li>

source: <li style='padding-left:7px'>Search for <b>%(text)s</b> within <a href='pm?pm-action=internal&search=%(all_pubs)s'>All Publishers</a></li>
ca: <li style='padding-left:7px'>Cercar <b>%(text)s</b> dins <a href='pm?pm-action=internal&search=%(all_pubs)s'>Tots els publicadors</a></li>
ru: <li style='padding-left:7px'>Поиск <b>%(text)s</b> по <a href='pm?pm-action=internal&search=%(all_pubs)s'>Все издатели</a></li>

source: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Recent Searches</b></h3><TD></TD></TR><TR><TD></TD><TD> Access stored results from recent searches in this session.</TD></TR>
ca: alt='[Informació]' title='Informació' ALIGN='bottom'></TD><TD><h3><b>Cerques recents</b></h3><TD></TD></TR><TR><TD></TD><TD> Accessos emmagatzemats des de les cerques recents en aquesta sessió.</TD></TR>
ru: alt='[Сведения]' title='Сведения' ALIGN='bottom'></TD><TD><h3><b>Недавние результаты поиска</b></h3><TD></TD></TR><TR><TD></TD><TD> Доступ к сохраненным результатам поиска, полученным за текущий сеанс.</TD></TR>

source: results
ca: resultats
ru: результаты

source: Click on the search results link below to view the stored results:
ca: Cliqueu al següent enllaç de resultats de cerca per a visualitzar els resultats emmagatzemats:
ru: Щелкните ссылку на результаты поиска ниже для просмотра сохраненных результатов:

source: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>View Packages</b></h3><TD></TD></TR><TR><TD></TD><TD>
ca: alt='[Informació]' title='Informació' ALIGN='bottom'></TD><TD><h3><b>Visualitzar paquets</b></h3><TD></TD></TR><TR><TD></TD><TD>
ru: alt='[Сведения]' title='Сведения' ALIGN='bottom'></TD><TD><h3><b>Просмотр пакетов</b></h3><TD></TD></TR><TR><TD></TD><TD>

source: There is one package in this category, however it is not visible in the selected View: <li style='padding-left:7px'><b>%s</b></li>
ca: Hi ha un paquet en aquesta categoria, tanmateix no és visible en la vista seleccionada: <li style='padding-left:7px'><b>%s</b></li>
ru: В этой категории имеется один пакет, однако он не отображается в выбранном режиме просмотра: <li style='padding-left:7px'><b>%s</b></li>

source: <li style='padding-left:7px'><a href='pm?pm-action=internal&search=%s'>Change View to All Packages</a></li>
ca: <li style='padding-left:7px'><a href='pm?pm-action=internal&search=%s'>Canviar la vista a tots els paquets</a></li>
ru: <li style='padding-left:7px'><a href='pm?pm-action=internal&search=%s'>Переход в режим просмотра "Все пакеты"</a></li>

source: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Search Results</b></h3><TD></TD></TR><TR><TD></TD><TD>
ca: alt='[Informació]' title='Informació' ALIGN='bottom'></TD><TD><h3><b>Resultats de la cerca</b></h3><TD></TD></TR><TR><TD></TD><TD>
ru: alt='[Information]' title='Information' ALIGN='bottom'></TD><TD><h3><b>Результаты поиска</b></h3><TD></TD></TR><TR><TD></TD><TD>

source: Found <b>%(num)s</b> package matching <b>%(text)s</b> in All Packages, however it is not listed in the <b>%(filter)s</b> View.
ca: Trobat <b>%(num)s</b> paquet que coincideix <b>%(text)s</b> en tots els paquets, tanmateix no és llistat a la vista <b>%(filter)s</b>.
ru: Найден пакет <b>%(num)s</b>, соответствующий <b>%(text)s</b> во всех пакетах, однако отсутствующий в виде <b>%(filter)s</b>.
