<!-- Fragment document type declaration subset:
Arbortext, Inc., 1988-2008, v.4002
<!DOCTYPE SOLBOOK PUBLIC "-//Sun Microsystems//DTD SolBook 3.5//EN" [
<!ENTITY fr-other-trademarks SYSTEM "fr-other-trademarks.sgm">
<!ENTITY sun-trademarks SYSTEM "sun-trademarks.sgm">
]>
-->
<?Pub EntList bull rArr sect>
<?Pub CX solbook(helpset(title()helpinfo(authorgroup()pubsnumber()releaseinfo()pubdate()publisher()copyright()legalnotice(para()>
<!-- @(#)fr-legal.sgm 1.16 05/09/22 SMI; read only legal wrapper --><?Pub
Caret><para lang="fr"></para><!--&auml;&agrave;--><para>Sun Microsystems,
Inc. d&eacute;tient les droits de propri&eacute;t&eacute; intellectuelle relatifs &agrave;
la technologie incorpor&eacute;e dans le produit qui est d&eacute;crit dans
ce document. En particulier, et ce sans limitation, ces droits de propri&eacute;t&eacute;
intellectuelle peuvent inclure un ou plusieurs brevets am&eacute;ricains ou
des applications de brevet en attente aux Etats-Unis et dans d'autres pays.</para><para>
Cette distribution peut comprendre des composants d&eacute;velopp&eacute;s
par des tierces personnes.</para><para>Certaines composants de ce produit
peuvent &ecirc;tre d&eacute;riv&eacute;es du logiciel Berkeley BSD, licenci&eacute;s
par l'Universit&eacute; de Californie. UNIX est une marque d&eacute;pos&eacute;e
aux Etats-Unis et dans d'autres pays; elle est licenci&eacute;e exclusivement
par X/Open Company, Ltd. </para><para>Sun, Sun Microsystems, le logo Sun,
le logo Solaris, le logo Java Coffee Cup, docs.sun.com, &sun-trademarks; Java
et Solaris sont des marques de fabrique ou des marques d&eacute;pos&eacute;es
de Sun Microsystems, Inc., ou ses filiales, aux Etats-Unis et dans d'autres
pays. Toutes les marques SPARC sont utilis&eacute;es sous licence et sont
des marques de fabrique ou des marques d&eacute;pos&eacute;es de SPARC International,
Inc. aux Etats-Unis et dans d'autres pays. Les produits portant les marques
SPARC sont bas&eacute;s sur une architecture d&eacute;velopp&eacute;e par
Sun Microsystems, Inc. &fr-other-trademarks;</para><para>L'interface d'utilisation
graphique OPEN LOOK et <trademark>Sun</trademark> a &eacute;t&eacute; d&eacute;velopp&eacute;e
par Sun Microsystems, Inc. pour ses utilisateurs et licenci&eacute;s. Sun
reconna&icirc;t les efforts de pionniers de Xerox pour la recherche et le
d&eacute;veloppement du concept des interfaces d'utilisation visuelle ou graphique
pour l'industrie de l'informatique. Sun d&eacute;tient une licence non exclusive
de Xerox sur l'interface d'utilisation graphique Xerox, cette licence couvrant &eacute;galement
les licenci&eacute;s de Sun qui mettent en place l'interface d'utilisation
graphique OPEN LOOK et qui, en outre, se conforment aux licences &eacute;crites
de Sun.</para><para>Les produits qui font l'objet de cette publication et
les informations qu'il contient sont r&eacute;gis par la legislation am&eacute;ricaine
en mati&egrave;re de contr&ocirc;le des exportations et peuvent &ecirc;tre
soumis au droit d'autres pays dans le domaine des exportations et importations.
Les utilisations finales, ou utilisateurs finaux, pour des armes nucl&eacute;aires,
des missiles, des armes chimiques ou biologiques ou pour le nucl&eacute;aire
maritime, directement ou indirectement, sont strictement interdites. Les exportations
ou r&eacute;exportations vers des pays sous embargo des Etats-Unis, ou vers
des entit&eacute;s figurant sur les listes d'exclusion d'exportation am&eacute;ricaines,
y compris, mais de mani&egrave;re non exclusive, la liste de personnes qui
font objet d'un ordre de ne pas participer, d'une fa&ccedil;on directe ou
indirecte, aux exportations des produits ou des services qui sont r&eacute;gis
par la legislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des
exportations et la liste de ressortissants sp&eacute;cifiquement design&eacute;s,
sont rigoureusement interdites.</para><para>LA DOCUMENTATION EST FOURNIE "EN
L'ETAT" ET TOUTES AUTRES CONDITIONS, DECLARATIONS ET GARANTIES EXPRESSES OU
TACITES SONT FORMELLEMENT EXCLUES, DANS LA MESURE AUTORISEE PAR LA LOI APPLICABLE,
Y COMPRIS NOTAMMENT TOUTE GARANTIE IMPLICITE RELATIVE A LA QUALITE MARCHANDE,
A L'APTITUDE A UNE UTILISATION PARTICULIERE OU A L'ABSENCE DE CONTREFACON. </para>
<?Pub *0000004289 0>
