Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: Before you install or update, check your Optional Components preference settings. Select the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> option. In the Preferences window, select the Optional Components tab. By default, Install all languages, Install all development files, and Install all documentation are selected. You can save space in your installation by selecting a subset of languages to install or deselecting development files, for example. Click the OK button to save your changes. These settings apply to all installed packages as well as future package installations and updates.
de: Überprüfen Sie vor dem Installieren oder Aktualisieren die Einstellungen unter 'Optionale Komponenten'. Wählen Sie die Option <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Einstellungen</guimenuitem></menuchoice>. Wählen Sie im Fenster "Einstellungen" die Registerkarte "Optionale Komponenten". Die Optionen "Alle Sprachen installieren", "Alle Entwicklungsdateien installieren" und "Alle Dokumentationen installieren" sind standardmäßig ausgewählt. Sie können Speicherplatz sparen, wenn Sie z. B. einen Teil der Sprachen auswählen oder die Auswahl der Entwicklungsdateien aufheben. Klicken Sie auf die Schaltfläche "OK", um die Änderungen zu speichern. Diese Einstellungen gelten für alle installierten Pakete und alle künftigen Paketinstallationen und -Updates.
es: Antes de realizar instalaciones o actualizaciones, verifique la configuración preferida de los Componentes opcionales. Seleccione la opción <menuchoice><guimenu>Editar</guimenu><guimenuitem>Preferencias</guimenuitem></menuchoice>. En la ventana Preferencias, seleccione la ficha Componentes opcionales. De manera predeterminada, las opciones Instalar todos los idiomas, Instalar todos los archivos de desarrollo e Instalar toda la documentación están seleccionadas. Puede ahorrar espacio en la instalación mediante la selección de un subconjunto de idiomas para instalar o anular la instalación de archivos de desarrollo, por ejemplo. Haga clic en el botón Aceptar para guardar los cambios. Esta configuración se aplica a todos los paquetes instalados y a futuras instalaciones y actualizaciones de paquetes.
ja: インストールまたは更新の前に、「オプションのコンポーネント」設定を確認します。<menuchoice><guimenu>「編集」</guimenu><guimenuitem>「設定」</guimenuitem></menuchoice>オプションを選択します。「設定」ウィンドウで「オプションのコンポーネント」タブを選択します。デフォルトでは、「すべての言語のインストール」、「すべての開発ファイルのインストール」、および「すべてのドキュメントのインストール」が選択されています。たとえば、一部の言語を選択してインストールしたり、開発ファイルの選択を解除したりすることで、インストールの領域を節約できます。「了解」ボタンをクリックして変更を保存します。これらの設定は、すべてのインストール済みパッケージおよび今後のパッケージのインストールと更新に適用されます。
ko: 설치 또는 업데이트 전에 선택적 구성 요소 기본 설정을 확인합니다. <menuchoice><guimenu>편집</guimenu><guimenuitem>기본 설정</guimenuitem></menuchoice> 옵션을 선택합니다. 기본 설정 창에서 선택적 구성 요소 탭을 선택합니다. 기본적으로 모든 언어 설치, 모든 개발 파일 설치 및 모든 설명서 설치가 선택되어 있습니다. 설치할 언어 중 일부만 선택하거나 개발 파일의 선택을 해제하는 등으로 설치 공간을 절약할 수 있습니다. 변경 사항을 저장하려면 확인 버튼을 누릅니다. 이러한 설정은 설치된 모든 패키지와 후속 패키지 설치 및 업데이트에 적용됩니다.
zh_hk: 在安裝或更新之前，請先檢查 [選擇性元件] 喜好設定。選取 <menuchoice>[<guimenu>編輯</guimenu>] [<guimenuitem>喜好設定</guimenuitem>]</menuchoice> 選項。在 [喜好設定] 視窗中，選取 [選擇性元件] 標籤。預設會選取安裝所有語言、安裝所有開發檔案，以及安裝所有文件。例如，您可以選取要安裝的語言子集或取消選取開發檔案，以節省安裝所需空間。按一下 [確定] 按鈕即可儲存您的變更。這些設定會套用到所有已安裝的套裝軟體以及未來的套裝軟體安裝與更新。

source: Perform the following steps to install or update a package:
de: Führen Sie die folgenden Schritte aus, um ein Paket zu installieren oder zu aktualisieren:
es: Para instalar o actualizar un paquete, realice los siguientes pasos:
ja: パッケージをインストールまたは更新するには、次の手順を実行します。
ko: 패키지를 설치 또는 업데이트하려면 다음 단계를 수행합니다.
zh_hk: 執行下列步驟可以安裝或更新套裝軟體：

source: Select the package. See <xref linkend="select-pkg"/>.
de: Wählen Sie das Paket aus. Weitere Informationen finden Sie unter <xref linkend="select-pkg"/>.
es: Seleccione el paquete. Consulte <xref linkend="select-pkg"/>.
ja: パッケージを選択します。<xref linkend="select-pkg"/>を参照してください。
ko: 패키지를 선택합니다. <xref linkend="select-pkg"/>을 참조하십시오.
zh_hk: 選取套裝軟體。請參閱 <xref linkend="select-pkg"/>。

source: Use one of the following methods to install or update the package:
de: Wenden Sie eine der folgenden Methoden an, um das Paket zu installieren oder zu aktualisieren:
es: Utilice uno de los siguientes métodos para instalar o actualizar el paquete:
ja: パッケージをインストールまたは更新するには、次の方法のいずれかを使用します。
ko: 다음 방법 중 하나로 패키지를 설치 또는 업데이트합니다.
zh_hk: 使用下列其中一個方法來安裝或更新套裝軟體：

source: Select the <guibutton>Install/Update</guibutton> button in the tool bar.
de: Wählen Sie in der Symbolleiste die Schaltfläche <guibutton>Installation/Update</guibutton>.
es: Seleccione el botón <guibutton>Instalar/Actualizar</guibutton> ubicado en la barra de herramientas.
ja: ツールバーの<guibutton>「インストール/更新」</guibutton>ボタンをクリックします。
ko: 도구 모음에서 <guibutton>설치/업데이트</guibutton> 버튼을 선택합니다.
zh_hk: 選取工具列中的 [<guibutton>安裝/更新</guibutton>] 按鈕。

source: Select the <menuchoice><guimenu>Package</guimenu><guimenuitem>Install/Update</guimenuitem></menuchoice> option from the menu bar.
de: Wählen Sie in der Menüleiste die Option <menuchoice><guimenu>Paket</guimenu><guimenuitem>Installation/Update</guimenuitem></menuchoice>.
es: Seleccione la opción <menuchoice><guimenu>Paquete</guimenu><guimenuitem>Instalar/Actualizar</guimenuitem></menuchoice> de la barra de menú.
ja: メニューバーから<menuchoice><guimenu>「パッケージ」</guimenu><guimenuitem>「インストール/更新」</guimenuitem></menuchoice>オプションを選択します。
ko: 메뉴 표시줄에서 <menuchoice><guimenu>패키지</guimenu><guimenuitem>설치/업데이트</guimenuitem></menuchoice> 옵션을 선택합니다.
zh_hk: 從功能表列選取 <menuchoice>[<guimenu>套裝軟體</guimenu>] [<guimenuitem>安裝/更新</guimenuitem>]</menuchoice> 選項。

source: Click your right mouse button on the name of a package to display the pop-up <guimenu>Package</guimenu> menu. Then select the <guimenuitem>Install/Update</guimenuitem> option.
de: Klicken Sie mit der rechten Maustaste auf den Namen des Pakets, um das Popup-Menü <guimenu>Paket</guimenu> anzuzeigen. Wählen Sie dann die Option <guimenuitem>Installation/Update</guimenuitem>.
es: Haga clic con el botón derecho del mouse en el nombre de un paquete para mostrar el menú emergente <guimenu>Paquete</guimenu>. Luego, seleccione la opción <guimenuitem>Instalar/Actualizar</guimenuitem>.
ja: パッケージ名をマウスの右ボタンでクリックして<guimenu>「パッケージ」</guimenu>メニューをポップアップ表示します。次に、<guimenuitem>「インストール/更新」</guimenuitem>オプションを選択します。
ko: 패키지 이름을 마우스 오른쪽 버튼으로 눌러 팝업 <guimenu>패키지</guimenu> 메뉴를 표시합니다. 그런 다음 <guimenuitem>설치/업데이트</guimenuitem> 옵션을 선택합니다.
zh_hk: 在套裝軟體名稱上按一下滑鼠右鍵，以顯示 [<guimenu>套裝軟體</guimenu>] 快顯功能表。然後選取 [<guimenuitem>安裝/更新</guimenuitem>] 選項。

source: On the Versions tab in the package details pane below the package list pane, select a version from the Version to Install list and click the <guibutton>Install/Update</guibutton> button to the right of the list. The packages in the Version to Install list are available in the repository; they might not be installable. A particular version might not be compatible with other packages that you have installed. If the version that you select is not installable on your system, Package Manager warns you and does not install the package.
de: Wählen Sie im Paketinformationsbereich unterhalb des Paketlistenbereichs auf der Registerkarte "Versionen" in der Liste "Zu installierende Version" eine Version aus, und klicken Sie rechts neben der Liste auf die Schaltfläche <guibutton>Installation/Update</guibutton>. Die in der Liste "Zu installierende Version" aufgeführten Versionen sind im Repository verfügbar und sind möglicherweise nicht installierbar. Eine bestimmte Version ist u. U. nicht mit anderen bereits installierten Paketen kompatibel. Wenn die ausgewählte Version nicht auf Ihrem System installiert werden kann, zeigt der Package Manager eine Warnung an und installiert nicht das Paket.
es: En la ficha Versiones, en el panel de detalles del paquete debajo del panel de la lista de paquetes, seleccione una versión de la lista Versión para instalar y haga clic en el botón <guibutton>Instalar/Actualizar</guibutton> que se encuentra a la derecha de la lista. Los paquetes de la lista Versión para instalar están disponibles en el depósito y es posible que no sean instalables. Es posible que una versión en particular no sea compatible con otros paquetes que haya instalado. Si la versión seleccionada no es instalable en su sistema, Package Manager se lo advertirá y no instalará el paquete.
ja: パッケージリスト区画の下にあるパッケージの詳細区画の「バージョン」タブで、「インストールするバージョン」リストからバージョンを選択し、リストの右にある<guibutton>「インストール/更新」</guibutton>ボタンをクリックします。「インストールするバージョン」リストのパッケージはリポジトリで使用可能なものですが、インストール可能でない場合もあります。特定のバージョンに、インストール済みのほかのパッケージとの互換性がないこともあります。選択したバージョンがシステムにインストール可能でない場合、パッケージマネージャーで警告が表示され、そのパッケージはインストールされません。
ko: 패키지 목록 창 아래쪽 패키지 세부 정보 창에 있는 버전 탭의 설치할 버전 목록에서 버전을 선택하고 목록 오른쪽에 있는 <guibutton>설치/업데이트</guibutton> 버튼을 누릅니다. 저장소에서 설치할 버전 목록의 패키지를 사용할 수 있지만 설치하지 못할 수 있습니다. 특정 버전은 설치된 다른 패키지와 호환되지 않을 수 있습니다. 선택한 버전을 시스템에 설치할 수 없을 경우 패키지 관리자가 경고 메시지를 표시하고 패키지를 설치하지 않습니다.
zh_hk: 在套裝軟體清單窗格下方之套裝軟體詳細資訊窗格的 [版本] 標籤中，從 [要安裝的版本] 清單中選取一個版本，然後按一下清單右邊的 [<guibutton>安裝/更新</guibutton>] 按鈕。儲存庫中有 [要安裝的版本] 清單中的套裝軟體，但這些套裝軟體可能是無法安裝的。特定的版本可能與已安裝的其他套裝軟體不相容。如果您選取的版本無法在您的系統上安裝，套裝軟體管理員會提出警告而且不會安裝此套裝軟體。

source: If the package is already installed and does not have an update available (see the Status column or the <menuchoice><guimenu>Package</guimenu><guimenuitem>Package Version Info</guimenuitem></menuchoice> option), the <guibutton>Install/Update</guibutton> option is grayed out and not selectable.
de: Wenn das Paket bereits installiert ist und kein Update für dieses Paket verfügbar ist (siehe dazu Spalte "Status" oder Option <menuchoice><guimenu>Paket</guimenu><guimenuitem>Paket-Versionsinformationen</guimenuitem></menuchoice>), ist die Option <guibutton>Installation/Update</guibutton> ausgegraut und daher nicht auswählbar.
es: Si el paquete ya está instalado y no tiene una actualización disponible (consulte la columna Estado o la opción <menuchoice><guimenu>Paquete</guimenu><guimenuitem>Información de versión del paquete</guimenuitem></menuchoice>), la opción <guibutton>Instalar/Actualizar</guibutton> aparecerá en color gris y no se podrá seleccionar.
ja: パッケージがすでにインストールされている場合で、使用可能な更新が存在しないときは (「状態」列または<menuchoice><guimenu>「パッケージ」</guimenu><guimenuitem>「パッケージのバージョン情報」</guimenuitem></menuchoice>オプションを参照)、<guibutton>「インストール/更新」</guibutton>オプションはグレー表示され、選択不可になります。
ko: 패키지가 이미 설치되어 있으며 사용할 수 있는 업데이트가 없을 경우(상태 열 또는 <menuchoice><guimenu>패키지</guimenu><guimenuitem>패키지 버전 정보</guimenuitem></menuchoice> 옵션 참조) <guibutton>설치/업데이트</guibutton> 옵션이 비활성화되어 해당 옵션을 선택할 수 없습니다.
zh_hk: 如果已經安裝套裝軟體且沒有更新可用 (查看 [狀態] 資料欄或 <menuchoice>[<guimenu>套裝軟體</guimenu>] [<guimenuitem>套裝軟體版本資訊</guimenuitem>]</menuchoice> 選項)，[<guibutton>安裝/更新</guibutton>] 選項會變成灰色且無法選取。

source: The Install/Update Confirmation window is displayed. Packages that are not yet installed are listed in the Install Details pane, and packages that are installed are listed in the Update Details pane for you to review. Select the <guibutton>Proceed</guibutton> button to install or update the listed packages.
de: Das Fenster "Installation/Update - Bestätigung" wird angezeigt. Die noch nicht installierten Pakete werden im Bereich "Installationsdetails" aufgeführt. Bereits installierte Pakete werden im Bereich "Updatedetails" übersichtlich aufgeführt. Wählen Sie die Schaltfläche <guibutton>Fortfahren</guibutton>, um die aufgeführten Pakete zu installieren oder zu aktualisieren.
es: Aparece la ventana Confirmación de instalación/actualización. Los paquetes que todavía no se han instalado se muestran en el panel Detalles de instalación y los paquetes que están instalados se muestran en el panel Detalles de actualización para su revisión. Seleccione el botón <guibutton>Continuar</guibutton> para instalar o actualizar los paquetes mostrados.
ja: 「インストール/更新の確認」ウィンドウが表示されます。まだインストールされていないパッケージは「インストールの詳細」区画に一覧表示され、インストール済みのパッケージは「更新の詳細」区画に一覧表示されます。<guibutton>「続行」</guibutton>ボタンをクリックして、一覧表示されたパッケージをインストールまたは更新します。
ko: 설치/업데이트 확인 창이 표시됩니다. 검토를 위해 아직 설치되지 않은 패키지는 설치 세부 정보 창에 나열되며 설치된 패키지는 업데이트 세부 정보 창에 나열됩니다. <guibutton>진행</guibutton> 버튼을 선택하여 나열된 패키지를 선택 또는 업데이트합니다.
zh_hk: 會顯示 [安裝/更新確認] 視窗。尚未安裝的套裝軟體會列於 [安裝詳細資訊] 窗格中，已安裝的套裝軟體會列於 [更新詳細資訊] 窗格中供您檢視。選取 [<guibutton>繼續</guibutton>] 按鈕可安裝或更新所列的套裝軟體。

source: In some cases a license dialog is displayed and you must accept the license to install the package.
de: In manchen Fällen wird ein Dialogfeld zur Lizenz angezeigt, die Sie akzeptieren müssen, um das Paket zu installieren.
es: En algunos casos, se muestra un cuadro de diálogo de licencia, donde se debe aceptar la licencia para instalar el paquete.
ja: ライセンスダイアログが表示された場合、パッケージをインストールするにはライセンスに同意する必要があります。
ko: 라이센스 대화 상자가 표시되는 경우 패키지를 설치하려면 라이센스에 동의해야 합니다.
zh_hk: 在某些情況下，會顯示授權對話方塊，您必須接受授權才能安裝套裝軟體。

source: If an error occurs during package installation, an error dialog is displayed. Messages explain why the install or update failed.
de: Wenn während der Paketinstallation ein Fehler auftritt, wird ein Fehlerdialogfeld angezeigt. Der Grund für das Fehlschlagen der Installation bzw. des Updates wird in Meldungen beschrieben.
es: Si se produce un error durante la instalación del paquete, aparece un cuadro de diálogo de error. Los mensajes explican el motivo del error en la instalación o en la actualización.
ja: パッケージのインストール中にエラーが発生すると、エラーダイアログが表示されます。インストールまたは更新の失敗理由がエラーメッセージで示されます。
ko: 패키지를 설치하는 중 오류가 발생하면 오류 대화 상자가 표시됩니다. 메시지에는 설치 또는 업데이트 실패 원인이 설명됩니다.
zh_hk: 如果安裝套裝軟體時發生錯誤，則會顯示錯誤對話方塊。訊息會說明安裝或更新失敗的原因。

source: Removing Packages
de: Entfernen von Paketen
es: Eliminación de paquetes
ja: パッケージの削除
ko: 패키지 제거
zh_hk: 移除套裝軟體

source: Perform the following steps to remove a package:
ca: Realitzeu els següents pasos per a eliminar un paquet:
cs: Pro odstranění balíčku proveďte následující kroky:
de: Führen Sie zum Entfernen eines Pakets folgende Schritte aus:
es: Para eliminar un paquete, realice los pasos siguientes:
ja: パッケージを削除するには、次の手順を実行します。
ko: 다음 단계를 수행하여 패키지를 제거합니다.
ru: Для удаления пакета выполните следующие действия:
zh_hk: 執行下列步驟可以移除套裝軟體：

source: Use one of the following methods to remove the package:
de: Wenden Sie eine der folgenden Methoden an, um das Paket zu entfernen:
es: Utilice uno de los siguientes métodos para eliminar el paquete:
ja: パッケージを削除するには、次の方法のいずれかを使用します。
ko: 다음 방법 중 하나로 패키지를 제거합니다.
zh_hk: 使用下列其中一個方法來移除套裝軟體：

source: Select the <guibutton>Remove</guibutton> button in the tool bar.
de: Wählen Sie in der Symbolleiste die Schaltfläche <guibutton>Entfernen</guibutton>.
es: Seleccione el botón <guibutton>Eliminar</guibutton> ubicado en la barra de herramientas.
ja: ツールバーの<guibutton>「削除」</guibutton>ボタンをクリックします。
ko: 도구 모음에서 <guibutton>제거</guibutton> 버튼을 선택합니다.
zh_hk: 在工具列選取 [<guibutton>移除</guibutton>] 按鈕。

source: Select the <menuchoice><guimenu>Package</guimenu><guimenuitem>Remove</guimenuitem></menuchoice> option from the menu bar.
de: Wählen Sie in der Menüleiste die Option <menuchoice><guimenu>Paket</guimenu><guimenuitem>Entfernen</guimenuitem></menuchoice>.
es: Seleccione la opción <menuchoice><guimenu>Paquete</guimenu><guimenuitem>Eliminar</guimenuitem></menuchoice> de la barra de menú.
ja: メニューバーから<menuchoice><guimenu>「パッケージ」</guimenu><guimenuitem>「削除」</guimenuitem></menuchoice>オプションを選択します。
ko: 메뉴 표시줄에서 <menuchoice><guimenu>패키지</guimenu><guimenuitem>제거</guimenuitem></menuchoice> 옵션을 선택합니다.
zh_hk: 從功能表列選取 <menuchoice>[<guimenu>套裝軟體</guimenu>] [<guimenuitem>移除</guimenuitem>]</menuchoice> 選項。

source: Click your right mouse button on the name of a package to display the pop-up <guimenu>Package</guimenu> menu. Then select the <guimenuitem>Remove</guimenuitem> option.
de: Klicken Sie mit der rechten Maustaste auf den Namen des Pakets, um das Popup-Menü <guimenu>Paket</guimenu> anzuzeigen. Wählen Sie dann die Option <guimenuitem>Entfernen</guimenuitem>.
es: Haga clic con el botón derecho del mouse en el nombre de un paquete para mostrar el menú emergente <guimenu>Paquete</guimenu>. Luego, seleccione la opción <guimenuitem>Eliminar</guimenuitem>.
ja: パッケージ名をマウスの右ボタンでクリックして<guimenu>「パッケージ」</guimenu>メニューをポップアップ表示します。次に、<guimenuitem>「削除」</guimenuitem>オプションを選択します。
ko: 패키지 이름을 마우스 오른쪽 버튼으로 눌러 팝업 <guimenu>패키지</guimenu> 메뉴를 표시합니다. 그런 다음 <guimenuitem>제거</guimenuitem> 옵션을 선택합니다.
zh_hk: 在套裝軟體名稱上按一下滑鼠右鍵，以顯示 [<guimenu>套裝軟體</guimenu>] 快顯功能表。然後選取 [<guimenuitem>移除</guimenuitem>] 選項。

source: If the package is not installed, the Remove option is grayed out and not selectable.
de: Wenn das Paket nicht installiert ist, ist die Option "Entfernen" ausgegraut und nicht auswählbar.
es: Si el paquete no está instalado, la opción Eliminar aparecerá en color gris y no se podrá seleccionar.
ja: パッケージがインストールされていない場合、「削除」オプションはグレー表示され、選択不可になります。
ko: 패키지가 설치되지 않은 경우 제거 옵션이 비활성화되어 해당 옵션을 선택할 수 없습니다.
zh_hk: 如果您並未安裝該套裝軟體，[移除] 選項會變成灰色且無法選取。

source: The Remove Confirmation window is displayed. Packages to be removed are listed in the Remove Details pane for you to review. Select the <guibutton>Proceed</guibutton> button to remove the listed packages.
de: Das Fenster "Bestätigung für Entfernen" wird angezeigt. Die zu entfernenden Pakete werden im Fensterbereich "Entfernungsdetails" für Sie zum Überprüfen aufgeführt. Wählen Sie die Schaltfläche <guibutton>Fortfahren</guibutton>, um die aufgeführten Pakete zu entfernen.
es: Aparece la ventana Confirmación de eliminación. Los paquetes que se eliminarán se muestran en el panel Detalles de supresión para su revisión. Seleccione el botón <guibutton>Continuar</guibutton> para eliminar los paquetes mostrados.
ja: 「削除の確認」ウィンドウが表示されます。削除されるパッケージが確認のために「削除の詳細」区画に一覧表示されます。<guibutton>「続行」</guibutton>ボタンをクリックして、一覧表示されたパッケージを削除します。
ko: 제거 확인 창이 표시됩니다. 검토를 위해 제거할 패키지가 제거 세부 정보 창에 나열됩니다. <guibutton>진행</guibutton> 버튼을 선택하여 나열된 패키지를 제거합니다.
zh_hk: 會顯示 [移除確認] 視窗。要移除的套裝軟體會列在 [移除詳細資訊] 窗格中供您檢視。選取 [<guibutton>繼續</guibutton>] 按鈕，移除列出的套裝軟體。

source: If a package cannot be removed because other packages depend on it, you can select the <guibutton>Remove Continue</guibutton> option to attempt to remove any remaining packages that you originally selected for removal.
de: Wenn ein Paket nicht entfernt werden kann, weil andere Pakete von diesem abhängig sind, können Sie die Option <guibutton>Entfernen fortsetzen</guibutton>, um zu versuchen, die übrigen Pakete zu entfernen, die Sie ursprünglich zum Entfernen ausgewählt hatten.
es: Si un paquete no se puede eliminar porque otros paquetes dependen de él, puede seleccionar la opción <guibutton>Eliminar continuación</guibutton> para intentar eliminar cualquier paquete restante que usted haya seleccionado originalmente para eliminar.
ja: あるパッケージにほかのパッケージが依存しているためそのパッケージを削除できない場合、<guibutton>「削除の続行」</guibutton>オプションを選択すると、削除対象として最初に選択した残りのパッケージの削除を試みることができます。
ko: 다른 패키지가 종속되어 있어 패키지를 제거할 수 없을 경우 <guibutton>제거 계속</guibutton> 옵션을 선택하여 원래 제거 대상으로 선택한 나머지 패키지를 모두 제거할 수 있습니다.
zh_hk: 如果某套裝軟體因其他套裝軟體依賴它而無法移除，您可以選取 [<guibutton>繼續移除</guibutton>] 選項，嘗試移除原先選取要移除的所有其餘套裝軟體。

source: Updating Your System
de: Aktualisieren des Systems
es: Actualización del sistema
ja: システムの更新
ko: 시스템 업데이트
zh_hk: 更新您的系統

source: When certain key packages such as some drivers and other kernel components are updated, the system performs the following actions:
de: Wenn bestimmte Schlüsselpakete (z. B. manche Treiber und andere Kernel-Komponenten) aktualisiert werden, werden auf dem System folgende Aktionen ausgeführt:
es: Cuando determinados paquetes clave, como algunos controladores y otros componentes de núcleo, se actualizan, el sistema realiza las siguientes acciones:
ja: 一部のドライバやカーネルコンポーネントなど、特定の主要パッケージが更新されると、システムでは次の処理が実行されます。
ko: 중요한 특정 패키지(예: 일부 드라이버 및 기타 커널 구성 요소)가 업데이트되면 시스템에서 다음 작업을 수행합니다.
zh_hk: 更新某些重要套裝軟體 (例如部分驅動程式和其他核心元件) 時，系統會執行下列動作：

source: Creates a clone of the current boot environment (BE).
de: Erstellt einen Klon der aktuellen Boot-Umgebung (BU).
es: Crea una clonación del entorno de inicio actual.
ja: 現在のブート環境 (BE) のクローンを作成します。
ko: 현재 BE(부트 환경)의 복제본을 만듭니다.
zh_hk: 建立目前啟動環境 (BE) 的複製。

source: Updates the packages in the clone, and does not update any packages in the current BE.
de: Aktualisiert die Pakete im Klon. Pakete in der aktuellen BU werden nicht aktualisiert.
es: Actualiza los paquetes de la clonación, pero no actualiza ningún paquete del entorno de inicio actual.
ja: 現在の BE 内のパッケージは更新せずに、クローン内のパッケージを更新します。
ko: 복제본의 패키지는 업데이트하고 현재 BE의 패키지는 업데이트하지 않습니다.
zh_hk: 更新複製中的套裝軟體，但不要更新目前 BE 中的任何套裝軟體。

source: Sets the new BE to be the default boot choice the next time the system is rebooted. The current BE remains as an alternate boot choice.
de: Legt die neue BU als Standard-Boot-Option für den nächsten Systemneustart fest. Die aktuelle BU bleibt als alternative Boot-Option bestehen.
es: Configura el nuevo entorno de inicio para que sea la opción de inicio predeterminada la próxima vez que se reinicia el sistema. El entorno de inicio actual sigue siendo una opción de inicio alternativa.
ja: システムの次回リブート時にこの新しい BE がデフォルトでブートされるように設定します。現在の BE は代替ブート環境として残ります。
ko: 다음 번에 시스템이 재부트될 때 새 BE가 기본 부트 옵션으로 지정되도록 설정합니다. 현재 BE는 대체 부트 옵션으로 유지됩니다.
zh_hk: 將新的 BE 設定為下次系統重新開機時的預設啟動選項。而目前的 BE 仍為替代的啟動選項。

source: Updating All Packages
de: Aktualisieren aller Pakete
es: Actualización de todos los paquetes
ja: すべてのパッケージの更新
ko: 모든 패키지 업데이트
zh_hk: 更新所有套裝軟體

source: When you select the <guibutton>Updates</guibutton> button in the tool bar or the <menuchoice><guimenu>Package</guimenu><guimenuitem>Updates</guimenuitem></menuchoice> menu option, Package Manager updates all installed packages that have updates available.
de: Wenn Sie in der Symbolleiste die Schaltfläche <guibutton>Updates</guibutton> auswählen oder die Menüoption <menuchoice><guimenu>Paket</guimenu><guimenuitem>Updates</guimenuitem></menuchoice> wählen, aktualisiert der Package Manager alle installierten Pakete, für die Updates verfügbar sind.
es: Cuando selecciona el botón <guibutton>Actualizaciones</guibutton> en la barra de herramientas o la opción de menú <menuchoice><guimenu>Paquete</guimenu><guimenuitem>Actualizaciones</guimenuitem></menuchoice>, Package Manager actualiza todos los paquetes instalados que tienen actualizaciones disponibles.
ja: ツールバーの<guibutton>「更新」</guibutton>ボタンまたは<menuchoice><guimenu>「パッケージ」</guimenu><guimenuitem>「更新」</guimenuitem></menuchoice>メニューオプションを選択すると、使用可能な更新が存在するインストール済みパッケージがすべて更新されます。
ko: 도구 모음의 <guibutton>업데이트</guibutton> 버튼 또는 <menuchoice><guimenu>패키지</guimenu><guimenuitem>업데이트</guimenuitem></menuchoice> 메뉴 옵션을 선택하면 패키지 관리자가 업데이트를 사용할 수 있는 설치된 모든 패키지를 업데이트합니다.
zh_hk: 在工具列選取 [<guibutton>更新</guibutton>] 按鈕，或選取 <menuchoice>[<guimenu>套裝軟體</guimenu>] [<guimenuitem>更新</guimenuitem>]</menuchoice> 功能表選項時，套裝軟體管理員會更新有可用更新的所有已安裝套裝軟體。
