Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: A boot environment (BE) is a bootable image. You can maintain multiple BEs on your Oracle Solaris system. One BE is the default BE at startup or reboot. Other BEs are available as alternate boot selections. The BE you are booted into is the active BE.
de: Eine Boot-Umgebung (BU) ist ein bootfähiges Abbild. Sie können mehrere BUs auf Ihrem Oracle Solaris-System verwalten. Eine BU ist die Standard-BU beim Systemstart oder Neustart. Die anderen BUs sind als alternative Boot-Optionen verfügbar. Die BU, die Sie starten, ist die aktive BU.
es: Un entorno de inicio es una imagen de inicio. Puede mantener varios entornos de inicio en su sistema Oracle Solaris. Un entorno de inicio es el entorno de inicio predeterminado al iniciar o reiniciar. Otros entornos de inicio están disponibles como selecciones de inicio alternativas. El entorno de inicio iniciado es el entorno de inicio activo.
ja: ブート環境 (BE) はブート可能なイメージです。Oracle Solaris システムに複数の BE を維持することができます。1 つの BE は、起動時またはリブート時のデフォルトの BE です。ほかの BE は代替ブート環境として使用可能です。ブートした BE がアクティブ BE です。
ko: BE(부트)는 부트 가능 이미지입니다. Oracle Solaris 시스템에서 여러 개의 BE를 유지 관리할 수 있습니다. 하나의 BE가 시작 또는 재부트 시 기본 BE로 사용되며, 다른 BE는 대체 부트 옵션으로 제공됩니다. 부트한 BE가 활성 BE입니다.
zh_hk: 啟動環境 (BE) 是可啟動的影像。您可以在 Oracle Solaris 系統上維護多個 BE。其中一個 BE 會是啟動或重新開機時使用的預設 BE。其他 BE 則為替代的啟動選項。您啟動的 BE 即為使用中 BE。

source: You can use the <literal>beadm</literal>(1) command to create, rename, mount, unmount, activate, or destroy BEs. For complete information about BEs, see <citetitle>Creating and Managing Boot Environments After Installation</citetitle>.
de: Sie können den Befehl <literal>beadm</literal>(1) verwenden, um BUs zu erstellen, umzubenennen, einzuhängen, auszuhängen, zu aktivieren oder zu entfernen. Ausführliche Informationen zu BUs finden Sie unter <citetitle>Erstellen und Verwalten von Boot-Umgebungen nach der Installation</citetitle>.
es: Puede utilizar el comando <literal>beadm</literal>(1) para crear, renombrar, montar, desmontar, activar o destruir entornos de inicio. Para obtener más información sobre entornos de inicio, consulte <citetitle>Creación y gestión de entornos de inicio después de la instalación</citetitle>.
ja: <literal>beadm</literal>(1) コマンドを使用して、BE の作成、名前の変更、マウント、マウント解除、アクティブ化、または破棄を行うことができます。BE の詳細については、『<citetitle>Creating and Managing Boot Environments After Installation</citetitle>』を参照してください。
ko: <literal>beadm</literal>(1) 명령을 사용하여 BE를 만들거나, 마운트, 마운트 해제, 활성화 또는 삭제하거나 이름을 바꿀 수 있습니다. BE에 대한 자세한 내용은 <citetitle>Creating and Managing Boot Environments After Installation</citetitle>를 참조하십시오.
zh_hk: 您可以使用 <literal>beadm</literal>(1) 指令來建立、重新命名、掛載、卸載、啟用或銷毀 BE。如需有關 BE 的完整資訊，請參閱「<citetitle>Creating and Managing Boot Environments After Installation</citetitle>」。

source: Package Manager provides a subset of the functionality that the <literal>beadm</literal>(1) command provides. Use the Package Manager <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Boot Environments</guimenuitem></menuchoice> option to open the Manage Boot Environments window. The Manage Boot Environments window lists the BEs on this system and enables you to activate, rename, and delete those BEs as described below.
de: Der Package Manager stellt einen Teil der Funktionen bereit, die der Befehl <literal>beadm</literal>(1) umfasst. Verwenden Sie die Package Manager-Option <menuchoice><guimenu>Datei</guimenu><guimenuitem>Boot-Umgebungen verwalten</guimenuitem></menuchoice>, um das Fenster "Boot-Umgebungen verwalten" zu öffnen. Im Fenster 'Boot-Umgebungen verwalten' werden die BUs auf diesem System aufgeführt. In diesem Fenster können Sie diese BUs, wie nachstehend beschrieben, aktivieren, umbenennen und löschen.
es: Package Manager proporciona un subconjunto de la funcionalidad que proporciona el comando <literal>beadm</literal>(1). Utilice la opción <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Administrar entornos de arranque</guimenuitem></menuchoice> de Package Manager para abrir la ventana Administrar entornos de arranque. La ventana Administrar entornos de arranque muestra los entornos de inicio de este sistema y le permite activar, renombrar y suprimir entornos de inicio como se describe a continuación.
ja: パッケージマネージャーでは、<literal>beadm</literal>(1) コマンドで提供されている機能の一部を実行できます。パッケージマネージャーの<menuchoice><guimenu>「ファイル」</guimenu><guimenuitem>「ブート環境の管理」</guimenuitem></menuchoice>オプションを使用して、「ブート環境の管理」ウィンドウを開きます。「ブート環境の管理」ウィンドウでは、このシステムの BE が一覧表示され、これらの BE のアクティブ化、名前の変更、および削除を後述の方法で行うことができます。
ko: 패키지 관리자는 <literal>beadm</literal>(1) 명령이 제공하는 기능 중 일부를 제공합니다. 패키지 관리자 <menuchoice><guimenu>파일</guimenu><guimenuitem>부트 환경 관리</guimenuitem></menuchoice> 옵션을 사용하여 부트 환경 관리 창을 열 수 있습니다. 부트 환경 관리 창에는 이 시스템의 BE가 나열되며 이 창에서 아래 설명된 대로 해당 BE를 활성화 및 삭제하고 이름을 바꿀 수 있습니다.
zh_hk: 套裝軟體管理員可提供您 <literal>beadm</literal>(1) 指令所提供的功能子集。使用套裝軟體管理員 <menuchoice>[<guimenu>檔案</guimenu>] [<guimenuitem>管理啟動環境</guimenuitem>]</menuchoice> 選項，開啟 [管理啟動環境] 視窗。[管理啟動環境] 視窗會列出此系統上的 BE，讓您可以啟用、重新命名及刪除這些 BE (如下所述)。

source: Creating a BE
de: Erstellen einer BU
es: Creación de un entorno de inicio
ja: BE の作成
ko: BE 만들기
zh_hk: 建立 BE

source: A new BE is automatically created when you do one of the following actions:
de: Eine neue BU wird automatisch erstellt, wenn Sie eine der folgenden Aktionen ausführen:
es: Se crea un nuevo entorno de inicio de manera automática cuando realiza una de las siguientes acciones:
ja: 次のいずれかの操作を実行すると、新しい BE が自動的に作成されます。
ko: 다음 작업 중 하나를 수행하면 새 BE가 자동으로 만들어집니다.
zh_hk: 執行下列其中一個動作時，會自動建立新的 BE：

source: Install the Oracle Solaris OS.
de: Installieren Sie das Betriebssystem Oracle Solaris.
es: Instala el sistema operativo Oracle Solaris.
ja: Oracle Solaris OS をインストールします。
ko: Oracle Solaris OS를 설치합니다.
zh_hk: 安裝 Oracle Solaris 作業系統。

source: Install or update particular key system packages such as some drivers and other kernel components.
de: Installieren oder aktualisieren Sie Schlüsselsystempakete wie manche Treiber und andere Kernel-Komponenten.
es: Instala o actualiza paquetes de sistema clave, como algunos controladores y otros componentes de núcleo.
ja: 一部のドライバやカーネルコンポーネントなど、特定の主要システムパッケージをインストールまたは更新します。
ko: 중요한 특정 시스템 패키지(예: 일부 드라이버 및 기타 커널 구성 요소)를 설치 또는 업데이트합니다.
zh_hk: 安裝或更新特定的重要系統套裝軟體 (例如部分驅動程式和其他核心元件)。

source: Use the <literal>beadm create</literal> command.
de: Verwenden Sie den Befehl <literal>beadm create</literal>.
es: Utiliza el comando <literal>beadm create</literal>.
ja: <literal>beadm create</literal> コマンドを使用します。
ko: <literal>beadm create</literal> 명령을 사용합니다.
zh_hk: 使用 <literal>beadm create</literal> 指令。

source: Often a new BE is created when you execute the <literal>pkg update</literal> command or use the <guibutton>Updates</guibutton> button to update all packages that have updates available.
de: Eine neue BU wird häufig erstellt, wenn Sie den Befehl <literal>pkg update</literal> ausführen oder auf die Schaltfläche <guibutton>Updates</guibutton> klicken, um alle Pakete zu aktualisieren, für die Updates verfügbar sind.
es: A menudo, se crea un nuevo entorno de inicio cuando ejecuta el comando <literal>pkg update</literal> o utiliza el botón <guibutton>Actualizaciones</guibutton> para actualizar todos los paquetes que tienen actualizaciones disponibles.
ja: <literal>pkg update</literal> コマンドを実行するか<guibutton>「更新」</guibutton>ボタンを使用して使用可能な更新が存在するすべてのパッケージを更新すると、多くの場合は新しい BE が作成されます。
ko: <literal>pkg update</literal> 명령을 실행하거나 <guibutton>업데이트</guibutton> 버튼을 사용하여 업데이트를 사용할 수 있는 모든 패키지를 업데이트하는 경우 새 BE가 만들어지기도 합니다.
zh_hk: 當您執行 <literal>pkg update</literal> 指令，或是使用 [<guibutton>更新</guibutton>] 按鈕更新有可用更新的所有套裝軟體時，通常會建立新的 BE。

source: Activating a BE
de: Aktivieren einer BU
es: Activación de un entorno de inicio
ja: BE のアクティブ化
ko: BE 활성화
zh_hk: 啟用 BE

source: Select the <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Boot Environments</guimenuitem></menuchoice> menu option to open the Manage Boot Environments window. Each BE is listed in the window. The BE that you are currently booted into shows a check mark to the left of the BE name.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Datei</guimenu><guimenuitem>Boot-Umgebungen verwalten</guimenuitem></menuchoice>, um das Fenster "Boot-Umgebungen verwalten" zu öffnen. Im Fenster wird jede BU aufgeführt. Die BU, die Sie aktuell booten, ist durch ein Häkchen links neben dem BU-Namen gekennzeichnet.
es: Seleccione la opción de menú <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Administrar entornos de arranque</guimenuitem></menuchoice> para abrir la ventana Administrar entornos de arranque. Cada entorno de inicio se muestra en la ventana. El entorno de inicio que se ha iniciado actualmente muestra una marca de verificación a la izquierda del nombre del entorno de inicio.
ja: <menuchoice><guimenu>「ファイル」</guimenu><guimenuitem>「ブート環境の管理」</guimenuitem></menuchoice>メニューオプションを選択して、「ブート環境の管理」ウィンドウを開きます。ウィンドウに BE が一覧表示されます。現在ブートされている BE には、BE 名の左にチェックマークが表示されます。
ko: <menuchoice><guimenu>파일</guimenu><guimenuitem>부트 환경 관리</guimenuitem></menuchoice> 메뉴 옵션을 선택하여 부트 환경 관리 창을 엽니다. 각 BE가 창에 나열됩니다. 현재 부트한 BE의 경우 BE 이름 왼쪽에 확인 표시가 나타납니다.
zh_hk: 選取 <menuchoice>[<guimenu>檔案</guimenu>] [<guimenuitem>管理啟動環境</guimenuitem>]</menuchoice> 功能表選項，開啟 [管理啟動環境] 視窗。視窗中會列出每個 BE。目前啟動的 BE 會在 BE 名稱的左側顯示核取標記。

source: To specify a different BE to be the default active BE after the next reboot, perform the following steps:
de: Führen Sie zum Festlegen einer anderen BU als aktive Standard-BU beim nächsten Neustart die folgenden Schritte aus:
es: Para especificar un entorno de inicio diferente a fin de que sea el entorno de inicio activo predeterminado después del siguiente reinicio, realice los siguientes pasos:
ja: 次回リブート時にアクティブ化するデフォルトの BE として別の BE を指定するには、次の手順を実行します。
ko: 다음 번 재부트 후 다른 BE가 기본 활성 BE로 사용되도록 지정하려면 다음 단계를 수행합니다.
zh_hk: 若要指定另一個 BE 做為下次重新開機時的預設使用中 BE，請執行下列步驟：

source: Select the <guibutton>Active on Reboot</guibutton> button for the BE that you want to be the default active BE after the next reboot.
de: Wählen Sie die Schaltfläche <guibutton>Aktiv bei Neustart</guibutton> für die BU, die beim nächsten Neustart die aktive Standard-BU sein soll.
es: Seleccione el botón <guibutton>Activar al reiniciar</guibutton> para el entorno de inicio que desea que se active de manera predeterminada después de próximo reinicio.
ja: 次回リブート時にアクティブ化するデフォルトの BE として指定する BE の<guibutton>「リブート時にアクティブ化」</guibutton>ボタンを選択します。
ko: 다음 번 재부트 후 기본 활성 BE로 사용할 BE에 대해 <guibutton>재부트 시 활성</guibutton> 버튼을 선택합니다.
zh_hk: 在下次重新開機時要做為預設使用中 BE 的 BE，選取 [<guibutton>在重開機時啟動</guibutton>] 按鈕。

source: Select the <guibutton>OK</guibutton> button in the Manage Boot Environments window.
de: Wählen Sie im Fenster "Boot-Umgebungen verwalten" die Schaltfläche <guibutton>OK</guibutton>.
es: Seleccione el botón <guibutton>Aceptar</guibutton> de la ventana Administrar entornos de arranque.
ja: 「ブート環境の管理」ウィンドウの<guibutton>「了解」</guibutton>ボタンをクリックします。
ko: 부트 환경 관리 창에서 <guibutton>확인</guibutton> 버튼을 선택합니다.
zh_hk: 在 [管理啟動環境] 視窗選取 [<guibutton>確定</guibutton>] 按鈕。

source: Renaming a BE
de: Umbenennen einer BU
es: Cambio de nombre de un entorno de inicio
ja: BE の名前の変更
ko: BE 이름 바꾸기
zh_hk: 重新命名 BE

source: Select the <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Boot Environments</guimenuitem></menuchoice> menu option to open the Manage Boot Environments window. Each BE is listed in the window.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Datei</guimenu><guimenuitem>Boot-Umgebungen verwalten</guimenuitem></menuchoice>, um das Fenster "Boot-Umgebungen verwalten" zu öffnen. Im Fenster wird jede BU aufgeführt.
es: Seleccione la opción de menú <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Administrar entornos de arranque</guimenuitem></menuchoice> para abrir la ventana Administrar entornos de arranque. Cada entorno de inicio se muestra en la ventana.
ja: <menuchoice><guimenu>「ファイル」</guimenu><guimenuitem>「ブート環境の管理」</guimenuitem></menuchoice>メニューオプションを選択して、「ブート環境の管理」ウィンドウを開きます。ウィンドウに BE が一覧表示されます。
ko: <menuchoice><guimenu>파일</guimenu><guimenuitem>부트 환경 관리</guimenuitem></menuchoice> 메뉴 옵션을 선택하여 부트 환경 관리 창을 엽니다. 각 BE가 창에 나열됩니다.
zh_hk: 選取 <menuchoice>[<guimenu>檔案</guimenu>] [<guimenuitem>管理啟動環境</guimenuitem>]</menuchoice> 功能表選項，開啟 [管理啟動環境] 視窗。視窗中會列出每個 BE。

source: You cannot rename the currently active BE.
de: Sie können die derzeit aktive BU nicht umbenennen.
es: No puede renombrar el entorno de inicio activo.
ja: 現在アクティブになっている BE の名前を変更することはできません。
ko: 현재 활성 BE의 이름을 바꿀 수 없습니다.
zh_hk: 您無法重新命名目前使用中的 BE。

source: You cannot rename a BE that you have marked for deletion.
de: Sie können eine BU, die Sie zum Löschen markiert haben, nicht umbenennen.
es: No puede renombrar un entorno de inicio marcado para suprimir.
ja: 削除対象として指定されている BE の名前を変更することはできません。
ko: 삭제 대상으로 표시한 BE의 이름을 바꿀 수 없습니다.
zh_hk: 您無法重新命名標示為要刪除的 BE。

source: To rename a BE, perform the following steps:
de: Führen Sie zum Umbenennen einer BU die folgenden Schritte aus:
es: Para renombrar un entorno de inicio, realice los siguientes pasos:
ja: BE の名前を変更するには、次の手順を実行します。
ko: BE의 이름을 바꾸려면 다음 단계를 수행합니다.
zh_hk: 若要重新命名 BE，請執行下列步驟：

source: Double-click the name of the BE that you want to rename. The name field becomes editable.
de: Doppelklicken Sie auf den Namen der BU, die Sie umbenennen möchten. Das Namensfeld kann nun bearbeitet werden.
es: Haga doble clic en el nombre del entorno de inicio que desea renombrar. El campo de nombre se convertirá en editable.
ja: 名前を変更する BE の名前をダブルクリックします。名前フィールドが編集可能になります。
ko: 이름을 바꿀 BE의 이름을 두 번 누릅니다. 그러면 이름 필드가 편집 가능 필드로 바뀝니다.
zh_hk: 按兩下您要重新命名的 BE 名稱，即可編輯名稱欄位。

source: Enter the new name.
de: Geben Sie den neuen Namen ein.
es: Introduzca el nombre nuevo.
ja: 新しい名前を入力します。
ko: 새 이름을 입력합니다.
zh_hk: 輸入新名稱。

source: Removing a BE
de: Entfernen einer BU
es: Eliminación de un entorno de inicio
ja: BE の削除
ko: BE 제거
zh_hk: 移除 BE

source: Select the <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Boot Environments</guimenuitem></menuchoice> menu option to open the Manage Boot Environments window. Each BE is listed in the window. The right-most column in the window is the Delete column.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Datei</guimenu><guimenuitem>Boot-Umgebungen verwalten</guimenuitem></menuchoice>, um das Fenster "Boot-Umgebungen verwalten" zu öffnen. Im Fenster wird jede BU aufgeführt. Die Spalte rechts außen heißt "Löschen".
es: Seleccione la opción de menú <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Administrar entornos de arranque</guimenuitem></menuchoice> para abrir la ventana Administrar entornos de arranque. Cada entorno de inicio se muestra en la ventana. La columna que aparece en el extremo derecho de la ventana es la columna Suprimir.
ja: <menuchoice><guimenu>「ファイル」</guimenu><guimenuitem>「ブート環境の管理」</guimenuitem></menuchoice>メニューオプションを選択して、「ブート環境の管理」ウィンドウを開きます。ウィンドウに BE が一覧表示されます。ウィンドウの右端の列が「削除」列です。
ko: <menuchoice><guimenu>파일</guimenu><guimenuitem>부트 환경 관리</guimenuitem></menuchoice> 메뉴 옵션을 선택하여 부트 환경 관리 창을 엽니다. 각 BE가 창에 나열됩니다. 창의 맨 오른쪽 열은 삭제 열입니다.
zh_hk: 選取 <menuchoice>[<guimenu>檔案</guimenu>] [<guimenuitem>管理啟動環境</guimenuitem>]</menuchoice> 功能表選項，開啟 [管理啟動環境] 視窗。視窗中會列出每個 BE。視窗中最右側的資料欄即為 [刪除] 資料欄。

source: The middle column in the Manage Boot Environments window shows the size of the BE. You might want to remove a BE to free some space on your storage device.
de: In der mittleren Spalte des Fensters "Boot-Umgebungen verwalten" wird die Größe der BU angezeigt. Sie können eine BU entfernen, um mehr Speicherplatz auf Ihrem Speichergerät zu schaffen.
es: La columna que aparece en el medio de la ventana Administrar entornos de arranque muestra el tamaño del entorno de inicio. Es posible que desee eliminar un entorno de inicio para liberar un poco de espacio en su dispositivo de almacenamiento.
ja: 「ブート環境の管理」ウィンドウの中央の列には、BE のサイズが表示されます。BE を削除してストレージデバイスの領域を解放することができます。
ko: 부트 환경 관리 창의 가운데 열에는 BE 크기가 표시됩니다. 저장소 장치의 공간을 확보하기 위해 BE를 제거할 수 있습니다.
zh_hk: [管理啟動環境] 視窗中間的資料欄顯示的是 BE 的大小。您可能想要移除 BE 以釋放一些儲存裝置的空間。

source: You cannot delete the currently active BE.
de: Sie können die derzeit aktive BU nicht löschen.
es: No puede suprimir el entorno de inicio activo.
ja: 現在アクティブになっている BE を削除することはできません。
ko: 현재 활성 BE를 삭제할 수 없습니다.
zh_hk: 您無法刪除目前使用中的 BE。

source: You cannot delete a BE that you have renamed.
de: Sie können eine BU, die Sie umbenannt haben, nicht löschen.
es: No puede suprimir un entorno de inicio que ha renombrado.
ja: 名前を変更した BE を削除することはできません。
ko: 이름을 바꾼 BE를 삭제할 수 없습니다.
zh_hk: 您無法刪除已重新命名的 BE。

source: To delete a BE, perform the following steps:
de: Führen Sie zum Löschen einer BU die folgenden Schritte aus:
es: Para suprimir un entorno de inicio, realice los siguientes pasos:
ja: BE を削除するには、次の手順を実行します。
ko: BE를 삭제하려면 다음 단계를 수행합니다.
zh_hk: 若要刪除 BE，請執行下列步驟：

source: Select the <guibutton>Delete</guibutton> box for the BE that you want to delete.
de: Markieren Sie das Kontrollkästchen <guibutton>Löschen</guibutton> für die BU, die gelöscht werden soll.
es: Seleccione el cuadro <guibutton>Suprimir</guibutton> para el entorno de inicio que desea suprimir.
ja: 削除する BE の<guibutton>「削除」</guibutton>ボックスを選択します。
ko: 삭제할 BE에 대한 <guibutton>삭제</guibutton> 상자를 선택합니다.
zh_hk: 選取要刪除之 BE 的 [<guibutton>刪除</guibutton>] 方塊。

source: Working With WebInstall
ca: Treballant amb l'Instal·lador Web
cs: Pracujeme s WebInstalací
de: Arbeiten mit WebInstall
es: Trabajo con WebInstall
ja: WebInstall の操作
ko: WebInstall 작업
ru: Работа с веб-установкой
zh_hk: 使用 WebInstall

source: Package Manager supports installing packages using a simple one-click WebInstall process. The WebInstall process uses a <filename>.p5i</filename> file. A <filename>.p5i</filename> file contains information to add publishers and add packages that can be installed from these publishers. The information in the <filename>.p5i</filename> file is read and used by the WebInstall process.
de: Der Package Manager unterstützt die Installation von Paketen mithilfe eines einfachen WebInstall-Verfahrens. Beim WebInstall-Verfahren wird die Datei <filename>.p5i</filename> verwendet. Eine <filename>.p5i</filename>-Datei enthält Informationen zum Hinzufügen von Herausgebern und Paketen, die von diesen Herausgebern installiert werden können. Die in der Datei <filename>.p5i</filename> enthaltenen Informationen werden beim WebInstall-Verfahren gelesen und verwendet.
es: Package Manager admite la instalación de paquetes con un solo clic mediante el proceso WebInstall. El proceso WebInstall utiliza un archivo <filename>.p5i</filename>. Un archivo <filename>.p5i</filename> contiene información para agregar editores y paquetes que se pueden instalar de estos editores. El proceso WebInstall lee y utiliza la información del archivo <filename>.p5i</filename>.
ja: パッケージマネージャーでは、簡単なワンクリックの WebInstall 処理を使用したパッケージのインストールがサポートされています。WebInstall 処理は <filename>.p5i</filename> ファイルを使用します。<filename>.p5i</filename> ファイルには、発行元を追加するための情報と、これらの発行元からインストール可能なパッケージを追加するための情報が含まれています。<filename>.p5i</filename> ファイルに含まれている情報は WebInstall 処理によって読み込まれ、使用されます。
ko: 패키지 관리자는 한 번만 누르는 간단한 WebInstall 프로세스를 사용하여 패키지를 설치할 수 있도록 지원합니다. WebInstall 프로세스에는 <filename>.p5i</filename> 파일이 사용됩니다. <filename>.p5i</filename> 파일에는 게시자를 추가하고 해당 게시자로부터 설치할 수 있는 패키지를 추가하는 데 필요한 정보가 포함되어 있습니다. WebInstall 프로세스가 <filename>.p5i</filename> 파일의 정보를 읽고 사용합니다.
zh_hk: 套裝軟體管理員支援使用簡單的一鍵式 WebInstall 程序安裝套裝軟體。WebInstall 程序使用 <filename>.p5i</filename> 檔案。<filename>.p5i</filename> 檔案包含增加發佈者所需的資訊，以及增加可從這些發佈者安裝之套裝軟體的資訊。WebInstall 程序將會讀取並使用 <filename>.p5i</filename> 檔案中的資訊。

source: Exporting Files Using WebInstall
de: Exportieren von Dateien mithilfe von WebInstall
es: Exportación de archivos con WebInstall
ja: WebInstall によるファイルのエクスポート
ko: WebInstall을 사용하여 파일 내보내기
zh_hk: 使用 WebInstall 匯出檔案

source: If you want other users to be able to install packages that you have installed on your system, you can export the installation instructions for those package files using the WebInstall process. A <filename>.p5i</filename> file consisting of installation instructions for those packages and publishers to be installed is created.
de: Wenn Sie möchten, dass andere Benutzer Pakete installieren können, die Sie auf Ihrem System installiert haben, können Sie die Installationsanweisungen für diese Paketdateien unter Anwendung des WebInstall-Verfahrens exportieren. Dabei wird eine Datei namens <filename>.p5i</filename> erstellt, die die Installationsanweisungen für die zu installierenden Pakete und Herausgeber enthält.
es: Si desea que otros usuarios puedan instalar paquetes que usted ha instalado en su sistema, puede exportar las instrucciones de instalación para esos archivos de paquete mediante el proceso WebInstall. Se crea un archivo <filename>.p5i</filename> que contiene instrucciones de instalación para instalar esos paquetes y editores.
ja: 自分のシステムにインストールしたパッケージをほかのユーザーもインストールできるようにする場合は、これらのパッケージファイルのインストール方法を WebInstall 処理でエクスポートできます。これらのパッケージのインストール方法とインストールする発行元を含む <filename>.p5i</filename> ファイルが作成されます。
ko: 시스템에 설치한 패키지를 다른 사용자가 설치할 수 있도록 하려는 경우 WebInstall 프로세스를 사용하여 해당 패키지 파일에 대한 설치 지침을 내보낼 수 있습니다. 해당 패키지 및 게시자 설치를 위한 설치 지침으로 구성된 <filename>.p5i</filename> 파일이 만들어집니다.
zh_hk: 如果想讓其他使用者可安裝您系統上所安裝的套裝軟體，您可以使用 WebInstall 程序匯出這些套裝軟體檔案的安裝說明。該程序會建立包含要安裝之套裝軟體安裝說明及發佈者的 <filename>.p5i</filename> 檔案。

source: To export the installation instructions for your selected packages and their publishers to a <filename>.p5i</filename> file, perform the following steps:
de: Führen Sie zum Exportieren der Installationsanweisungen für die ausgewählten Pakete und die jeweiligen Herausgeber in eine <filename>.p5i</filename>-Datei die folgenden Schritte aus:
es: Para exportar las instrucciones de instalación para los paquetes seleccionados y sus editores a un archivo <filename>.p5i</filename>, realice los siguientes pasos:
ja: 選択したパッケージのインストール方法と発行元を <filename>.p5i</filename> ファイルにエクスポートするには、次の手順を実行します。
ko: 선택한 패키지 및 패키지 게시자에 대한 설치 지침을 <filename>.p5i</filename> 파일로 내보내려면 다음 단계를 수행합니다.
zh_hk: 若要將所選套裝軟體的安裝說明及其發佈者匯出至 <filename>.p5i</filename> 檔案，請執行下列步驟：

source: From the <guimenu>Publisher</guimenu> drop-down menu, select the publisher from which you want to include the packages in the <filename>.p5i</filename> file.
de: Wählen Sie im Dropdown-Menü <guimenu>Herausgeber</guimenu> den Herausgeber, von dem Pakete in die Datei <filename>.p5i</filename> aufgenommen werden sollen.
es: En el menú desplegable <guimenu>Editor</guimenu>, seleccione el editor del que desea incluir los paquetes en el archivo <filename>.p5i</filename>.
ja: <guimenu>「発行元」</guimenu>ドロップダウンメニューから、<filename>.p5i</filename> ファイルに含めるパッケージを取得する発行元を選択します。
ko: <guimenu>게시자</guimenu> 드롭다운 메뉴에서 패키지를 <filename>.p5i</filename> 파일에 포함시킬 게시자를 선택합니다.
zh_hk: 在 [<guimenu>發佈者</guimenu>] 下拉式功能表中，選取想將哪個發佈者的套裝軟體併入 <filename>.p5i</filename> 檔案中。

source: In the package list pane, select the package whose installation instructions you want to distribute.
de: Wählen Sie im Paketlistenbereich das Paket aus, für das Sie Installationsanweisungen bereitstellen möchten.
es: En el panel de la lista de paquetes, seleccione el paquete cuyas instrucciones de instalación desea distribuir.
ja: パッケージリスト区画で、インストール方法を配布するパッケージを選択します。
ko: 패키지 목록 창에서 설치 지침을 배포할 패키지를 선택합니다.
zh_hk: 在套裝軟體清單窗格，選取要分發安裝說明的套裝軟體。
