Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: Installation Error
ca: S'ha produït un error en la instal·lació
cs: Chyba při instalaci
ru: Ошибка установки

source: If an error occurs during package installation, an error dialog with the error message is displayed along with the reason for failure. Click <guibutton>Close</guibutton> to close the error dialog.
ca: Si es produeix un error durant el procés d'instal·lació, es mostra un diàleg amb l'error amb la seva corresponent explicació. Cliqueu a <guibutton>Tancar</guibutton> per a tancar el diàleg de l'error.
cs: Pokud dojde při instalaci k chybě, je zobrazen chybový dialog s chybovou hláškou a důvodem selhání. Klikněte na <guibutton>Zavřít</guibutton> pro zavření chybového dialogu.
ru: Если в процессе установки пакета происходит ошибка, открывается диалоговое окно, в котором выводится сообщение об ошибке вместе с причиной отказа. Для закрытия диалогового окна ошибки нажмите кнопку <guibutton>Закрыть</guibutton>

source: Remove a Package
ca: Eliminar un paquet
cs: Odstranit balíček
ru: Удаление пакета

source: Check the box next to a package to select it. Double-clicking the package also selects the package.
ca: Maqueu la casella que està a la vora del paquet per a selecciona'l. Clicar dues vegades damunt del paquet també el selecciona.
cs: Zaškrtněte políčko vedle balíčku k vybrání balíčku. Dvojklikem také balíček vybere.
ru: Для выбора пакета установите расположенный рядом с ним флажок. Пакет также можно выбрать двойным щелчком.

source: Click <guibutton>Remove</guibutton> to start the package uninstallation process.
ca: Cliqueu a <guibutton>Treure</guibutton> per a iniciar el procés de desinstal·lació
cs: Klikněte na <guibutton>Odebrat</guibutton> pro započetí procesu deinstalace balíčku.
ru: Для запуска процесса удаления пакета нажмите кнопку <guibutton>Удалить</guibutton>.

source: You can also choose <menuchoice><guimenu>Package</guimenu><guimenuitem>Remove</guimenuitem></menuchoice> to remove a package.
ca: També podeu seleccionar <menuchoice><guimenu>Paquet</guimenu><guimenuitem>Eliminar</guimenuitem></menuchoice> per a eliminar un paquet.
cs: Pro odstranění balíčku můžete také zvolit <menuchoice><guimenu>Balíček</guimenu><guimenuitem>Odstranit</guimenuitem></menuchoice>
ru: Для удаления пакета можно также выбрать в меню <menuchoice><guimenu>Пакет</guimenu><guimenuitem>Удалить</guimenuitem></menuchoice>.

source: Review the packages to be removed and the package dependencies details in the <emphasis role="strong">Remove Confirmation</emphasis> dialog.
ca: reviseu els paquets a ser trets i els detalls de les dependències dels paquets en el diàleg <emphasis role="strong">Confirmació d'eliminació</emphasis>,
cs: Shlédněte balíčky k odebrání a podrobnosti o závislostech balíčků v potvrzovacím dialogu <emphasis role="strong">Potvrzení odebrání</emphasis>.
ru: Просмотрите пакеты, которые необходимо удалить, а также подробные сведения о зависимостях пакетов в диалоговом окне <emphasis role="strong">Подтверждение удаления</emphasis>.

source: Click <guibutton>Proceed</guibutton> to start removing the packages or <guibutton>Cancel</guibutton> to cancel the process.
ca: Cliqueu a <guibutton>Procedir</guibutton> per a iniciar l'eliminació dels paquets, o bé a <guibutton>Cancel·lar</guibutton> per a cancel·lar el procés.
cs: Klikněte na <guibutton>Pokračovat</guibutton> pro započetí odebírání balíčků nebo <guibutton>Zrušit</guibutton> pro zrušení procesu.
ru: Нажмите кнопку <guibutton>Продолжить</guibutton> для начала удаления пакетов или кнопку <guibutton>Отмена</guibutton> для отмены процесса удаления.

source: Search for a Package
ca: Cercar per a un paquet
cs: Vyhledání balíčku
ru: Поиск пакетов

source: You can search for a package in the following ways :
ca: Podeu cercar per a un paquet de les següents formes :
cs: Balíček můžete hledat následujícími způsoby:
ru: Поиск пакета можно выполнять одним из следующих способов:

source: <emphasis role="strong">Search the current publisher</emphasis> – Search for a package in the publisher currently selected in the <emphasis role="strong"> Publisher</emphasis> drop-down menu. If you do not know the status of the package you are searching for, set the <emphasis role="strong">View</emphasis> drop-down menu to <emphasis role="strong">All Packages</emphasis>.
ca: <emphasis role="strong">Cercar al publicador actual</emphasis> – Cerca un paquet en el publicador actualment seleccionat en el menú desplegable del <emphasis role="strong">Publicador</emphasis>. Si desconeixeu l'estat del paquet pel qual esteu realitzant la cerca, establiu el menú desplegable de <emphasis role="strong">Vista</emphasis> a <emphasis role="strong">Tots els paquets</emphasis>.
cs: <emphasis role="strong">Hledat v rámci daného vydavatele</emphasis> - Vyhledávat balíček v rámci nyní vybraného vydavatele v rozbalovacím menu </emphasis role="strong">Vydavatel</emphasis>. Pokud neznáte stav vyhledávaného balíčku, nastavte v rozbalobacím menu</emphasis role="strong">Náhled</emphasis> hodnotu <emphasis role="strong">Všechny balíčky</emphasis>.
ru: <emphasis role="strong">Поиск текущего издателя</emphasis> – поиск пакета от издателя, выбранного в настоящий момент в раскрывающемся меню <emphasis role="strong">Издатель</emphasis>. Если статус искомого пакета неизвестен, выберите в раскрывающемся меню <emphasis role="strong">Вид</emphasis> значение <emphasis role="strong">Все пакеты</emphasis>.

source: Enter a description, or a partial name in the <emphasis role="strong">Search</emphasis> field. For example, you might type one of the following search terms to search for <filename>SUNWgnome-games</filename> :
ca: Introduïu la descripció, o el nom parcial en el camp de <emphasis role="strong">Cercar</emphasis>. Per exemple, podeu escriure un dels següents termes de cerca per a cercar el paquet <filename>SUNWgnome-games</filename> :
cs: Uveďte popis nebo částečný název do políčka <emphasis role="strong">Hledat</emphasis>. Například můžete uvést jeden z následujících výrazů pro vyhledání <filename>SUNWgnome-games</filename>:
ru: Введите описание или частичное имя в поле <emphasis role="strong">Поиск</literal>. Например, для поиска пакета <filename>SUNWgnome-games</filename> можно ввести один из следующих критериев поиска:

source: To search for SunStudio compilers, you might type one of the following terms:
ca: Per a cercar compiladors de SunStudio, heu d'introduir un dels següents termes:
cs: Pro vyhledání SunStudio kompilátorů, můžete napsat následující výrazy:
ru: Для поиска компиляторов SunStudio можно ввести один из следующих критериев поиска:

source: <emphasis role="strong">Search all publishers</emphasis> – Choose <emphasis role="strong">All Publishers(Search)</emphasis> from the <emphasis role="strong">Publisher</emphasis> drop-down menu to search for a package across all configured publishers. If you do not know the status of the package you are searching for, set the <emphasis role="strong">View</emphasis> drop-down menu to <emphasis role="strong">All Packages</emphasis>.
ca: <emphasis role="strong">Cercar a tots els publicadors</emphasis> – Seleccioneu <emphasis role="strong">Tiots els publicadors(Cerca)</emphasis> des del menú desplegable <emphasis role="strong">Publicador</emphasis> per a cercar un paquet a través de tots els publicadors configurats. Si desconeixeu l'estat del paquet per al qual esteu realitzant la cerca, establiu el menú desplegable <emphasis role="strong">Vista</emphasis> a <emphasis role="strong">Tots els paquets</emphasis>.
cs: <emphasis role="strong">Hledat u všech vydavatelů</emphasis> - Zvolte <emphasis role="strong">Všichni vydavatelé (Vyhledávání)</emphasis> v rozbalovací nabídce <emphasis role="strong">Vydavatel</emphasis> pro vyhledávání balíčku v rámci všech nastavených vydavatelů. Pokud neznáte stav vyhledávaného balíčku, nastavte v rozbalovací nabídce<emphasis role="strong">Náhled</emphasis> hodnotu </emphasis role="strong">Všechny balíčky</emphasis>
ru: <emphasis role="strong">Поиск по всем издателям</emphasis> – для поиска пакета по всем настроенным издателям выберите значение <emphasis role="strong">Все издатели (поиск)</emphasis> в раскрывающемся меню <emphasis role="strong">Издатель</emphasis>. Если статус искомого пакета неизвестен, выберите в раскрывающемся меню <emphasis role="strong">Вид</emphasis> значение <emphasis role="strong">Все пакеты</emphasis>.

source: Type a description of the package in the <emphasis role="strong">Search</emphasis> field. For example, the <filename>SUNWdiveintopython</filename> package is a book on Python programming. The description of the package contains the string <emphasis>book</emphasis>. To search for this package, you might then type one of the following terms:
ca: Escriviu la descripció del paquet en el camp <emphasis role="strong">Cercar</emphasis>. Per exemple, el paquet <filename>SUNWdiveintopython</filename> és un llibre sobre programació en Python. La descripció del paquet conté la cadena de text <emphasis>book</emphasis>. Per cercar aquest paquet, podeu escriure un dels següents termes:
cs: Uveďte popis balíčku do políčka <emphasis role="strong">Vyhledávání</emphasis>. Například balíček <filename>SUNWdiveintopython</filename> je kniha o programování v Pythonu. Popis palíčku obsahuje řetězec <emphasis>book</emphasis>. Pro vyhledávání tohoto balíčku můžete použít jeden z následujících výrazů:
ru: Введите описание пакета в поле <emphasis role="strong">Поиск</emphasis>. Например, пакет <filename>SUNWdiveintopython</filename> представляет собой руководство по программированию на языке Python. В описании пакета содержится строка <emphasis>book</emphasis>. Для поиска этого пакета можно ввести один из следующих критериев поиска:

source: If you searched for the term <emphasis>diveinto</emphasis> when searching for the <filename>SUNWdiveintopython</filename> package, the results will not be displayed as the term <emphasis>diveinto</emphasis> is not present as an independent, complete word in the package contents. However you will find the package using the <literal>*</literal> wild card. Hence, searching for the term <literal>diveinto*</literal> will display the <filename>SUNWdiveintopython</filename> package.
ca: Si heu cercat el terme <emphasis>diveinto</emphasis> quant esteu cercant el paquet <filename>SUNWdiveintopython</filename>, els resultats no seran mostrats ja que el terme <emphasis>diveinto</emphasis> no està present per si mateix com a paraula sencera als continguts del paquet. Tanmateix podreu trobar el paquet utilitzant el comodí <literal>*</literal>. En conseqüència, la cerca pel paquet <literal>diveinto*</literal> mostrarà el paquet <filename>SUNWdiveintopython</filename>.
cs: Pokud by vyhledávaný výraz byl <emphasis>diveinto</emphasis> při hledání balíčku <filename>SUNWdiveintopython</filename>, výsledky by nebyly zobrazeny, neboť výraz <emphasis>diveinto</emphasis> není přítomen jako nezávislé celé slovo v obsahu balíčku. Nicméně balíček naleznete užitím náhrady <literal>*</literal>. Tedy hledání výrazu <literal>diveinto*</literal> zobrazí balíček <filename>SUNWdiveintopython</filename>.
ru: Если при поиске пакета <filename>SUNWdiveintopython</filename> использовался критерий <emphasis>diveinto</emphasis>, пакет не выводится, поскольку критерий <emphasis>diveinto</emphasis> отсутствует в содержимом пакета в качестве отдельно стоящего полного слова. Однако пакет можно найти с помощью подстановочного символа <literal>*</literal>. Следовательно, при поиске по критерию <literal>diveinto*</literal> пакет <filename>SUNWdiveintopython</filename> будет выведен.

source: Use the submenus under the <menuchoice><guimenu>Edit</guimenu></menuchoice> menu to cut, copy, or paste text in the <emphasis role="strong">Search</emphasis> field.
ca: Utilitzeu els submenús sota el menú <menuchoice><guimenu>Edició</guimenu></menuchoice> per retallar, copiar, o enganxar text al camp <emphasis role="strong">Cercar</emphasis>.
cs: Užijte podnabídky v menu <menuchoice><guimenu>Upravit</guimenu></menuchoice> pro vyjmutí, kopírování nebo vložení textu do políčka <emphasis role="strong">Vyhledávání</emphasis>.
ru: Подменю в меню <menuchoice><guimenu>Правка</guimenu></menuchoice> позволяют вырезать, копировать или вставлять текст в поле <emphasis role="strong">Поиск</emphasis>.

source: The following operators are supported for a package search:
ca: Estan suportats els següents operadors per a la cerca d'un paquet:
cs: Při vyhledávání balíčků jsou podporovány následující operátory:
ru: При поиске пакетов поддерживаются следующие операторы:

source: The AND operator
ca: Operador AND
cs: Operátor AND
ru: Оператор AND

source: When the search term is separated by spaces or the AND operator, the Package Manager will search for packages containing <emphasis role="strong">all</emphasis> the search terms.
ca: Quant els termes de la cerca estan separats amb espais o l'operador AND, El Gestor de paquets cercarà els paquets que continguin <emphasis role="strong">tots</emphasis> els termes de la cerca.
cs: Pokud je vyhledávaný výraz rozdělen mezerami nebo operátorem AND, Správce balíčků bude vyhledávat balíčky obsahující <emphasis role="strong">všechny</emphasis> vyhledávané výrazy.
ru: Если критерии поиска разделены пробелами или оператором AND, выполняется поиск пакетов, содержащих <emphasis role="strong">все</emphasis> критерии поиска.

source: Double Quotes
ca: Dobles cometes
cs: Uvozovky
ru: Кавычки

source: When a search term is placed within double quotes, the Package Manager will search for packages that <emphasis role="strong">match the search term exactly</emphasis>.
ca: Quant el terme de la cerca està situat dins de cometes, el Gestor de paquets cercarà els paquets que <emphasis role="strong">coincideixin exactament amb el terme de la cerca</emphasis>.
cs: Pokud je vyhledávaný výraz umístěn mezi uvozovkami, Správce balíčků bude vyhledávat balíčky, které <emphasis role="strong">přesně odpovídají tomuto výrazu</emphasis>.
ru: Если критерий поиска заключен в кавычки, выполняется поиск пакетов, <emphasis role="strong">точно соответствующих критерию поиска</emphasis>.

source: Wildcard *
ca: Comodí *
cs: Náhrada *
ru: Подстановочный знак *

source: Including a wildcard in your search term enables you to search for partial package names. For example, when you enter <emphasis>boo*</emphasis> in your search term, the packages displayed could include <emphasis>boot</emphasis> and <emphasis>book</emphasis> in the package name and description.
ca: Incloent el comodí en el vostre terme de cerca us permetrà cercar noms parcials de paquets. Per exemple, quant introduïu <emphasis>boo*</emphasis> en el vostre terme de cerca, els paquets mostrats poden incloure el termes <emphasis>boot</emphasis> i <emphasis>book</emphasis> en el nom i/o descripció del paquet.
cs: Zahrnutí nahrazujícího znaku do vyhledávaného výrazu umožňuje vyhledávání částečných názvů balíčků. Například při zadání <emphasis>boo*</emphasis> do vyhledávaného výrazu by mohly zobrazené balíčky obsahovat <emphasis>boot</emphasis> a <emphasis>book</emphasis> v názvu a popisu balíčku.
ru: Включение подстановочного знака в критерий поиска позволяет выполнять поиск частичных имен пакетов. Например, при вводе <emphasis>boo*</emphasis> в качестве критерия поиска в именах и описаниях найденных пакетов будут содержаться как <emphasis>boot</emphasis>, так и <emphasis>book</emphasis>.

source: Wildcard searching can be slower than an exact match search or a search based on package description.
ca: La cerca amb comodí pot resultar més lenta que la cerca exacta, o la cerca basada amb la descripció del paquet.
cs: Vyhledávání s náhradou může být pomalejší než vyhledávání přesné shody nebo vyhledávání založené na popisu balíčku.
ru: Поиск с использованием подстановочных знаков может оказаться медленнее поиска по точному совпадению или поиск по описанию пакета.

source: The OR operator
ca: Operador OR
cs: Operátor OR
ru: Оператор OR

source: When a search term is separated by the OR operator, the Package Manager searches for packages that contain any of the search terms.
ca: Quant cerqueu termes separats amb l'operador OR, el Gestor de paquets cerca paquets que continguin qualsevol dels termes de la cerca.
cs: Pokud je vyhledávaný výraz rozdělen operátorem OR, Správce balíčků bude vyhledávat balíčky obsahující libovolný z těchto výrazů.
ru: Если критерии поиска разделены оператором OR, выполняется поиск пакетов, содержащих любой из критериев.

source: Cancel Package Search
ca: Cancel·lar la cerca de paquets
cs: Zrušit Vyhledávání Balíčků
ru: Отмена поиска пакетов

source: If you want to cancel a search, use the Cancel Search icon at the bottom of the main window of the Package Manager. This icon is visible on the status bar only during a search operation.
ca: Si voleu cancel·lar un cerca, Utilitzeu la icona de Cancel·lar cerca de la part inferior de la finestra del Gestor de paquets. Aquesta icona és visible des de la barra d'estat únicament durant una operació de cerca.
cs: Pokud chcete zrušit vyhledávání, použijte ikonu Zrušit Vyhledávání ve spodní části hlavního okna Správce balíčků. Tato ikona je na stavové řádce viditelná pouze při probíhající operaci vyhledávání.
ru: Если поиск требуется отменить, воспользуйтесь значком "Отмена поиска" в нижней части главного окна диспетчера пакетов. Этот значок отображается в строке состояния только в ходе операции поиска.

source: Update a Package
ca: Actualitzar un paquet
cs: Aktualizovat Balíček
ru: Обновление пакета

source: Look for the Updates icon next to the installed package name. This icon indicates that updates are available for the package in the currently selected publisher. You can also choose one of the following views to display a list of packages that have updates available :
ca: Observeu la icona d'actualitzacions que està al canto del nom del paquet. Aquesta icona indica que hi han actualitzacions disponibles pel paquet en el publicador seleccionat. Podeu utilitzar una de les següent visualitzacions per a mostrar el llistat dels paquets que tenen actualitzacions disponibles :
cs: Vedle názvu nainstalovaného balíčku naleznete ikonu Aktualizovat.
ru: Обратите внимание на значок "Обновления" рядом с именем установленного пакета. Этот значок означает, что для пакета доступны обновления от издателя, выбранного в текущий момент. Также для вывода списка пакетов с доступными обновлениями можно выбрать один из следующих режимов просмотра:

source: Select the <menuchoice><guimenuitem>Updates</guimenuitem></menuchoice> option in the <emphasis role="strong">View</emphasis> drop-down menu to list all packages that have updates available in the currently selected publisher.
ca: Seleccioneu l'opció <menuchoice><guimenuitem>Actualitzacions</guimenuitem></menuchoice> en el menú desplegable <emphasis role="strong">Vista</emphasis> per a llistar tots els paquets que tenen actualitzacions disponibles en el publicador actualment seleccionat.
cs: Vyberte možnost <menuchoice><guimenuitem>Aktualizovat</guimenuitem></menuchoice> z rozbalovací nabídky<emphasis role="strong">Zobrazení</emphasis> pro vypsání všech balíčků, které mají u nyní zvoleného vydavatele dostupné aktualizace.
ru: Для получения списка всех пакетов, для которых доступны обновления от издателя, выбранного в текущий момент, выберите пункт <menuchoice><guimenuitem>Обновления</guimenuitem></menuchoice> в раскрывающемся меню <emphasis role="strong">Вид</emphasis>.

source: Select the <menuchoice><guimenuitem>Updates</guimenuitem></menuchoice> option in the <emphasis role="strong">View</emphasis> drop-down menu and the <emphasis role="strong">All Publishers (Installed)</emphasis> in the <emphasis role="strong">Publisher</emphasis> drop-down menu to list all packages that have updates available from all publishers.
ca: Seleccioneu l'opció <menuchoice><guimenuitem>Actualitzacions/guimenuitem></menuchoice> en el menú desplegable <emphasis role="strong">Vista</emphasis> i <emphasis role="strong">Tots els publicadors (Instal·lats)</emphasis> en el menú desplegable <emphasis role="strong">Publicador</emphasis> per a llistar totes els paquets que tenen actualitzacions disponibles en tots els publicadors.
cs: Vyberte možnost <menuchoice><guimenuitem>Aktualizovat</guimenuitem></menuchoice> v rozbalovací nabídce <emphasis role="strong">Náhled</emphasis> a <emphasis role="strong">Všichni vydavatelé (Nainstalované)</emphasis> v nabídce <emphasis role="strong">Vydavatelé</emphasis> pro zobrazení seznamu balíčků, pro které jsou dostupné aktualizace ze všech vydavatelů.
ru: Для получения списка всех пакетов, для которых доступны обновления от всех издателей, выберите пункт <menuchoice><guimenuitem>Обновления</guimenuitem></menuchoice> в раскрывающемся меню <emphasis role="strong">View</emphasis> и пункт <emphasis role="strong">Все издатели (установленные)</emphasis> в раскрывающемся меню <emphasis role="strong">Издатель</emphasis>.

source: Updating a package may fail sometimes, due to inherent dependencies of the package you have selected for installation or update. You may need to update all packages on your system to get the latest updates.
ca: Algun cop pot fallar l'actualització d'un paquet, degut a dependències incoherents del paquet que he seleccionat per a l'instal·lació o actualització. Potser heu d'actualitzar tots els paquets del sistema per obtenir les últimes actualitzacions.
cs: Aktualizace balíčku může občas selhat kvůli vlastní závislosti balíčku, který jste si vybrali pro instalaci nebo aktualizaci. Možná budete muset aktualizovat všechny balíčky na Vašem systému, abyste získali nejnovější aktualizace.
ru: Иногда при обновлении пакета возникают сбои вследствие неотъемлемых зависимостей пакета, выбранного для установки или обновления. Для получения последних обновлений может потребоваться обновление всех пакетов в системе.

source: Select the package or packages you want to update and click <guibutton>Install/Update</guibutton> to install the latest version of the package. Use the <emphasis role="strong">Updates</emphasis> icon on the toolbar to update all packages on your system.
ca: Seleccioneu el paquet o els paquets que voleu actualitzar i cliqueu a <guibutton>Instal·lar/Actualitzar</guibutton> per a instal·lar l'última versió del paquet. Utilitzeu la icona <emphasis role="strong">Actualitzacions</emphasis> de la barra d'eines per a actualitzar tots els paquets del vostre sistema.
cs: Vyberte balíček nebo balíčky, které chcete aktualizovat a klikněte na <guibutton>Instalovat/Aktualizovat</guibutton> pro instalaci nejnovější verze balíčku. Použijte ikonu <emphasis role="strong">Aktualizovat</emphasis>na panelu nástrojů pro aktualizaci všech balíčků na Vašem systému.
ru: Выберите пакет или пакеты, которые требуется обновить, и нажмите на кнопку <guibutton>Установить/обновить</guibutton> для установки последней версии пакета. Обновите все пакеты в системе с помощью значка <emphasis role="strong">Обновления</emphasis>.

source: Package Version Information
ca: Informació de la versió del paquet
cs: Informace o verzi balíčku
ru: Сведения о версии пакета

source: Select a package in the main window of the Package Manager and right-click your mouse to view the package version information. There are three types of package versions :
ca: Seleccioneu un paquet en la finestra principal de Gestor de paquets i cliqueu amb el botó dret per a visualitzar la informació del paquet. Hi han tres tipus de versions de paquet :
cs: Vyberte balíček v hlavním okně Správce balíčků a pro zobrazení verze balíčku, klikněte pravým tlačítkem na vybraný balíček. Existují tři typy verzí balíčků:
ru: Выберите пакет в главном окне диспетчера пакетов и щелкните его правой кнопкой мыши для просмотра сведений о версии пакета. Существует три типа версий пакетов:
