Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: Click <guibutton>Update All</guibutton> to restart the process of updating all packages.
ca: Cliqueu a <guibutton>Actualitzar tot</guibutton> per a reiniciar el procés d'actualització de tots els paquets.
cs: Klikněte na <guibutton>Aktualizovat Vše</guibutton> pro restart procesu aktualizace všech balíčků.
ru: Щелкните значок <guibutton>Обновить все</guibutton> для повторного запуска процесса обновления всех пакетов.

source: Manage Boot Environments
ca: Gestiona entorns d'arranc
cs: Správa Bootovacích Prostředí
ru: Управление загрузочными средами

source: Perform the following steps to manage your boot environments:
ca: Realitzeu els següents passos per a gestionar els vostres entorns d'arranc:
cs: Proveďte následující kroky pro správu bootovacích prostředí:
ru: Для управления загрузочными средами выполните следующие действия:

source: Click <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Boot Environments</guimenuitem></menuchoice> to open the <emphasis role="strong">Manage Boot Environments</emphasis> dialog.
ca: Cliqueu a <menuchoice><guimenu>Fitxer</guimenu><guimenuitem>Gestionar entorns d'arranc</guimenuitem></menuchoice> per obrir el diàleg <emphasis role="strong">Gestionar entorns d'arranc</emphasis>.
cs: Klikněte na <menuchoice><guimenu>Soubor</guimenu><guimenuitem>Správa Bootovacích Prostředí</guimenuitem></menuchoice> a otevře se dialog <emphasis role="strong">Správa Bootovacích Prostředí</emphasis>
ru: Выберите пункт меню <menuchoice><guimenu>Файл</guimenu><guimenuitem>Управление средами загрузки</guimenuitem></menuchoice> для открытия диалогового окна <literal>Управление средами загрузки</literal>.

source: In this dialog, you can perform the following actions:
ca: En aquest diàleg, podeu realitzar les següents accions:
cs: V tomto dialogu lze provést následující:
ru: В данном диалоговом окне можно выполнить следующие действия:

source: <emphasis role="strong">Activate a boot environment</emphasis> – Select the boot environment you want to be active on system reboot. This is the default boot environment <emphasis role="strong">after</emphasis> you have rebooted your system.
ca: <emphasis role="strong">Activar un entorn d'arranc</emphasis> – Seleccioneu l'entorn d'arranc que vulgueu que estigui actiu durant l'arranc del sistema. Aquest és l'entorn d'arranc predeterminat <emphasis role="strong">després</emphasis> que reinicieu el vostre sistema.
cs: <emphasis role="strong">Aktivovat bootovací prostředí</emphasis> - Zvolte bootovací prostředí, které si přejete aktivovat po restartu systému. Toto je výchozí bootovací prostředí </emphasis role="strong">po</emphasis> restartování systému.
ru: <emphasis role="strong">Активация загрузочной среды </emphasis>: выберите среду загрузки, которую требуется активировать после перезагрузки системы. Эта загрузочная среда будет использоваться по умолчанию <emphasis role="strong">после</emphasis> перезагрузки системы.

source: <emphasis role="strong">Remove old or unused boot environments to free up disk space</emphasis> – Select the boot environnment or boot environments you want to delete.
ca: <emphasis role="strong">Eliminat els entorns d'arranc antics o sense utilitzar per alliberar espai en el disc</emphasis> – Seleccioneu l'entorn o entorns d'arranc que vulgueu eliminar del vostre sistema.
cs: <emphasis role="strong">Odstranit stará nebo nepoužívaná bootovací prostředí pro uvolnění diskového prostoru</emphasis> - Zvolte jedno nebo více bootovacích prostředí, která chcete smazat.
ru: <emphasis role="strong">Удаление устаревших или неиспользуемых загрузочных сред для освобождения дискового пространства</emphasis>: выберите загрузочные среды, которые требуется удалить.

source: You cannot the delete the currently active boot environment.
ca: No podeu eliminar l'actual entorn d'arranc actiu.
cs: Nemůžete smazat právě aktivní bootovací prostředí.
ru: Активную в настоящий момент среду загрузки удалить невозможно.

source: If you have selected a boot environment to be renamed, it cannot be deleted.
ca: Si heu seleccionat un entorn d'arranc per a ser reanomenat, aquest no es pot eliminar.
cs: Pokud jste vybrali bootovací prostředí, které má být přejmenováno, tak nemůže být smazáno.
ru: Если среда загрузки выбрана для переименования, ее нельзя удалить.

source: <emphasis role="strong">Rename a boot environment</emphasis> – Double-click the boot environment name you want torename. Enter the new name of the boot environment and click <guibutton>OK</guibutton>.
ca: <emphasis role="strong">Reanomenar un entorn d'arranc</emphasis> – Cliqueu dues vegades a l'entorn d'arranc que vulgueu reanomenar. Introduïu el nou nom de l'entorn d'arranc i cliqueu a <guibutton>Acceptar</guibutton>.
cs: <emphasis role="strong">Přejmenovat bootovací prostředí</emphasis> - Poklepejte na bootovací prostředí, které chcete přejmenovat. Uveďte nový název bootovacího prostředí a klikněte na <guibutton>OK</guibutton>.
ru: <emphasis role="strong">Переименование загрузочной среды</emphasis>: дважды щелкните имя загрузочной среды, которое требуется изменить. Введите новое имя и нажмите кнопку <guibutton>OK</guibutton>.

source: If you have selected a boot environment to be deleted, it cannot be renamed.
ca: Si heu seleccionat un entorn d'arranc per a ser eliminat, aquest no pot ser reanomenat.
cs: Pokud jste již vybrali toto prostředí pro smazání, nemůže být přejmenováno.
ru: Если среда загрузки выбрана для обновления, ее нельзя переименовать.

source: The currently active boot environment cannot be renamed.
ca: L'actual entorn d'arranc actiu no pot ser reanomenat.
cs: Právě aktivní bootovací prostředí nemůže být přejmenováno.
ru: Активная загрузочная среда не может быть переименована.

source: Click <guibutton>OK</guibutton> to proceed or <guibutton>Cancel</guibutton> to cancel all changes.
ca: Cliqueu a <guibutton>Acceptar</guibutton> per a procedir, o bé a <guibutton>Cancel·lar</guibutton> per a cancel·lar tots els canvis.
cs: Klikněte na <guibutton>OK</guibutton> pro pokračování nebo na <guibutton>Zrušit</guibutton> pro zrušení všech změn.
ru: Нажмите кнопку <guibutton>OK</guibutton> для продолжения или кнопку <guibutton>Отмена</guibutton> для отмены всех изменений.

source: The <emphasis role="strong">Boot Environment Confirmation</emphasis> dialog is displayed. Review your changes and click OK to proceed.
ca: Es mostra el diàleg <emphasis role="strong">confirmació entorn d'arranc</emphasis>. Reviseu els vostres canvis i cliqueu a Acceptar per a procedir.
cs: Zobrazí se dialog <emphasis role="strong">Potvrzení bootovacího prostředí</emphasis>. Zkontrolujte své změny a klikněte na OK pro pokračování.
ru: Откроется диалоговое окно <emphasis role="strong">Подтверждение загрузочной среды</emphasis>. Проверьте сделанные изменения и нажмите кнопку "OK" для продолжения.

source: After you click <guibutton>OK</guibutton>, you cannot undo any changes that you made to the boot environments.
ca: Després que cliqueu <guibutton>D'acord</guibutton>, no podreu desfer el canvis que feu als entorns d'arranc.
cs: Poté, co kliknete na <guibutton>OK</guibutton>, změny již nelze vrátit zpět.
ru: После нажатия кнопки <guibutton>OK</guibutton> невозможно отменить изменения, внесенные в загрузочные среды.

source: The changes that you made to the <emphasis role="strong">default boot environment</emphasis> setting are effective only after system reboot.
ca: Els canvis que feu a les preferències de l'<emphasis role="strong">entorn d'arranc predeterminat</emphasis> són efectives solament després de reiniciar el sistema.
cs: Změny, které jste provedli v nastavení <emphasis role="strong">výchozího bootovacího prostředí</emphasis> se projeví až po restartování systému.
ru: Изменения, внесенные в <emphasis role="strong"> настройки загрузочной среды по умолчанию</emphasis>, вступают в силу только после перезагрузки системы.

source: Click <guibutton>Cancel</guibutton> to cancel the changes.
ca: Cliqueu a <guibutton>Cancel·lar</guibutton> per a cancel·lar els canvis.
cs: Klikněte na <guibutton>Zrušit</guibutton> pro zrušení všech změn.
ru: Нажмите кнопку <guibutton>Отмена</guibutton> для отмены изменений.

source: Reboot your system to boot into the newly activated boot environment.
ca: Reinicieu el vostre sistema per a arrancar amb el nou entorn d'arranc activat.
cs: Restartujte Váš systém pro nabootování do nově aktivovaného prostředí.
ru: Для загрузки новой активной загрузочный среды по умолчанию перезагрузите систему.

source: Reboot your system only if you changed the active boot environment.
ca: Reinicieu el vostre sistema únicament si heu canviat l'entorn d'arranc actiu.
cs: Restartujte Váš systém pouze, pokud chcete změnit aktivní bootovací prostředí.
ru: Перезагружать систему следует только в случае изменения активной среды загрузки.

source: Add and Manage Publishers
ca: Afegir i gestionar publicadors
cs: Přidat a Spravovat vydavatele
ru: Добавление издателей и управление ими

source: The <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Publishers</guimenuitem></menuchoice> dialog enables the user to add and manage the configured publishers. A publisher is a person, group, or corporation that designs, creates, and publishes a package to a repository. Every publisher has a package repository where its package data can be found. The locations that contain package data for a publisher's repository are defined through the use of origins and mirrors. Origins are used to provide locations that contain the complete set of package data for a publisher, while mirrors are used to provide locations that only contain package files. Origins and mirrors are defined using URIs (Universal Resource Identifiers), such as <ulink url="http://pkg.opensolaris.org/release"/>.
ru: Диалоговое окно <menuchoice><guimenu>Файл</guimenu><guimenuitem>Управление издателями</guimenuitem></menuchoice> позволяет добавлять настроенных издателей и управлять ими. Издатель представляет собой лицо, группу лиц или организацию, которые разрабатывают и формируют пакет, размещаемый затем в хранилище. Каждому издателю соответствует хранилище, в котором располагаются его данные. Местоположения данных пакетов в хранилище издателя определяются посредством источников и зеркал. Источники используются для предоставления местоположений, содержащих полный набор данных пакетов для издателя, а зеркала используются для предоставления местоположений, содержащих исключительно файлы пакетов. Источники и зеркала определяются с помощью URI (универсальных идентификаторов ресурсов), например <ulink url="http://pkg.opensolaris.org/release"/>.

source: Read the following sections to learn how to add and manage publishers on your system.
ru: Ознакомьтесь со следующими разделами, в которых описывается добавление издателей в систему и управление ими.

source: Add a Publisher
ca: Afegir un publicador
cs: Přidat vydavatele
ru: Добавление издателя

source: Perform the following steps to add a publisher and its associated URI:
ca: Realitzeu els següents passos per a afegir un publicador i la seva URI associada:
cs: Proveďte následující kroky pro přidání vydavatele a jeho URI:
ru: Для добавления издателя с соответствующим идентификатором URI необходимо выполнить следующие действия:

source: Choose <menuchoice><guimenu>File</guimenu><guimenuitem>Add Publishers</guimenuitem></menuchoice>.
ca: Seleccioneu <menuchoice><guimenu>Fitxer</guimenu><guimenuitem>Afegir publicadors</guimenuitem></menuchoice>.
cs: Zvolte <menuchoice><guimenu>Soubor</guimenu><guimenuitem>Přidat vydavatele</guimenuitem></menuchoice>.
ru: Выберите пункт меню <menuchoice><guimenu>Файл</guimenu><guimenuitem>Добавить издателей</guimenuitem></menuchoice>.

source: You can also choose the <guibutton>Add..</guibutton> option from the <emphasis role="strong">Publisher</emphasis> drop-down menu or select <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Publishers</guimenuitem></menuchoice> and then click <emphasis>Add..</emphasis> in the <emphasis role="strong">Manage Publishers</emphasis> dialog.
ca: També podeu selecciona l'opció <guibutton>Afegir..</guibutton> des del menú desplegable <emphasis role="strong">Publicador</emphasis> o seleccionar <menuchoice><guimenu>Fitxer</guimenu><guimenuitem>Gestionar publicadors</guimenuitem></menuchoice> i després clicar a <emphasis>Afegir..</emphasis> en el diàleg <emphasis role="strong">Gestionar publicadors</emphasis>.
cs: Je také možno zvolit možnost <guibutton>Přidat...</guibutton> z rozbalovací nabídky <emphasis role="strong">Vydavatel</emphasis> nebo zvolit <menuchoice><guimenu>Soubor</guimenu><guimenuitem>Spravovat vydavatele</guimenuitem></menuchoice> a poté kliknout na <emphasis>Přidat...</emphasis> v dialogu <emphasis role="strong">Spravovat vydavatele</emphasis>.
ru: Также можно выбрать пункт <guibutton>Добавить..</guibutton> в раскрывающемся меню <emphasis role="strong">Издатель</emphasis> или выбрать пункт меню <menuchoice><guimenu>Файл</guimenu><guimenuitem>Управление издателями</guimenuitem></menuchoice>, а затем выбрать <emphasis>Добавить..</emphasis> в диалоговом окне <emphasis role="strong">Управление издателями</emphasis>.

source: The <emphasis role="strong">Add Publisher</emphasis> dialog is displayed. Enter the name of the publisher and the associated URI. If the publisher is a secure publisher, the <emphasis role="strong">SSL Key</emphasis> and <emphasis role="strong">SSL Certificate</emphasis> fields are displayed. Follow the steps in the <xref linkend="modify-publisher"/> section to add an SSL key and certificate.
ca: Es mostra el diàleg <emphasis role="strong">Afegir publicador</emphasis>. Introduïu el nom del publicador i la seva URI associada. Si el publicador és un publicador segur, es mostren els camps de la <emphasis role="strong">Clau SSL</emphasis> i el <emphasis role="strong">Certificat SSL</emphasis>. Seguiu els passos de la secció <xref linkend="modify-publisher"/> per afegir una clau i un certificat SSL.
cs: Zobrazí se dialog <emphasis role="strong">Přidat vydavatele</emphasis>. Uveďte název vydavatele a jeho URI. Pokud je vydavatel zabezpečeným vydavatelem, jsou zobrazena políčka <emphasis role="strong">SSL Klíč</emphasis> a <emphasis role="strong">SSL Certifikát</emphasis>. Pro přidání SSL klíče a certifikátu postupujte podle kroků v sekci <xref linkend="modify-published"/> SSL Klíč a Certifikát .
ru: Откроется диалоговое окно <emphasis role="strong">Добавление издателя</emphasis>. Введите имя издателя и связанный с ним идентификатор URI. Если издатель является защищенным, отображаются поля <emphasis role="strong">Ключ SSL</emphasis> и <emphasis role="strong">Сертификат SSL</emphasis>. Для добавления ключа и сертификата SSL воспользуйтесь последовательностью действий, приведенной в разделе <xref linkend="modify-publisher"/>.

source: Click <guibutton>Add</guibutton>.
ca: Cliqueu a <guibutton>Afegir</guibutton>.
cs: Klikněte na <guibutton>Přidat</guibutton>.
ru: Нажмите кнопку <guibutton>Добавить</guibutton>.

source: The <emphasis role="strong">Adding Publisher</emphasis> dialog is displayed. Click Cancel to cancel the process.
ca: es mostra el diàleg <emphasis role="strong">Afegint publicador</emphasis>. Cliqueu a Cancel·lar per a cancel·lar el procés.
cs: Zobrazí se dialog <emphasis role="strong">Přidávání vydavatele</emphasis>. Klikněte na Zrušit pro zrušení procesu.
ru: Откроется диалоговое окно <emphasis role="strong">Добавление издателя</emphasis>. Для отмены процесса нажмите кнопку "Отмена".

source: The <emphasis role="strong">Adding Publisher Complete</emphasis> dialog is displayed if the publisher is added successfully.
ca: Es mostra el diàleg <emphasis role="strong">Completat afegint publicador</emphasis> si el publicador va ser afegit de forma correcta.
cs: V případě úspěšného přidání vydavatele se zobrazí dialog <emphasis role="strong">Přidání vydavatele dokončeno</emphasis>.
ru: В случае успешного добавления издателя выводится диалоговое окно <emphasis role="strong">Добавление издателя завершено</emphasis>.

source: An <emphasis role="strong">Adding Publisher Error</emphasis> is displayed if the publisher could not be added. Click <emphasis role="strong">Details</emphasis> to get more information about the error.
ca: Es mostra un diàleg <emphasis role="strong">Error afegint publicador</emphasis> si el publicador no es va poder afegir. Cliqueu a <emphasis role="strong">Detalls</emphasis> per a obtenir més informació quant a l'error.
cs: Pokud se přidání vydavatele nezdařilo zobrazí se dialog <emphasis role="strong">Chyba při přidávání vydavatele</emphasis>. Klikněte na <emphasis role="strong">Podrobnosti</emphasis> pro získání více informací o chybě.
ru: Если добавление издателя невозможно, выводится сообщение <emphasis role="strong">Ошибка при добавлении издателя</emphasis>. Для получения дополнительных сведений об ошибке нажмите кнопку <emphasis role="strong">Сведения</emphasis>.

source: Remove a Publisher
ca: Treure un publicador
cs: Odstranit vydavatele
ru: Удаление издателя

source: Choose <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Publishers</guimenuitem></menuchoice>.
ca: Seleccioneu <menuchoice><guimenu>Fitxer</guimenu><guimenuitem>Gestionar publicadors</guimenuitem></menuchoice>.
cs: Zvolte <menuchoice><guimenu>Soubor</guimenu><guimenuitem>Správa vydavatelů</guimenuitem></menuchoice>.
ru: Выберите пункт меню <menuchoice><guimenu>Файл</guimenu><guimenuitem>Управление издателями</guimenuitem></menuchoice>.

source: Click on a publisher from the list to select it. Click <guibutton>Remove</guibutton>.
ca: Cliqueu al damunt d'un publicador per a selecciona'l. Cliqueu a <guibutton>treure</guibutton>.
cs: Klikněte na vydavatele ze seznamu pro jeho vybrání. Klikněte na <guibutton>Odebrat</guibutton>.
ru: В списке щелкните издателя, чтобы выбрать его. Нажмите кнопку <guibutton>Удалить</guibutton>.

source: The <emphasis role="strong">Manage Publishers Confirmation</emphasis> dialog is displayed.
ca: Es mostra el diàleg <emphasis role="strong">Confirmació gestió publicadors</emphasis>.
cs: Je zobrazen dialog <emphasis role="strong">Potvrzení správy vydavatelů</emphasis>.
ru: Откроется диалоговое окно <emphasis role="strong">Подтверждение управления издателями</emphasis>.

source: Click <guibutton>OK</guibutton> to save the changes and remove the publisher or <guibutton>Cancel</guibutton> to return to the <emphasis role="strong">Manage Publishers</emphasis> dialog without making any changes.
ca: Cliqueu a <guibutton>Acceptar</guibutton> per a desar els canvies i treure el publicador, o bé a <guibutton>Cancel·lar</guibutton> per a retornar al diàleg <emphasis role="strong">Gestionar publicadors</emphasis> sense fer cap canvi.
cs: Klikněte na <guibutton>OK</guibutton> pro uložení změn a odebrání vydavatele nebo na <guibutton>Zrušit</guibutton> pro navrácení se k dialogu <emphasis role="strong">Správa vydavatelů</emphasis> bez provedení jakýchkoli změn.
ru: Нажмите кнопку <guibutton>OK</guibutton> для сохранения изменений и удаления издателя, либо кнопку <guibutton>Отмена</guibutton> для возврата к диалоговому окну <emphasis role="strong">Управление издателями</emphasis> без внесения изменений.

source: Set Publisher Priority
ca: Establir la prioritat del publicador
cs: Nastavit Prioritu Vydavatele
ru: Настройка приоритета издателя

source: Perform the following steps to set or change the publisher priority:
ca: Realitzeu els següent passos per establir o canviar la prioritat d'un publicador:
cs: Pro nastavení nebo změnu priorit vydavatelů proveďte následující kroky:
ru: Выполните следующие действия для настройки или изменения приоритета издателя:

source: Choose <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Publishers</guimenuitem></menuchoice> to open the <emphasis role="strong">Manage Publishers</emphasis> dialog.
ca: Seleccioneu <menuchoice><guimenu>Fitxer</guimenu><guimenuitem>Gestionar publicadors</guimenuitem></menuchoice> per obrir el diàleg <emphasis role="strong">Gestionar publicadors</emphasis>.
cs: Zvolte <menuchoice><guimenu>Soubor</guimenu><guimenuitem>Správa vydavatelů</guimenuitem></menuchoice> pro otevření dialogu <emphasis role="strong">Správa vydavatelů</emphasis>
ru: Выберите в меню <menuchoice><guimenu>Файл</guimenu><guimenuitem>Управление издателями</guimenuitem></menuchoice> для открытия диалогового окна <literal>Управление издателями</literal>.

source: The list of configured publishers is displayed. Click the arrows to change the priority of the publishers. The publisher with the highest priority is displayed at the top of the list.
ca: Es mostra el llistat dels publicadors configurats. Cliqueu a les fletxes per a canviar la prioritat dels publicadors. El publicador amb la prioritat més alta és mostrat a la part superior del llistat.
cs: Je zobrazen seznam nastavených vydavatelů. Kliknutím na šipky změníte priority vydavatelů. Vydavatel s nejvyšší prioritou je zobrazen na začátku seznamu.
ru: Выводится список настроенных издателей. Для изменения приоритета издателей щелкните соответствующие стрелки требуемое количество раз. Издатель с наивысшим приоритетом выводится в начале списка.

source: Packages are searched within the publishers in the order of priority, the publisher with the highest priority is searched first.
ca: La cerca de paquets es realitza mitjançant l'ordre de prioritat dels publicadors, Primer es cerca al publicador amb la prioritat més alta.
cs: Balíčky jsou vyhledávány v rámci vydavatelů na základě priorit, vydavatel nejvyšší priority je prohledáván jako první.
ru: Поиск пакетов по издателям осуществляется в порядке приоритета, т.е. сначала выполняется поиск по издателю с наивысшим приоритетом.

source: Click <guibutton>OK</guibutton> to save your changes or <guibutton>Cancel</guibutton> to return to the <emphasis role="strong">Manage Publishers</emphasis> dialog without making any changes.
ca: Cliqueu a <guibutton>Acceptar</guibutton> per a desar els canvis, o bé a <guibutton>Cancel·lar</guibutton> per a retornar al diàleg <emphasis role="strong">Gestionar publicadors</emphasis> sense fer cap canvi.
cs: Klikněte na <guibutton>OK</guibutton> pro uložení změn nebo na <guibutton>Zrušit</guibutton> pro navrácení se k dialogu <emphasis role="strong">Správa vydavatelů</emphasis> bez provedení jakýchkoli změn.
ru: Нажмите кнопку <guibutton>OK</guibutton> для сохранения изменений, либо кнопку <guibutton>Отмена</guibutton> для возврата к диалоговому окну <emphasis role="strong">Управление издателями</emphasis> без внесения изменений.

source: Modify Publisher Alias
ca: Modificar l'àlies del publicador
cs: Upravit Alias Vydavatele
ru: Изменение псевдонима издателя

source: Perform the following steps to modify the alias of a publisher:
ca: realitzeu els següents passos per a modificar l'àlies d'un publicador:
cs: Pro upravení aliasu vydavatele proveďte následující kroky:
ru: Для изменения псевдонима издателя необходимо выполнить следующие действия:

source: Select the publisher whose alias you want to modify. Click <guibutton>Modify..</guibutton>.
ca: Seleccioneu el publicador pel qual voleu modificar el seu àlies. Cliqueu a <guibutton>Modificar..</guibutton>.
cs: Zvolte vydavatele, jehož alias chcete upravit. Klikněte na <guibutton>Upravit..</guibutton>.
ru: Выберите издателя, псевдоним которого требуется изменить. Нажмите кнопку <guibutton>Изменить..</guibutton>.
