Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: The <emphasis role="strong">Modify Publisher</emphasis> dialog is displayed. Modify or enter a new name of the alias in the <emphasis role="strong">Alias</emphasis> field.
ca: Es mostra el diàleg <emphasis role="strong">Modificar publicador</emphasis>. Modifiqueu o introduïu un nou nom de l'àlies en el camp <emphasis role="strong">Àlies</emphasis>.
cs: Zobrazí se dialog <emphasis role="strong">Úpravit Vydavatele</emphasis>. Změňte název nebo uveďte nový název aliasu do políčka <emphasis role="strong">Alias</emphasis>.
ru: Откроется диалоговое окно <emphasis role="strong">Изменить издателя</emphasis>. Измените псевдоним или введите новый в поле <emphasis role="strong">Псевдоним</emphasis>.

source: Click <guibutton>OK</guibutton> in the <emphasis role="strong">Manage Publishers</emphasis> dialog to exit the dialog. Note that clicking <guibutton>Cancel</guibutton> in the <emphasis role="strong">Manage Publishers</emphasis> dialog will not undo the changes made in the <emphasis role="strong">Modify Publishers</emphasis> dialog.
ca: Cliqueu a <guibutton>Acceptar</guibutton> en el diàleg <emphasis role="strong">Gestionar publicadors</emphasis> per sortir del diàleg. Tingueu en compte que al clicar a <guibutton>Cancel·lar</guibutton> en el diàleg <emphasis role="strong">Gestionar publicadors</emphasis> no desfarà els canvis fets en el diàleg <emphasis role="strong">Modificar publicadors</emphasis>.
cs: Klikněte na <guibutton>OK</guibutton> v dialogu <emphasis role="strong">Správa vydavatelů</emphasis> pro zavření dialogu. Upozorňujeme, že kliknutí na <guibutton>Zrušit</guibutton> v dialogu <emphasis role="strong">Správa vydavatelů</emphasis> nezruší změny provedené v dialogu <emphasis role="strong">Upravit Vydavatele</emphasis>
ru: Нажмите кнопку <guibutton>OK</guibutton> в диалоговом окне <emphasis role="strong">Управление издателями</emphasis> для закрытия диалогового окна. Отметим, что при нажатии кнопки <guibutton>Отмена</guibutton> в диалоговом окне<emphasis role="strong">Управление издателями</emphasis> не отменяются изменения, внесенные в диалоговом окне <emphasis role="strong">Изменение издателей</emphasis> dialog.

source: Add Publisher Origins
ca: Afegir orígens publicador
cs: Přidat Zdroj Vydavatele
ru: Добавление источников издателя

source: Perform the following steps to add an origin or origins associated with a publisher:
ca: Realitzeu els següents passos per a afegir o associar orígens a un publicador:
cs: Pro přidání jednoho nebo více zdrojů vydavatele proveďte následující kroky:
ru: Для добавления источникa или источников, связанных с издателем, можно выполнить следующую последовательность действий:

source: Select the publisher whose origin you want to modify. The <emphasis role="strong">Details</emphasis> tab in the <emphasis role="strong">Manage Publishers</emphasis> dialog displays the origin associated with the publisher.
ca: Seleccioneu el publicador pel qual voleu modificar el seu origen. La pestanya <emphasis role="strong">Detalls</emphasis> en el diàleg <emphasis role="strong">Gestionar publicadors</emphasis> mostra l'origen associat amb el publicador.
cs: Zvolte vydavatele, jehož zdroj chcete upravit. Záložka <emphasis role="strong">Podrobnosti</emphasis> v dialogu <emphasis role="strong">Správa vydavatelů</emphasis> zobrazí zdroj vydavatele.
ru: Выберите издателя, для которого требуется изменить источники. Источник, связанный с издателем, выводится на закладке <emphasis role="strong">Сведения</emphasis> в диалоговом окне <emphasis role="strong">Управление издателями</emphasis>.

source: Click <guibutton>Modify..</guibutton>.
ca: Cliqueu a <guibutton>Modificar..</guibutton>.
cs: Klikněte na <guibutton>Změnit..</guibutton>.
ru: Нажмите кнопку <guibutton>Изменить..</guibutton>.

source: The <emphasis role="strong">Modify Publisher</emphasis> dialog is displayed. Enter the name of the new origin you want to associate with the publisher in the <emphasis role="strong">Origin</emphasis> field. Click <guibutton>Add</guibutton>. The list of associated origins is displayed in the table.
ca: Es mostra el diàleg <emphasis role="strong">Modificar publicador</emphasis>. Introduïu el nom del nou origen que voleu associar amb el publicador en el camp <emphasis role="strong">Origen</emphasis>. Cliqueu a <guibutton>Ageir</guibutton>. En una taula es mostra el llistat d'orígens associats.
cs: Zobrazí se dialog <emphasis role="strong">Upravit vydavatele</emphasis>. Uveďte jméno nového zdroje, který si přejete přiřadit vydavateli do políčka <emphasis role="strong">Zdroj</emphasis>. Klikněte na <guibutton>Přidat</guibutton>. V tabulce je zobrazen seznam zdrojů.
ru: Откроется диалоговое окно <emphasis role="strong">Изменение издателя</emphasis>. Введите имя нового источника, который требуется связать с издателем в поле <emphasis role="strong">Источник</emphasis>. Нажмите кнопку <guibutton>Добавить</guibutton>. В таблице выводится список связанных источников.

source: You cannot change the origin URI after the origin has been added.
ca: No podeu canviar la URI origen després que hagi estat afegit l'origen.
cs: Není již možno změnit URI zdroje poté, co byl již přidán.
ru: После добавления источника изменить его URI невозможно.

source: (optional) If the origin you have added is a secure origin, add the SSL Key and SSL certificate. <guibutton>Browse</guibutton> to locate the SSL Key and SSL Certificate on your system.
ca: (opcional) Si l'origen que heu afegit és un origen segur, afegiu la clau i el certificat SSL. <guibutton>Navegueu</guibutton> per a localitzar la clau i el certificat SSL al vostre sistema.
cs: (volitelné) Pokud je přidaný zdroj zabezpečený, přidejte SSL Klíč a SSL Certifikát. Klikněte na <guibutton>Procházet</guibutton> pro nalezení SSL Klíče a SSL Certifikátu na vašm systému.
ru: (Необязательно) Если добавленный источник является защищенным, добавьте ключ SSL и сертификат SSL. Для поиска ключа и сертификата SSL в системе нажмите кнопку <guibutton>Обзор</guibutton>.

source: Remove Publisher Origins
ca: Treure orígens del publicador
cs: Odebrat Zdroj Vydavatelů
ru: Удаление источников издателя

source: Perform the following steps to remove an origin or origins associated with a publisher:
ca: Realitzeu els següents passos per a treure un origen, o orígens associats am un publicador:
cs: Pro odebrání jednoho nebo více zdrojů vydavatele proveďte následující kroky.
ru: Для удаления источникa или источников, связанных с издателем, можно выполнить следующую последовательность действий:

source: Select the publisher whose origin you want to remove. The <emphasis role="strong">Details</emphasis> tab in the <emphasis role="strong">Manage Publishers</emphasis> dialog displays the origin or origins associated with the publisher.
ca: Seleccioneu el publicador pel qual voleu treure l'origen. La pestanya <emphasis role="strong">Detalls</emphasis> en el diàleg <emphasis role="strong">Gestionar publicadors</emphasis> mostra l'origen o es orígens associats a un publicador.
cs: Zvolte vydavatele, jehož zdroj si přejete odebrat. Záložka <emphasis role="strong">Podrobnosti</emphasis> v dialogu <emphasis role="strong">Správa vydavatelů</emphasis> zobrazí jeden nebo více zdrojů daného vydavatele.
ru: Выберите издателя, источники которого требуется удалить. Источник или источники, связанные с издателем, выводятся на закладке <emphasis role="strong">Сведения</emphasis> в диалоговом окне <emphasis role="strong">Управление издателями</emphasis>.

source: The <emphasis role="strong">Modify Publisher</emphasis> dialog is displayed. The list of associated origins is displayed in the table.
ca: Es mostra el diàleg <emphasis role="strong">Modificar publicar</emphasis>. els llistat dels orígens associats és mostrat en una taula.
cs: Zobrazí se dialog <emphasis role="strong">Upravit Vydavatele</emphasis>. V tabulce je zobrazen seznam zdrojů daného vydavatele.
ru: Откроется диалоговое окно <emphasis role="strong">Изменение издателя</emphasis>. В таблице выводится список связанных источников.

source: Select the origin you want to remove. Click <guibutton>Remove</guibutton>.
ca: Seleccioneu l'origen que voleu treure. Cliqueu a <guibutton>Treure</guibutton>.
cs: Zvolte Zdroj, který si přejete odebrat. Klikněte na <guibutton>Odebrat</guibutton>.
ru: Выберите источник, который требуется удалить. Нажмите кнопку <guibutton>Удалить</guibutton>.

source: If only one origin is associated with a publisher, it cannot be removed.
ca: Si únicament està associat un origen a un publicador, aquest no es pot treure.
cs: Pokud má vydavatel přiřazen pouze jeden zdroj, nelze jej odebrat.
ru: Если с издателем связан только один источник, удалить его невозможно.

source: Add Publisher Mirrors
ca: Afegir rèpliques de publicadors
cs: Přidat Mirror Vydavatele
ru: Добавление зеркал издателя

source: Perform the following steps to add a mirror for a publisher:
ca: Realitzeu els següents passos per a afegir una rèplica pel publicador:
cs: Proveďte následující kroky pro přidání mirroru vydavatele:
ru: Для добавления зеркала издателя необходимо выполнить следующую последовательность действий:

source: Select the publisher for which you want to add the mirror.
ca: Seleccioneu el publicador pel qual voleu afegir una rèplica.
cs: Vyberte vydavatele, pro kterého chcete přidat mirror.
ru: Выберите издателя, для которого требуется добавить зеркало.

source: The <emphasis role="strong">Modify Publisher</emphasis> dialog is displayed.
ca: Es mostra el diàleg <emphasis role="strong">Modificar publicador</emphasis>.
cs: Zobrazí se dialog <emphasis role="strong">Upravit Vydavatele</emphasis>
ru: Откроется диалоговое окно <emphasis role="strong">Изменение издателя</emphasis>.

source: Enter the URI for the mirror in the <emphasis>Mirror</emphasis> field. Click <guibutton>Add</guibutton>.
ca: Introduïu la URI per la rèplica en el camp <emphasis>Rèplica</emphasis>. Cliqueu a <guibutton>Afegir</guibutton>.
cs: Zadejte URI pro mirror do pole <emphasis>Mirror</emphasis>. Klikněte na <guibutton>Přidat</guibutton>.
ru: Введите URI зеркала в поле <emphasis>Зеркало</emphasis>. Нажмите кнопку <guibutton>Добавить</guibutton>.

source: Remove Publisher Mirrors
ca: Treure rèpliques de publicadors
cs: Odstranit Mirror Vydavatele
ru: Удаление зеркал издателя

source: Perform the following steps to remove a mirror associated with a publisher:
ca: Realitzeu els següents passos per a treure una rèplica associada amb un publicador:
cs: Proveďte následující kroky pro odstranění mirroru vydavatele:
ru: Для удаления зеркала, связанного с издателем, можно выполнить следующую последовательность действий:

source: Select the publisher for which you want to remove the mirror.
ca: Seleccioneu el publicador pel qual voleu treure la rèplica.
cs: Vyberte vydavatele, pro kterého chcete mirror odstranit.
ru: Выберите издателя, зеркало которого требуется удалить.

source: The <emphasis role="strong">Modify Publisher</emphasis> dialog is displayed. The list of associated mirrors is displayed in the table.
ca: Es mostra el diàleg <emphasis role="strong">Modificar publicador</emphasis>. El llistat de les rèpliques associades és mostrat en un taula.
cs: Zobrazí se dialog <emphasis role="strong">Upravit Vydavatele</emphasis> se seznamem mirrorů pro daného vydavatele.
ru: Откроется диалоговое окно <emphasis role="strong">Изменение издателя</emphasis>. В таблице выводится список связанных зеркал.

source: Select the mirror you want to remove. Click <guibutton>Remove</guibutton>.
ca: Seleccioneu la replica que voleu treure. Cliqueu a <guibutton>Treure</guibutton>.
cs: Vyberte mirror, který chcete odstranit a klikněte na <guibutton>Odstranit</guibutton>.
ru: Выберите зеркало, которое требуется удалить. Нажмите кнопку <guibutton>Удалить</guibutton>.

source: The OpenSolaris 2010.03 Package Manager provides support for users to add new publishers and optionally, install packages from these publishers using a simple one-click WebInstall process. A <filename>.p5i</filename> file which contains the publishers to be added and optionally, the packages that can be installed from these publishers, is required for the WebInstall process. The information contained in the <filename>.p5i</filename> file is read and used by the WebInstall process.
ca: El Gestor de paquets d'OpenSolaris 2010.03 proporciona suport als usuaris per afegir nous publicadors i opcionalment, instal·lar paquets des d'aquests publicadors mitjançant el procés WebInstall en un sol clic. Un fitxer <filename>.p5i</filename> el qual conté els publicadors a ser afegits i opcionalment, els paquets que poden ser instal·lats des d'aquests publicadors, és necessari pel procés WebInstall. La informació continguda en el fitxer <filename>.p5i</filename> és llegida i utilitzada pel procés WebInstall.
cs: Správce Balíčků pro OpenSolaris 2010.03 poskytuje podporu, aby uživatelé mohli přidávat nové vydavatele a volitelně, aby mohli instalovat balíčky z těchto vydavatelů jednoduše pomocí jednoho kliknutí v procesu WebInstalace. Pro proces WebInstalace je vyžadován <filename>.p5i</filename> soubor, který obsahuje vydavatele pro přidání a volitelně balíčky, které mohou být nainstalovány z těchto vydavatelů. Obsah souboru <filename>.p5i</filename> je poté přečten a použit v procesu WebInstalace.
ru: Диспетчер пакетов OpenSolaris 2010.03 обеспечивает возможность добавления новых издателей, а также установки пакетов от этих издателей с помощью простого процесса веб-установки одним щелчком. Для веб-установки требуется файл <filename>.p5i</filename>, содержащий добавляемых издателей и, возможно, пакет или пакеты, которые можно получить у этих издателей и установить. Данные, содержащиеся в файле <filename>.p5i</filename>, считываются и используются процессом веб-установки.

source: Export Package Selections as WebInstall Files
ca: Exportar seleccions de fitxers com un fitxer WebInstall
cs: Export výběru balíčků jako soubory WebInstalace
ru: Экспорт набора пакетов в виде файлов веб-установки

source: If you want to distribute some of the packages available on your system to others for easy installation and distribution, you can export the references to the packages, using the WebInstall process. The <menuchoice><guisubmenu>File</guisubmenu><guimenuitem>Export Selections</guimenuitem></menuchoice> feature enables you to create a <filename>.p5i</filename> file containing the installation instructions for the selected packages. The <filename>.p5i</filename> file is can then be distributed for use. See the <xref linkend="webinstall"/> section on how to install packages from a <filename>.p5i</filename>.
ca: Si voleu distribuir alguns dels paquets disponibles en el vostre sistema a altres per a una senzilla instal·lació i distribució, podeu exportar les referències als paquets, utilitzant el procés WebInstall. La característica <menuchoice><guisubmenu>Fitxer</guisubmenu><guimenuitem>Exportar Seleccions</guimenuitem></menuchoice> us permet crear un fitxer <filename>.p5i</filename> que conté les instruccions d'instal·lació pels paquets seleccionats. El fitxer <filename>.p5i</filename> pot ser posteriorment distribuït. Vegeu la secció <xref linkend="webinstall"/> per a com instal·lar paquets des de fitxers <filename>.p5i</filename>.
cs: Pokud si přejete distribuovat některé balíčky dostupné na Vašem systému, můžete exportovat jejich obsah do balíčku pomocí procesu WebInstalace. Nabídka <menuchoice><guisubmenu>Soubor</guisubmenu><guimenuitem>Exportovat výběr</guimenuitem></menuchoice> Vám umožní vytvořit <filename>.p5i</filename> soubor s instrukcemi, jak nainstalovat vybrané balíčky. Viz <xref linkend="webinstall"/> sekce Jak instalovat balíčky z <filename>.p5i</filename> souboru.
ru: Если требуется распространять пакеты, установленные в системе, другим пользователям в целях упрощения установки и дальнейшего распространения, ссылки на пакеты можно экспортировать с помощью процесса веб-установки. Функция <menuchoice><guisubmenu>Файл</guisubmenu><guimenuitem>Экспорт наборов</guimenuitem></menuchoice> позволяет создать файл <filename>.p5i</filename>, содержащий указания по установке для выбранных пакетов. Файл <filename>.p5i</filename> можно затем распространять для дальнейшего использования. Указания по установке пакетов из файла <filename>.p5i</filename> приведены в разделе <xref linkend="webinstall"/>.

source: The following procedure lists the steps to create a <filename>.p5i</filename> file and export your files.
ca: El següent procediment llista els passos per a crear un fitxer <filename>.p5i</filename> i exportar els vostres fitxers.
cs: V následujícím postupu je vytvořen seznam kroků pro vytvoření <filename>.p5i</filename> souboru a exportu Vašich souborů.
ru: В приведенной ниже последовательности действий указаны шаги, требуемые для создания файла <filename>.p5i</filename> и экспорта файлов.

source: From the <emphasis role="strong">Publisher</emphasis> drop-down menu, select the publisher from which you want to include the packages in the <filename>.p5i</filename> file.
ca: Des del menú desplegable <emphasis role="strong">Publicador</emphasis>, seleccioneu el publicador des del qual voleu incloure els paquets en el fitxer <filename>.p5i</filename>.
cs: Z vysunovací nabídky <emphasis role="strong">Vydavatel</emphasis> vyberte vydavatele, ze kterého chcete vybrat balíčky pro vytvoření <filename>.p5i</filename> souboru.
ru: Выберите издателя, пакеты которого требуется включить в файл <filename>.p5i</filename>, из раскрывающегося меню <emphasis role="strong">Издатель</emphasis>.

source: Check the box next to the package or packages to select it. The packages selected are highlighted.
ca: Marque la casella que esta a la vora del paquet per a selecciona'l. Els paquets seleccionats són ressaltats.
cs: Pro výběr balíčku zaškrtněte políčko vedle balíčku. Vybrané balíčky jsou zvýrazněny.
ru: Выберите пакет или пакеты путем установки флажков рядом с ними. Выбранные пакеты отмечаются выделением.

source: Click <menuchoice><guisubmenu>File</guisubmenu><guimenuitem>Export Selections</guimenuitem></menuchoice> to display the <emphasis role="strong">Export Selections Confirmation</emphasis> window.
ca: Cliqueu a <menuchoice><guisubmenu>Fitxer</guisubmenu><guimenuitem>Exportar seleccions</guimenuitem></menuchoice> per a mostrar la finestra <emphasis role="strong">Confirmació exportar seleccions</emphasis>.
cs: Klikněte na <menuchoice><guisubmenu>Soubor</guisubmenu><guimenuitem>Export Výběru</guimenuitem></menuchoice> pro zobrazení okna <emphasis role="strong">Potvrzení Exportu Výběru</emphasis>.
ru: Откройте окно <emphasis role="strong">Подтверждение экспорта наборов</emphasis> путем выбора пункта меню <menuchoice><guisubmenu>Файл</guisubmenu><guimenuitem>Экспорт наборов</guimenuitem></menuchoice>.

source: Click <guibutton>OK</guibutton> to confirm the selections and proceed or <guibutton>Cancel</guibutton> to cancel the selections.
ca: Cliqueu a <guibutton>Acceptar</guibutton> per aconfirmar les seleccions i procedir, o bé a <guibutton>Cancel·lar</guibutton> per a cancel·lar les seleccions.
cs: Klikněte na <guibutton>OK</guibutton> pro potvrzení výběru a pokračování nebo stiskněte <guibutton>Zrušit</guibutton> pro zrušení výběru.
ru: Для подтверждения выбора и продолжения нажмите кнопку <guibutton>OK</guibutton>; для отмены выбора нажмите кнопку <guibutton>Отмена</guibutton>.

source: The <emphasis role="strong">Export Selections</emphasis> window is displayed.
ca: Es mostra la finestra <emphasis role="strong">Exportar seleccions</emphasis>.
cs: Zobrazí se okno <emphasis role="strong">Export Výběru</emphasis>
ru: Откроется окно <emphasis role="strong">Экспорт наборов</emphasis>.

source: A default name for the <filename>p5i</filename> file with the extension <filename>.p5i</filename> is provided. Click inside the <emphasis role="strong">Name</emphasis> field to change the name of the <filename>p5i</filename> file.
ca: Es proporciona un nom predeterminat pel fitxer <filename>p5i</filename> amb l'extensió <filename>.p5i</filename>. Cliqueu a l'interior del camp <emphasis role="strong">Nom</emphasis> per canviar el nom del fitxer <filename>p5i</filename>.
cs: Zobrazí se výchozí jméno <filename>p5i</filename> souboru s příponou <filename>p5i</filename>. Klikněte na do pole <emphasis role="strong">Jméno</emphasis> a změňte jméno <filename>p5i</filename> souboru.
ru: Для файла <filename>p5i</filename> подставляется имя по умолчанию с расширением <filename>.p5i</filename>. Щелкните внутри поля <emphasis role="strong">Имя</emphasis> и измените имя файла <filename>p5i</filename>.

source: The file is saved in the <filename>/tmp</filename> folder by default. Click the <emphasis role="strong">Browse for other folders</emphasis> tab to select your own folder.
ca: Per defecte el fitxer és desat a la carpeta <filename>/tmp</filename>. cliqueu a la pestanya <emphasis role="strong">navegar per altres carpetes</emphasis> per a seleccionar la vostra pròpia carpeta.
cs: Soubor se uloží do výchozího adresáře <filename>/tmp</filename>. Klikněte na záložku <emphasis role="strong">Procházet jiné adresáře</emphasis>pro výběr vlastního adresáře.
ru: По умолчанию файл сохраняется в папке <filename>/tmp</filename>. Для выбора собственной папки перейдите на вкладку <emphasis role="strong">Обзор других папок</emphasis>.

source: Choose the <filename>p5i Files</filename> option in the drop-down menu located at the bottom right hand side of the window.
ca: Seleccioneu l'opció <filename>Fitxers p5i</filename> en el menú desplegable localitzat a la part inferior del cantó dret de la finestra.
cs: Z vysunovací nabídky umístěné v pravé dolní části okna vyberte možnost <filename>p5i Soubory</filename>.
ru: Выберите пункт <filename>Файлы p5i</filename> в раскрывающемся меню в нижнем правом углу окна.

source: How to Use WebInstall to Add Publishers and Install Packages
ca: Com utilitzar WebInstall per a afegir publicadors i instal·lar paquets
cs: Jak Použít WebInstalaci pro Přidání Vydavatele a Instalaci Balíčků
ru: Использование веб-установки для добавления источников и установки пакетов

source: Locate the <filename>.p5i</filename> file which may be present on your desktop, the Start page in the Package Manager, or on a website.
ca: Localitzeu el fitxer <filename>.p5i</filename> que pot estar present al vostre escriptori, la Pàgina d'inici del Gestor de Paquets, o bé en un lloc web.
cs: Najděte soubor <filename>.p5i</filename>, který může být přítomný na Vaší pracovní ploše, na Úvodní stránce Správce balíčků nebo na webových stránkách.
ru: Найдите файл <filename>.p5i</filename>, который может располагаться на рабочем столе, на начальной странице диспетчера пакетов или на веб-сайте.

source: Start the Package Manager in WebInstall mode in one of the following ways:
ca: Inicieu el Gestor de paquets en mode WebInstall en una de les següents maneres:
cs: Spusťte Správce Balíčku v módu WebInstalace následujícími způsoby:
ru: Запустите диспетчер пакетов в режиме веб-установки одним из следующих способов:

source: Click on a <filename>.p5i</filename> file on your desktop, and the associated application, Package Manager in WebInstall mode, will be launched.
ca: Cliqueu al fitxer <filename>.p5i</filename> del vostre escriptori, i l'aplicació associada, Gestor de Paquets amb mode Instal·lació Web, la llançarà.
cs: Klikněte na soubor <filename>.p5i</filename> na Vaší pracovní ploše. Spustí se aplikace Správce Balíčků v módu WebInstall.
ru: Щелкните файл <filename>.p5i</filename> на рабочем столе, после чего запустится связанное с ним приложение, т.е. диспетчер пакетов в режиме веб-установки.
