Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: If the “Remember current state on exit” box is checked, Package Manager saves the following settings and restores them the next time you start Package Manager:
de: Wenn das Kontrollkästchen "Aktuellen Status beim Beenden beibehalten" markier ist, speichert der Package Manager die folgenden Einstellungen und stellt sie beim nächsten Starten des Package Manager wieder her:
es: Si el cuadro "Recordar estado actual al salir" está marcado, Package Manager guarda la siguiente configuración y la restaura la próxima vez que inicia Package Manager:
ja: 「終了時に現在の状態を記憶する」ボックスにチェックマークが付いている場合、パッケージマネージャーは次の設定を保存し、次回起動時にそれらを復元します。
ko: "종료 시 현재 상태 저장" 상자가 선택된 경우 패키지 관리자가 다음 설정을 저장하여 다음 번에 패키지 관리자를 시작할 때 복원합니다.
zh_hk: 如果核取 [結束時記住目前狀態] 方塊，則套裝軟體管理員會儲存下列設定，並於您下次啟動套裝軟體管理員時復原這些設定：

source: <emphasis role="strong">Vertical and horizontal separators</emphasis> — Widths and heights of the panes in the window
de: <emphasis role="strong">Vertikale und horizontale Trennlinien</emphasis> – Breiten und Höhen der Bereiche im Fenster
es: <emphasis role="strong">Separadores verticales y horizontales</emphasis>: medidas de anchura y altura de los paneles de la ventana
ja: <emphasis role="strong">垂直セパレータと水平セパレータ</emphasis> - ウィンドウ内の区画の幅と高さ
ko: <emphasis role="strong">세로 및 가로 구분선</emphasis> — 창에 있는 창의 너비 및 높이
zh_hk: <emphasis role="strong">垂直和水平分隔線</emphasis> — 視窗窗格的寬度和高度

source: <emphasis role="strong">Window size</emphasis> — Overall size of the Package Manager window
de: <emphasis role="strong">Fenstergröße</emphasis> – Gesamtgröße des Fensters "Package Manager"
es: <emphasis role="strong">Tamaño de ventana</emphasis>: el tamaño general de la ventana de Package Manager
ja: <emphasis role="strong">ウィンドウサイズ</emphasis> - パッケージマネージャーウィンドウ全体のサイズ
ko: <emphasis role="strong">창 크기</emphasis> — 패키지 관리자 창의 전체 크기
zh_hk: <emphasis role="strong">視窗大小</emphasis> — 套裝軟體管理員視窗的整體大小

source: <emphasis role="strong">Publisher option</emphasis> — The publisher or other option that is selected in the <guimenu>Publisher</guimenu> drop-down menu when Package Manager is closed
de: <emphasis role="strong">Herausgeberoption</emphasis> – Der Herausgeber oder eine andere Option, die im Dropdown-Menü <guimenu>Herausgeber</guimenu> ausgewählt wird, wenn der Package Manager geschlossen wird.
es: <emphasis role="strong">Opción de editor</emphasis>: el editor u otra opción seleccionada en el menú desplegable <guimenu>Editor</guimenu> cuando Package Manager está cerrado
ja: <emphasis role="strong">発行元のオプション</emphasis> — パッケージマネージャーの終了時に<guimenu>「発行元」</guimenu>ドロップダウンメニューで選択されている発行元やほかのオプション
ko: <emphasis role="strong">게시자 옵션</emphasis> — 패키지 관리자를 닫을 때 <guimenu>게시자</guimenu> 드롭다운 메뉴에서 선택된 게시자 또는 기타 옵션
zh_hk: <emphasis role="strong">發佈者選項</emphasis> — 套裝軟體管理員關閉時，[<guimenu>發佈者</guimenu>] 下拉式功能表中選取的發佈者或其他選項

source: <emphasis role="strong">Categories</emphasis> — The selected category and the expanded and collapsed categories for each publisher
de: <emphasis role="strong">Kategorien</emphasis> – Die ausgewählte Kategorie und die erweiterten und reduzierten Kategorien jedes Herausgebers
es: <emphasis role="strong">Categorías</emphasis>: la categoría seleccionada y las categorías ampliadas y plegadas para cada editor
ja: <emphasis role="strong">カテゴリ</emphasis> — 各発行元の選択されているカテゴリおよび展開されたカテゴリと折りたたまれたカテゴリ
ko: <emphasis role="strong">범주</emphasis> — 각 게시자에 대해 선택된 범주 및 확장/축소된 범주
zh_hk: <emphasis role="strong">類別</emphasis> — 每個發佈者的選取類別以及展開和收合的類別

source: Confirmation Dialog Preferences
ca: Diàleg de confirmació de preferències
cs: Nastavení Potvrzovacího Dialogu
de: Einstellungen des Bestätigungs-Dialogfelds
es: Preferencias del cuadro de diálogo de confirmación
ja: 「確認」ダイアログ設定
ko: 확인 대화 상자 기본 설정
ru: Параметры настройки диалогового окна подтверждения
zh_hk: 確認對話方塊喜好設定

source: When a package is installed, updated, or removed, a confirmation dialog is displayed that shows the list of packages and the action to be performed. If you do not want to see these confirmation dialogs, uncheck these selections in the Preferences window.
de: Wenn ein Paket installiert, aktualisiert oder entfernt wird, wird ein Bestätigungs-Dialogfeld angezeigt, in dem die Liste der Pakete und die auszuführende Aktion angezeigt werden. Wenn diese Bestätigungs-Dialogfelder nicht angezeigt werden sollen, deaktivieren Sie im Fenster "Einstellungen" diese Optionen.
es: Cuando un paquete se instala, se actualiza o se elimina, aparece un cuadro de diálogo de confirmación que muestra la lista de paquetes y la acción que se debe realizar. Si no desea ver estos cuadros de diálogo de confirmación, desmarque las opciones en la ventana Preferencias.
ja: パッケージをインストール、更新、または削除するとき、確認ダイアログが表示されてパッケージの一覧と実行するアクションを示します。これらの確認ダイアログを表示しないようにするには、「設定」ウィンドウでこれらのチェックボックスの選択を解除します。
ko: 패키지가 설치, 업데이트 또는 제거되면 패키지 목록 및 수행할 작업을 나타내는 확인 대화 상자가 표시됩니다. 이러한 확인 대화 상자를 표시하지 않으려면 기본 설정 창에서 해당 선택 항목의 선택을 취소합니다.
zh_hk: 安裝、更新或移除套裝軟體時，系統會顯示確認對話方塊，其中包含要執行的套裝軟體清單與動作。如果您不想看到這些確認對話方塊，請取消核取 [喜好設定] 視窗中的這些選項。

source: Clicking the “Do not show this confirmation dialog again” check box in a particular confirmation dialog also unsets this preference for that dialog.
de: Diese Einstellung kann für dieses Dialogfeld auch zurückgesetzt werden, indem Sie in einem bestimmten Bestätigungs-Dialogfeld das Kontrollkästchen "Dieses Bestätigungs-Dialogfeld nicht mehr anzeigen" markieren.
es: Si hace clic en la casilla de selección "No volver a mostrar este cuadro de diálogo de confirmación" en un cuadro de diálogo de confirmación en particular, también anulará esta preferencia para ese cuadro de diálogo.
ja: 特定の確認ダイアログで「今後、この確認ダイアログを表示しない」チェックボックスをクリックすることによっても、そのダイアログに関するこの設定を解除できます。
ko: 특정 확인 대화 상자에서 "이 확인 대화 상자를 다시 표시하지 않음" 확인란을 누르면 해당 대화 상자에 대해 이 기본 설정이 해제됩니다.
zh_hk: 在特定確認對話方塊按一下「不要再顯示此確認對話方塊」核取方塊，也會取消設定該對話方塊的此喜好設定。

source: Signature Policy Preferences
de: Signaturrichtlinieneinstellungen
es: Preferencias de política de firmas
ja: 署名ポリシーの設定
ko: 서명 정책 기본 설정
zh_hk: 簽名策略喜好設定

source: Use the buttons on the Signature Policy tab to ignore or require signatures when installing packages in this image. To set signature policy for specific publishers, select the publisher in the Manage Publishers window, click the <guibutton>Modify</guibutton> button, and use the Signature Policy tab of the Modify Publisher window.
de: Verwenden Sie die Schaltfläche auf der Registerkarte "Signaturrichtlinie", um Signaturen zu ignorieren oder anzufordern, wenn Pakete in diesem Abbild installiert werden. Wählen Sie zum Festlegen der Signaturrichtlinie für bestimmte Herausgeber im Fenster "Herausgeber verwalten" den Herausgeber, klicken Sie auf die Schaltfläche <guibutton>Ändern</guibutton>, und verwenden Sie die Registerkarte "Signaturrichtlinie" des Fensters "Herausgeber ändern".
es: Utilice los botones de la ficha Política de firmas para ignorar o requerir firmas al instalar paquetes en esta imagen. Para establecer la política de firmas para editores específicos, seleccione el editor en la ventana Administrar editores, haga clic en el botón <guibutton>Modificar</guibutton> y utilice la ficha Política de firmas de la ventana Modificar editor.
ja: 「署名ポリシー」タブのボタンを使用して、このイメージにパッケージをインストールするときに署名を無視するか要求するかを指定します。特定の発行元の署名ポリシーを設定するには、「発行元の管理」ウィンドウで発行元を選択し、<guibutton>「変更」</guibutton>ボタンをクリックし、「発行元の変更」ウィンドウの「署名ポリシー」タブを使用します。
ko: 서명 정책 탭의 버튼을 사용하여 이 이미지에 패키지를 설치할 때 서명을 무시하거나 요구합니다. 특정 게시자에 대한 서명 정책을 설정하려면 게시자 관리 창에서 게시자를 선택하고 <guibutton>수정</guibutton> 버튼을 누른 다음 게시자 수정 창의 서명 정책 탭을 사용합니다.
zh_hk: 在此影像安裝套裝軟體時，使用 [簽名策略] 標籤中的按鈕來忽略或要求簽名。若要設定特定發佈者的簽名策略，請在 [管理發佈者] 視窗中選取發佈者，接著按一下 [<guibutton>修改</guibutton>] 按鈕，然後使用 [修改發佈者] 視窗的 [簽名策略] 標籤。

source: The choices for image signature policy are the same as the choices for publisher signature policy except that the settings apply to all packages installed in the image, not just to packages installed from a particular publisher. See <xref linkend="pub-sig-policy"/>.
de: Die Auswahl für Abbildsignaturrichtlinien stimmt mit der Auswahl für Herausgebersignaturrichtlinien mit einem Unterschied überein: Die Einstellungen gelten für alle im Abbild installierten Pakete und nicht nur für die von einem bestimmten Herausgeber installierten Pakete. Weitere Informationen dazu finden Sie unter <xref linkend="pub-sig-policy"/>.
es: Las opciones de política de firmas de imagen son las mismas que para la política de firmas de editor, salvo que las configuraciones se aplican a todos los paquetes instalados en la imagen y no solamente a paquetes instalados de un editor en particular. Consulte <xref linkend="pub-sig-policy"/>.
ja: イメージの署名ポリシーの選択肢は発行元の署名ポリシーの選択肢と同じですが、特定の発行元からインストールされたパッケージだけではなく、イメージにインストールされているすべてのパッケージに設定が適用される点が異なります。<xref linkend="pub-sig-policy"/>を参照してください。
ko: 이미지 서명 정책에 대한 선택 항목은 설정이 특정 게시자로부터 설치된 패키지가 아닌 이미지에 설치된 모든 패키지에 적용된다는 점을 제외하고 게시자 서명 정책에 대한 선택 항목과 동일합니다. <xref linkend="pub-sig-policy"/>을 참조하십시오.
zh_hk: 影像簽名策略的選項和發佈者簽名策略的選項相同，但影像簽名策略的設定會套用至影像中安裝的所有套裝軟體，而不是只套用至從特定發佈者安裝的套裝軟體。請參閱 <xref linkend="pub-sig-policy"/>。

source: Optional Component Preferences Language Choices
de: Einstellungen der optionalen Komponenten - Sprachauswahl
es: Opciones de idioma de preferencias de componentes opcionales
ja: オプションコンポーネント設定の言語選択
ko: 선택적 구성 요소 기본 설정 언어 선택
zh_hk: 選擇性元件喜好設定語言選擇

source: Select the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> option and select the Optional Components tab.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Einstellungen</guimenuitem></menuchoice>, und wählen Sie dann die Registerkarte "Optionale Komponenten".
es: Seleccione la opción <menuchoice><guimenu>Editar</guimenu><guimenuitem>Preferencias</guimenuitem></menuchoice> y seleccione la ficha Componentes opcionales.
ja: <menuchoice><guimenu>「編集」</guimenu><guimenuitem>「設定」</guimenuitem></menuchoice>オプションを選択し、「オプションのコンポーネント」タブを選択します。
ko: <menuchoice><guimenu>편집</guimenu><guimenuitem>기본 설정</guimenuitem></menuchoice> 옵션을 선택하고 선택적 구성 요소 탭을 선택합니다.
zh_hk: 選取 <menuchoice>[<guimenu>編輯</guimenu>] [<guimenuitem>喜好設定</guimenuitem>]</menuchoice> 選項，並選取 [選擇性元件] 標籤。

source: By default, Install all languages is selected under Language choices for any package. You can save space in your installation by selecting a subset of languages to install.
de: Die Option "Alle Sprachen installieren" ist standardmäßig in der Sprachauswahl aller Pakete ausgewählt. Sie können bei der Installation Speicherplatz sparen, wenn Sie einen Teil der Sprachen zum Installieren auswählen.
es: De manera predeterminada, la opción Instalar todos los idiomas debajo de Opciones de idioma para cualquier paquete está seleccionada. Puede ahorrar espacio en la instalación seleccionando un subconjunto de idiomas para instalar.
ja: デフォルトでは、「パッケージの言語選択」には「すべての言語のインストール」が選択されます。一部の言語を選択してインストールすることで、インストールの領域を節約できます。
ko: 기본적으로 패키지에 대한 언어 선택 항목에서 모든 언어 설치가 선택되어 있습니다. 설치할 언어 중 일부만 선택하여 설치 공간을 절약할 수 있습니다.
zh_hk: 預設會安裝 [任何套裝軟體的語言選擇] 下選取的所有語言。您可以只選取要安裝的語言子集來節省安裝空間。

source: When Install only these languages is selected, you can click the checkbox icon in the left most column heading of the language list to select all languages. Click the column heading again to deselect all languages. Click the Language and Territory column headings to sort the list.
de: Wenn "Nur diese Sprachen installieren" ausgewählt ist, können Sie auf das Kontrollkästchensymbol in der Überschrift der äußeren linken Spalte klicken, um alle Sprachen auszuwählen. Klicken Sie erneut auf die Spaltenüberschrift, um die Auswahl aller Sprachen aufzuheben. Klicken Sie auf die Überschriften "Sprache" und "Gebiet", um die Liste zu sortieren.
es: Cuando la opción Instalar sólo estos idiomas está seleccionada, puede hacer clic en el icono de la casilla de selección del encabezado de la columna que aparece en el extremo izquierdo de la lista de idiomas para seleccionar todos los idiomas. Vuelva a hacer clic en el encabezado de la columna para anular la selección de todos los idiomas. Haga clic en los encabezados de las columnas Idioma y Territorio para ordenar la lista.
ja: 「次の言語のみのインストール」が選択されている場合は、言語リストの左端の列見出しにあるチェックボックスアイコンをクリックすると、すべての言語を選択できます。この列見出しを再度クリックすると、すべての言語の選択を解除できます。「言語」列見出しと「地域」列見出しをクリックすると、リストをソートできます。
ko: 다음 언어만 설치가 선택된 경우 언어 목록의 열 제목 맨 왼쪽에 있는 확인란 아이콘을 눌러 모든 언어를 선택할 수 있습니다. 열 제목을 다시 누르면 모든 언어의 선택이 해제됩니다. 목록을 정렬하려면 언어 및 영역 열 제목을 누릅니다.
zh_hk: 只安裝這些選取的語言時，您可以按一下語言清單最左側資料欄標題中的核取方塊來選取所有語言。再按一下資料欄標題即可取消選取所有語言。按一下 [語言] 和 [地區] 資料欄標題即可排序清單。

source: Click the OK button to save your changes. These settings apply to currently installed packages as well as future package installations and updates. The image is updated as necessary to install or remove optional package components based on the new settings.
de: Klicken Sie auf die Schaltfläche "OK", um die Änderungen zu speichern. Diese Änderungen gelten für die derzeit installierten Pakete sowie für künftige Paketinstallationen und -updates. Das Abbild wird entsprechend aktualisiert, um die optionalen Paketkomponenten entsprechend den neuen Einstellungen zu installieren bzw. zu entfernen.
es: Haga clic en el botón Aceptar para guardar los cambios. Esta configuración se aplica a los paquetes instalados actualmente y a futuras instalaciones y actualizaciones de paquetes. La imagen se actualiza según sea necesario para instalar o eliminar componentes de paquete opcionales de acuerdo con las configuraciones nuevas.
ja: 「了解」ボタンをクリックして変更を保存します。これらの設定は、現在インストールされているパッケージおよび今後のパッケージのインストールと更新に適用されます。新しい設定に基づいて、オプションのパッケージコンポーネントのインストールや削除が必要に応じて実行され、イメージが更新されます。
ko: 확인 버튼을 눌러 변경 사항을 저장합니다. 그러면 현재 설치된 패키지와 후속 패키지 설치 및 업데이트에 해당 설정이 적용됩니다. 새 설정을 기반으로 선택적 패키지 구성 요소를 설치 또는 제거할 때 필요에 따라 이미지가 업데이트됩니다.
zh_hk: 按一下 [確定] 按鈕以儲存您的變更。這些設定會套用至目前安裝的套裝軟體以及未來的套裝軟體安裝和更新。必要時會更新影像，根據新的設定安裝或移除選擇性套裝軟體元件。

source: If you have previously updated your image to include only a subset of languages, Install only these languages is the default selection in this window, and that language list is grayed out if you select the Install all languages option.
de: Wenn Sie das Abbild zuvor aktualisiert haben, um nur einen Teil der Sprachen zu installieren, ist die Option "Nur diese Sprachen installieren" standardmäßig in diesem Fenster ausgewählt. Die Sprachenliste ist ausgegraut, wenn Sie die Option "Alle Sprachen installieren" auswählen.
es: Si anteriormente actualizó la imagen para incluir sólo un subconjunto de idiomas, la selección predeterminada de esta ventana es Instalar sólo estos idiomas, y esa lista de idiomas aparecerá en color gris si selecciona la opción Instalar todos los idiomas.
ja: 以前にイメージを更新して一部の言語だけを含めてある場合、このウィンドウではデフォルトで「次の言語のみのインストール」が選択され、「すべての言語のインストール」オプションを選択するとその言語リストはグレー表示されます。
ko: 언어 중 일부만 포함되도록 이전에 이미지를 업데이트한 경우 기본적으로 이 창에서 다음 언어만 설치가 선택되며 모든 언어 설치 옵션을 선택할 경우 해당 언어 목록이 비활성화됩니다.
zh_hk: 如果您先前已更新您的影像使其只包括語言的子集，則只會安裝此視窗中的這些預設語言選項，如果您選擇安裝所有語言選項，則該語言清單會變成灰色。

source: Other Optional Component Preferences
de: Sonstige Einstellungen der optionalen Komponenten
es: Otras preferencias de componentes opcionales
ja: ほかのオプションコンポーネント設定
ko: 기타 선택적 구성 요소 기본 설정
zh_hk: 其他選擇性元件喜好設定

source: By default, Install all development files and Install all documentation are selected under Other component choices. You can save space in your installation by deselecting development files or documentation.
de: Unter "Sonstige Komponentenauswahloptionen" sind standardmäßig die Optionen "Alle Entwicklungsdateien installieren" und "Alle Dokumentationen installieren" ausgewählt. Sie können in Ihrer Installation Speicherplatz sparen, indem Sie die Auswahl der Entwicklungsdateien und der Dokumentationen aufheben.
es: De manera predeterminada, las opciones Instalar todos los archivos de desarrollo e Instalar toda la documentación están seleccionadas debajo de Otras opciones de componentes. Puede ahorrar espacio en la instalación anulando la selección de archivos de desarrollo o documentación.
ja: デフォルトでは、「その他のコンポーネント選択」には「すべての開発ファイルのインストール」と「すべてのドキュメントのインストール」が選択されます。開発ファイルやドキュメントの選択を解除することで、インストールの領域を節約できます。
ko: 기본적으로 기타 구성 요소 선택 항목에서 모든 개발 파일 설치 및 모든 설명서 설치가 선택되어 있습니다. 개발 파일 또는 설명서의 선택을 해제하여 설치 공간을 절약할 수 있습니다.
zh_hk: 預設會安裝所有開發檔案並安裝 [其他元件選擇] 下選取的所有文件。您可以取消選取開發檔案或文件以節省安裝空間。

source: Glossary
de: Glossar
es: Glosario
ja: 用語集
ko: 용어
zh_hk: 詞彙

source: alias
ca: àlies
de: Aliasname
ja: 別名
ko: 별칭
ru: псевдоним
zh_hk: 別名

source: Another name for a publisher.
de: Ein anderer Name für einen Herausgeber.
es: Otro nombre para un editor.
ja: 発行元の別の名前。
ko: 게시자의 다른 이름입니다.
zh_hk: 發佈者的另一個名稱。

source: boot environment (BE)
de: Boot-Umgebung (BU)
es: entorno de inicio
ja: ブート環境 (BE)
ko: BE(부트 환경)
zh_hk: 啟動環境 (BE)

source: An instance of a bootable Oracle Solaris environment. The root file system and all other file systems of the boot environment that contain system software are required to be ZFS datasets.
de: Eine Instanz einer bootfähigen Oracle Solaris-Umgebung. Das Root-Dateisystem und alle anderen Dateisysteme der Boot-Umgebung, die Systemsoftware enthalten, müssen ZFS-Datensätze sein.
es: Una instancia de un entorno de inicio de Oracle Solaris. Se requiere que el sistema de archivos root y todos los demás sistemas de archivos del entorno de inicio que contienen software de sistema sean conjuntos de datos ZFS.
ja: ブート可能な Oracle Solaris 環境のインスタンス。ブート環境の、システムソフトウェアを含むルートファイルシステムとその他のすべてのファイルシステムは、ZFS データセットである必要があります。
ko: 부트 가능 Oracle Solaris 환경의 인스턴스입니다. 시스템 소프트웨어를 포함하는 부트 환경의 루트 파일 시스템 및 기타 모든 파일 시스템이 ZFS 데이터 집합이어야 합니다.
zh_hk: 可啟動之 Oracle Solaris 環境的實例。根檔案系統與所有其他包含了系統軟體的啟動環境檔案系統都必須是 ZFS 資料集。

source: The active boot environment is the one that is currently booted. A system can have many boot environments. You can select the one you want to boot into when you reboot.
de: Die derzeit gebootete Boot-Umgebung wird als aktive Boot-Umgebung bezeichnet. Ein System kann mehrere Boot-Umgebungen haben. Sie können die BU auswählen, die beim Neustart gebootet werden soll.
es: El entorno de inicio activo es el que se inicia actualmente. Un sistema puede tener varios entornos de inicio. Puede seleccionar el entorno que desee para que se inicie cuando reinicia el sistema.
ja: アクティブブート環境とは、現在ブートされているブート環境のことです。システムには多数のブート環境を維持することができます。リブート時にどれをブートするかを選択できます。
ko: 활성 부트 환경은 현재 부트된 부트 환경입니다. 시스템에는 여러 부트 환경이 있을 수 있으며, 재부트할 때 부트할 환경을 선택할 수 있습니다.
zh_hk: 使用中的啟動環境是目前已啟動的啟動環境。系統可以有多個啟動環境。重新開機時，您可以選取要啟動的啟動環境。

source: clone
ca: Clonar
cs: klon
de: Klon
es: clónico
ja: クローン
ko: 복제본
ru: клон
zh_hk: 複製

source: An exact copy.
ca: Una còpia exacta.
cs: Přesná kopie.
de: Eine genaue Kopie.
es: Copia exacta.
ja: 正確なコピー。
ko: 정확히 일치하는 복사본입니다.
ru: Точная копия.
zh_hk: 完全一致的副本。

source: A clone could be an exact copy of an operating system, a file system, or a volume. This copy has 100% compatibility with the original.
ca: Un clon pot ser exactament la còpia d'un sistema operatiu, un sistema de fitxers, o un volum. Aquesta còpia té una compatibilitat del 100% amb l'original.
cs: Klon nemůže být přesná kopie operačního systému, souborového systému nebo oddílu. Tato kopie má 100% kompabilitu s originálem.
de: Ein Klon kann eine genaue Kopie eines Betriebssystems, eines Dateisystems oder eines Datenträgers sein. Diese Kopie ist zu 100 % mit dem Original kompatibel.
es: Un clónico puede ser una copia exacta de un sistema operativo, un sistema de archivos o un volumen. Esta copia es 100% compatible con el original.
ja: クローンはオペレーティングシステム、ファイルシステム、またはボリュームの正確なコピーを指すことがあります。このコピーは、元の内容と完全に互換性があります。
ko: 복제본은 운영 체제, 파일 시스템 또는 볼륨과 정확히 일치하는 복사본일 수 있습니다. 이 복사본은 원본과 100% 호환됩니다.
ru: Клон может быть точной копией операционной системы, файловой системы или тома. Такая копия имеет 100% совместимость с оригиналом.
zh_hk: 複製可以是完全與作業系統、檔案系統或磁碟區相同的副本。此副本與原件 100% 相容。

source: dataset
ca: registre
cs: datová sada
de: Datensatz
es: conjunto de datos
ja: データセット
ko: 데이터 세트
ru: набор данных
zh_hk: 資料集

source: A generic name for the following ZFS entities: clones, file systems, snapshots, or volumes. Each dataset is identified by a unique name in the ZFS namespace.
ca: Un nom genèric per a les següents entitats ZFS: clons, sistemes de fitxers, instantànies, o volums. Cada registre està identificat per un únic nom a l'espai de noms ZFS.
cs: Obecný název pro následující objekty ZFS: klony, souborové systémy, snímky nebo svazky. Každá datová sada je identifikována jedinečným jménem v ZFS prostoru jmen.
de: Ein generischer Name für die folgenden ZFS-Elemente: Klone, Dateisysteme, Schnappschüsse oder Datenträger. Jeder Datensatz wird durch einen eindeutigen Namen im ZFS-Namensraum gekennzeichnet.
es: Nombre genérico de las entidades de ZFS siguientes: clónicos, sistemas de archivos, instantáneas o volúmenes. Cada conjunto de datos se identifica mediante un nombre exclusivo en el espacio de nombres de ZFS.
ja: クローン、ファイルシステム、スナップショット、またはボリュームという ZFS エンティティーの総称名。各データセットは、ZFS 名前空間内の一意の名前で識別されます。
ko: 복제본, 파일 시스템, 스냅샷, 볼륨 등의 ZFS 엔티티에 대한 일반 이름입니다. 각 데이터 세트는 ZFS 이름 공간에서 고유 이름으로 식별됩니다.
ru: Общее название для следующих категорий ZFS: клоны, файловые системы, снимки или тома. Каждый набор данных определен уникальным названием в пространстве имен ZFS.
zh_hk: 下列 ZFS 項目的通用名稱：複製、檔案系統、快照或磁碟區。每個資料集都使用 ZFS 名稱空間中的唯一名稱識別。

source: image
ca: imatge
cs: obraz
de: Abbild
es: imagen
ja: イメージ
ko: 이미지
ru: образ
zh_hk: 影像

source: A collection of operating system software in a package that can be booted and installed.
de: Eine Sammlung von Betriebssystemsoftware in einem Paket, das gebootet und installiert werden kann.
es: Una colección de software del sistema operativo en un paquete que se puede iniciar e instalar.
ja: ブートとインストールが可能なパッケージ内のオペレーティングシステムソフトウェアのコレクション。
ko: 부트 및 설치 가능한 패키지의 운영 체제 소프트웨어 모음입니다.
zh_hk: 套裝軟體中的作業系統軟體集合，可加以啟動和安裝。

source: A location on your system where packages and their associated files, directories, links, and dependencies can be installed.
de: Ein Speicherort auf Ihrem System, an dem Pakete und die dazugehörigen Dateien, Verzeichnisse, Verknüpfungen und Abhängigkeiten installiert werden können.
es: Una ubicación en su sistema en la que pueden instalarse paquetes y sus archivos, directorios, dependencias y enlaces asociados.
ja: パッケージとそれに関連付けられたファイル、ディレクトリ、リンク、および依存関係をインストールできるシステム上の場所。
ko: 패키지, 패키지와 연결된 파일, 디렉토리, 링크 및 종속성을 설치할 수 있는 시스템의 위치입니다.
zh_hk: 系統上的某個位置，可在其中安裝套裝軟體及其相關的檔案、目錄、連結及相依性。

source: origin
ca: origen
cs: původ
de: Quelle
es: origen
ja: 起点
ko: 원본
ru: источник
zh_hk: 原始

source: A package server to which a publisher publishes packages.
de: Ein Paketserver, auf dem ein Herausgeber Pakete veröffentlicht.
es: Un servidor de paquetes en el que un editor publica paquetes.
ja: 発行元がパッケージを発行するパッケージサーバー。
ko: 게시자가 패키지를 게시하는 패키지 서버입니다.
zh_hk: 發佈者發佈套裝軟體的目標套裝軟體伺服器。

source: package
ca: paquet
cs: balíček
de: Paket
es: paquete
ja: パッケージ
ko: 패키지
ru: пакет
zh_hk: 套裝軟體

source: A collection of files, directories, links, drivers, and dependencies in a defined format.
ca: Una col·lecció de fitxers, directoris, enllaços, controladors, i dependències en un format definit.
cs: Kolekce souborů, adresářů, odkazů, ovladačů a závislostí v definovaném formátu.
de: Eine Sammlung von Dateien, Verzeichnissen, Verknüpfungen, Treibern und Abhängigkeiten in einem definierten Format.
es: Serie de archivos, directorios, vínculos, controladores y dependencias que tienen un formato definido.
ja: 定義された形式での、ファイル、ディレクトリ、リンク、ドライバ、および依存関係のコレクション。
ko: 파일, 디렉토리, 링크, 드라이버 및 종속성의 모음으로서 정의된 형식을 따릅니다.
ru: Набор файлов, каталогов, ссылок, драйверов и зависимостей в определенном формате.
zh_hk: 使用定義格式的檔案、目錄、連結、驅動程式及相依性的集合。

source: publisher
ca: publicador
cs: vydavatel
de: Herausgeber
es: editor
ja: 発行元
ko: 게시자
ru: издатель
zh_hk: 發佈者
