Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: <guimenu>Publisher</guimenu> menu selection — Package Manager searches for the search string in the information about each package from a particular publisher or from all publishers, according to what you have selected on the <guimenu> Publisher</guimenu> menu.
de: Menüauswahl <guimenu>Herausgeber</guimenu> – Der Package Manager durchsucht die Informationen zu jedem Paket von einem bestimmten Herausgeber oder von allen Herausgebern auf eine Suchzeichenfolge und unter Berücksichtigung der ausgewählten Option im Menü <guimenu>Herausgeber</guimenu>.
es: Selección de menú <guimenu>Editor</guimenu>: Package Manager busca la cadena de búsqueda en la información de cada paquete de un editor en particular o de todos los editores, según la selección realizada en el menú <guimenu>Editor</guimenu>.
ja: <guimenu>「発行元」</guimenu>メニューの選択 — パッケージマネージャーは、ユーザーが<guimenu>「発行元」</guimenu>メニューで選択した内容に基づいて、特定の発行元またはすべての発行元の各パッケージに関する情報内で検索文字列を検索します。
ko: <guimenu>게시자</guimenu> 메뉴 선택 — <guimenu>게시자</guimenu> 메뉴에서 선택한 내용에 따라 패키지 관리자가 특정 게시자 또는 모든 게시자의 각 패키지에 대한 정보에서 검색 문자열을 검색합니다.
zh_hk: [<guimenu>發佈者</guimenu>] 功能表選項 — 套裝軟體管理員會依照您在 [<guimenu>發佈者</guimenu>] 功能表中所做的選擇，從特定發佈者或所有發佈者的每個套裝軟體資訊中搜尋搜尋字串。

source: Search results are the same whether you select <guimenuitem>All Publishers</guimenuitem> or <guimenuitem>All Publishers (Search)</guimenuitem>. The difference is that using <guimenuitem>All Publishers (Search)</guimenuitem> is faster because you avoid the delay to load data from all publishers that you incur when you select <guimenuitem>All Publishers</guimenuitem>. With <guimenuitem>All Publishers (Search)</guimenuitem>, the search is performed on all publishers without loading data from all publishers in the package list pane.
de: Die Suchergebnisse sind beim Auswählen der Option <guimenuitem>Alle Herausgeber</guimenuitem> oder <guimenuitem>Alle Herausgeber (Suche)</guimenuitem> gleich. Wenn Sie die Option <guimenuitem>Alle Herausgeber (Suche)</guimenuitem> wählen, erfolgt der Suchvorgang jedoch schneller, weil dabei die Daten von allen Herausgebern, die mit der Option <guimenuitem>Alle Herausgeber</guimenuitem> übernommen werden, nicht geladen werden. Mit <guimenuitem>Alle Herausgeber (Suche)</guimenuitem> werden alle Herausgeber durchsucht, ohne dass Daten von allen Herausgebern im Paketlistenbereich geladen werden.
es: Los resultados de búsqueda son los mismos independientemente de que seleccione <guimenuitem>Todos los editores</guimenuitem> o <guimenuitem>Todos los editores (buscar)</guimenuitem>. La diferencia es que la opción <guimenuitem>Todos los editores (buscar)</guimenuitem> es más rápida, ya que evita el retraso que implica la carga de datos de todos los editores cuando selecciona <guimenuitem>Todos los editores</guimenuitem>. Con <guimenuitem>Todos los editores (buscar)</guimenuitem>, la búsqueda se realiza en todos los editores sin cargar datos de todos los editores en el panel de la lista de paquetes.
ja: <guimenuitem>「すべての発行元」</guimenuitem>または<guimenuitem>「すべての発行元 (検索)」</guimenuitem>のどちらを選択しても検索結果は同じです。相違点は、<guimenuitem>「すべての発行元」</guimenuitem>を選択するとすべての発行元のデータを読み込むため遅延が発生しますが、<guimenuitem>「すべての発行元 (検索)」</guimenuitem>を使用するとそれを回避して高速に検索できることです。<guimenuitem>「すべての発行元 (検索)」</guimenuitem>では、すべての発行元のデータをパッケージリスト区画に読み込むことなく、すべての発行元に対して検索が実行されます。
ko: <guimenuitem>모든 게시자</guimenuitem>를 선택하든 <guimenuitem>모든 게시자(검색)</guimenuitem>를 선택하든 검색 결과는 동일합니다. <guimenuitem>모든 게시자(검색)</guimenuitem>를 사용하는 것이 더 빠르다는 것만 다릅니다. <guimenuitem>모든 게시자</guimenuitem>를 선택할 때는 모든 게시자의 데이터가 로드되어 지연이 발생하기 때문입니다. <guimenuitem>모든 게시자(검색)</guimenuitem>를 사용하면 패키지 목록 창에 나열되는 모든 게시자의 데이터를 로드하지 않고 모든 게시자에 대해 검색이 수행됩니다.
zh_hk: 無論您選取的是 [<guimenuitem>所有發佈者</guimenuitem>] 或 [<guimenuitem>全部的發佈者 (搜尋)</guimenuitem>]，搜尋結果會是相同的。差異在於使用 [<guimenuitem>全部的發佈者 (搜尋)</guimenuitem>] 時速度較快，因為可避免選取 [<guimenuitem>所有發佈者</guimenuitem>] 時載入所有發佈者資料所產生的延遲問題。選取 [<guimenuitem>全部的發佈者 (搜尋)</guimenuitem>] 時，會在所有的發佈者上執行搜尋，但不會載入套裝軟體清單窗格中所有發佈者的資料。

source: <guimenu>View</guimenu> menu selection — Search results are displayed in the package list pane according to the package status selected on the <guimenu>View</guimenu> menu. You can display different subsets of the same search results in the package list pane by changing the <guimenu>View</guimenu> menu selection without redoing the search.
de: Menüauswahl <guimenu>Ansicht</guimenu> – Die Suchergebnisse werden im Paketlistenbereich in Abhängigkeit des Paketstatus angezeigt, den Sie im Menü <guimenu>Ansicht</guimenu> ausgewählt haben. Sie können auch einen anderen Teil der Suchergebnisse im Paketlistenbereich anzeigen, indem Sie eine andere Option im Menü <guimenu>Ansicht</guimenu> auswählen, ohne den Suchvorgang neu auszuführen.
es: Selección de menú <guimenu>Ver</guimenu>: los resultados de búsqueda se muestran en el panel de la lista de paquetes según el estado del paquete seleccionado en el menú <guimenu>Ver</guimenu>. Puede mostrar distintos subconjuntos de los mismos resultados de búsqueda en el panel de la lista de paquetes cambiando la selección de menú <guimenu>Ver</guimenu> sin necesidad de rehacer la búsqueda.
ja: <guimenu>「表示」</guimenu>メニューの選択 — <guimenu>「表示」</guimenu>メニューで選択したパッケージ状態に基づいて、検索結果がパッケージリスト区画に表示されます。<guimenu>「表示」</guimenu>メニューの選択を変更することにより、検索を再度実行することなく、同じ検索結果のさまざまな部分集合をパッケージリスト区画に表示できます。
ko: <guimenu>보기</guimenu> 메뉴 선택 — <guimenu>보기</guimenu> 메뉴에서 선택된 패키지 상태에 따라 검색 결과가 패키지 목록 창에 표시됩니다. 검색을 다시 실행하지 않고 <guimenu>보기</guimenu> 메뉴 선택을 변경하여 패키지 목록 창에 동일한 검색 결과의 다른 일부분을 표시할 수 있습니다.
zh_hk: [<guimenu>檢視</guimenu>] 功能表選項 — 系統會在套裝軟體清單窗格中，依據您在 [<guimenu>檢視</guimenu>] 功能表中選取的套裝軟體狀態顯示搜尋結果。您也可以變更 [<guimenu>檢視</guimenu>] 功能表選項，在套裝軟體清單窗格中顯示相同搜尋結果的不同子集，而不需要重新搜尋。

source: Package Manager searches package information including name, summary, description, category, and names of files contained within the package. Only exact matches are found if you do not use wild cards.
de: Der Package Manager durchsucht Paketinformationen einschließlich Name, Zusammenfassung, Beschreibung, Kategorie und Namen der Dateien, die im Paket enthalten sind. Wenn Sie keine Platzhalter verwenden, werden nur exakte Übereinstimmungen gefunden.
es: Package Manager busca información del paquete, como nombre, resumen, descripción, categoría y nombres de archivos que contiene el paquete. Si no utiliza comodines, sólo se encuentran coincidencias exactas.
ja: パッケージマネージャーは、名前、概要、説明、カテゴリ、パッケージ内に含まれるファイルの名前などのパッケージ情報を検索します。ワイルドカードを使用しない場合は、完全に一致するものだけが検索されます。
ko: 패키지 관리자는 이름, 요약, 설명, 범주, 패키지 내에 포함된 파일 이름 등의 패키지 정보를 검색합니다. 와일드카드를 사용하지 않을 경우 정확한 일치 항목만 검색됩니다.
zh_hk: 套裝軟體管理員搜尋的套裝軟體資訊包括名稱、摘要、說明、類別與套裝軟體中包含的檔案名稱。如果未使用萬用字元，就只會找出完全相符的項目。

source: AND
de: UND

source: When search terms are separated by spaces or by <literal>AND</literal>, Package Manager searches for packages that contain <emphasis role="strong">all</emphasis> of the search terms. This is the default search behavior.
de: Wenn Suchbegriffe durch Leerzeichen oder <literal>UND</literal> getrennt sind, sucht der Package Manager nach Paketen, die <emphasis role="strong">alle</emphasis> Suchbegriffe enthalten. Das ist die Standard-Sucheinstellung.
es: Cuando los términos de búsqueda estén separados por espacios o por <literal>AND</literal>, Package Manager buscará los paquetes que contengan <emphasis role="strong">todos</emphasis> los términos de búsqueda. Éste es el comportamiento de búsqueda predeterminado.
ja: 検索語がスペースあるいは <literal>AND</literal> で区切られていると、パッケージマネージャーは<emphasis role="strong">すべて</emphasis>の検索語を含むパッケージを検索します。これはデフォルトの検索動作です。
ko: 검색 용어를 공백이나 <literal>AND</literal>로 구분하면 패키지 관리자는 검색 용어를 <emphasis role="strong">모두</emphasis> 포함하는 패키지를 검색합니다. 이 동작이 기본 검색 동작입니다.
zh_hk: 當搜尋字詞以空格或 <literal>AND</literal> 運算子分隔時，套裝軟體管理員會搜尋含有<emphasis role="strong">所有</emphasis>搜尋字詞的套裝軟體。這是預設的搜尋運作方式。

source: Example: If the search string is <literal>python book</literal> or <literal>python AND book</literal>, the search results include only packages that contain <emphasis>both</emphasis><literal>python</literal><emphasis>and</emphasis><literal>book</literal> in their package information. For example, the package <literal>diveintopython</literal>, a book about Python programming, would appear in the search results, but the package <literal>python-26</literal> would not.
de: Beispiel: Wenn die Suchzeichenfolge <literal>python book</literal> oder <literal>python UND book</literal> lautet, werden in den Suchergebnissen nur die Pakete angezeigt, die <emphasis>beide Begriffe</emphasis>; <literal>python</literal><emphasis> und </emphasis><literal>book</literal>, in den Paketinformationen enthalten. Das Paket <literal>diveintopython</literal> (ein Handbuch zur Python-Programmierung) würde beispielsweise in den Suchergebnissen angezeigt, das Paket <literal>python-26</literal> nicht.
es: Ejemplo: Si la cadena de búsqueda es <literal>python book</literal> o <literal>python AND book</literal>, los resultados de búsqueda incluirán solamente paquetes que contengan <emphasis>tanto</emphasis><literal>python</literal><emphasis>como</emphasis><literal>book</literal> en su información de paquete. Por ejemplo, el paquete <literal>diveintopython</literal>, un libro sobre programación de Python, aparecería en los resultados de búsqueda, pero el paquete <literal>python-26</literal> no.
ja: 例: 検索文字列が <literal>python book</literal> または <literal>python AND book</literal> の場合は、パッケージ情報に <literal>python</literal> <emphasis>と</emphasis> <literal>book</literal> の<emphasis>両方</emphasis>を含むパッケージだけが検索結果に含まれます。たとえば、Python プログラミングに関する本 <literal>diveintopython</literal> は検索結果に含まれますが、パッケージ <literal>python-26</literal> は含まれません。
ko: 예: 검색 문자열이 <literal>python book</literal> 또는 <literal>python AND book</literal>이면 검색 결과에는 패키지 정보에 <literal>python</literal><emphasis>과</emphasis> <literal>book</literal>이 <emphasis>모두</emphasis> 들어 있는 패키지만 포함됩니다. 예를 들어, Python 프로그래밍에 대한 북인 <literal>diveintopython</literal> 패키지는 검색 결과에 나타나지만 <literal>python-26</literal>은 나타나지 않습니다.
zh_hk: 範例：如果搜尋字串是 <literal>python book</literal> 或 <literal>python AND book</literal>，搜尋結果只會包含套裝軟體資訊中<emphasis>同時含有 </emphasis><literal>python</literal><emphasis> 和 </emphasis><literal>book</literal> 的套裝軟體。例如，搜尋結果會顯示套裝軟體 <literal>diveintopython</literal> (有關 Python 程式設計的書)，但是不會顯示套裝軟體 <literal>python-26</literal>。

source: Double quotation marks
de: Doppelte Anführungszeichen
es: Comillas dobles
ja: 二重引用符
ko: 큰따옴표
zh_hk: 雙引號

source: Enclose the search term in double quotation marks to match that search term exactly.
de: Setzen Sie den Suchbegriff in doppelte Anführungszeichen, um genau nach diesem Suchbegriff zu suchen.
es: Encierre el término de búsqueda entre comillas dobles para que ese término de búsqueda coincida de manera exacta.
ja: 検索語と完全に一致するものを検索するには、検索語を二重引用符で囲みます。
ko: 해당 검색 용어와 정확히 일치하도록 검색 용어를 큰따옴표로 묶습니다.
zh_hk: 以雙引號括住搜尋字詞，即可比對與搜尋字詞完全相符的字詞。

source: Example: <literal>"ethernet driver"</literal> in double quotation marks matches <literal>Fast Ethernet Driver</literal> but does not match <literal>Ethernet Adapter Driver</literal>.
de: Beispiel: Der Suchbegriff <literal>"ethernet driver"</literal> in doppelten Anführungszeichen entspricht <literal>Fast Ethernet Driver</literal> jedoch nicht <literal>Ethernet Adapter Driver</literal>.
es: Ejemplo: <literal>"ethernet driver"</literal> entre comillas dobles coincide con <literal>Fast Ethernet Driver</literal>, pero no con <literal>Ethernet Adapter Driver</literal>.
ja: 例: 二重引用符で囲まれた <literal>"ethernet driver"</literal> は、<literal>Fast Ethernet Driver</literal> に一致しますが、<literal>Ethernet Adapter Driver</literal> には一致しません。
ko: 예: 큰따옴표로 묶인 <literal>"ethernet driver"</literal>의 경우 <literal>Fast Ethernet Driver</literal>와는 일치하지만 <literal>Ethernet Adapter Driver</literal>와는 일치하지 않습니다.
zh_hk: 範例：以雙引號括住的 <literal>"ethernet driver"</literal> 會比對 <literal>Fast Ethernet Driver</literal>，但不會比對 <literal>Ethernet Adapter Driver</literal>。

source: Wild card
de: Platzhalter
es: Comodín
ja: ワイルドカード
ko: 와일드카드
zh_hk: 萬用字元

source: You can use the <literal>*</literal> wild card in your search string. Using wild cards can be slower.
de: Sie können in der Suchzeichenfolge <literal>*</literal> als Platzhalter verwenden. Die Suche mit Platzhaltern kann länger dauern.
es: Puede utilizar el comodín <literal>*</literal> en su cadena de búsqueda. La búsqueda con comodines puede resultar más lenta.
ja: 検索文字列で <literal>*</literal> ワイルドカードを使用できます。ワイルドカードを使用すると遅くなる場合があります。
ko: 검색 문자열에 <literal>*</literal> 와일드카드를 사용할 수 있습니다. 와일드카드를 사용할 경우 검색 속도가 느려질 수 있습니다.
zh_hk: 您可以在搜尋字串中使用 <literal>*</literal> 萬用字元。使用萬用字元會讓搜尋速度變慢。

source: Example: <literal>802.11*</literal> matches <literal>802.11b/g</literal> and <literal>802.11a/b/g</literal>.
de: Beispiel: <literal>802.11*</literal> entspricht <literal>802.11b/g</literal> und <literal>802.11a/b/g</literal>.
es: Ejemplo: <literal>802.11*</literal> coincide con <literal>802.11b/g</literal> y <literal>802.11a/b/g</literal>.
ja: 例: <literal>802.11*</literal> は <literal>802.11b/g</literal> と <literal>802.11a/b/g</literal> に一致します。
ko: 예: <literal>802.11*</literal>는 <literal>802.11b/g</literal> 및 <literal>802.11a/b/g</literal>와 일치합니다.
zh_hk: 範例：<literal>802.11*</literal> 會比對 <literal>802.11b/g</literal> 和 <literal>802.11a/b/g</literal>。

source: Note that <literal>802.11*</literal> does not match <literal>IEEE802.11b/g</literal>. To match <literal>IEEE802.11b/g</literal>, use search string <literal>*802.11*</literal>.
de: Beachten Sie, dass <literal>802.11*</literal> nicht <literal>IEEE802.11b/g</literal> entspricht. Verwenden Sie zum Suchen von <literal>IEEE802.11b/g</literal> die Suchzeichenfolge <literal>*802.11*</literal>.
es: Tenga en cuenta que <literal>802.11*</literal> no coincide con <literal>IEEE802.11b/g</literal>. Para que la búsqueda coincida con <literal>IEEE802.11b/g</literal>, utilice la cadena de búsqueda <literal>*802.11*</literal>.
ja: <literal>802.11*</literal> は <literal>IEEE802.11b/g</literal> には一致しません。<literal>IEEE802.11b/g</literal> に一致するようにするには、検索文字列 <literal>*802.11*</literal> を使用してください。
ko: <literal>802.11*</literal>는 <literal>IEEE802.11b/g</literal>와 일치하지 않습니다. <literal>IEEE802.11b/g</literal>와 일치시키려면 검색 문자열로 <literal>*802.11*</literal>를 사용하십시오.
zh_hk: 請注意，<literal>802.11*</literal> 不會比對 <literal>IEEE802.11b/g</literal>。若要比對 <literal>IEEE802.11b/g</literal>，請使用搜尋字串 <literal>*802.11*</literal>。

source: OR
de: ODER

source: When search terms are separated by <literal>OR</literal>, Package Manager searches for packages that contain <emphasis role="strong">any</emphasis> of the search terms.
de: Wenn Suchbegriffe durch <literal>ODER</literal> getrennt sind, sucht der Package Manager nach Paketen, die <emphasis role="strong">einen</emphasis> der Suchbegriffe enthalten.
es: Cuando los términos de búsqueda estén separados por <literal>OR</literal>, Package Manager buscará los paquetes que contengan <emphasis role="strong">cualquiera</emphasis> de los términos de búsqueda.
ja: 検索語が <literal>OR</literal> で区切られていると、パッケージマネージャーは検索語の<emphasis role="strong">いずれか</emphasis>を含むパッケージを検索します。
ko: 검색 용어를 <literal>OR</literal>로 구분하면 패키지 관리자는 검색 용어 중 <emphasis role="strong">임의</emphasis>의 하나를 포함하는 패키지를 검색합니다.
zh_hk: 當搜尋字詞以 <literal>OR</literal> 運算子分隔時，套裝軟體管理員會搜尋含有<emphasis role="strong">任一</emphasis>搜尋字詞的套裝軟體。

source: Example: <literal>python OR book</literal> matches all packages that contain <literal>python</literal> in their package information and all packages that contain <literal>book</literal> in their package information.
de: Beispiel: <literal>python ODER book</literal> entspricht allen Paketen, die <literal>python</literal> oder <literal>book</literal> in den Paketinformationen enthalten.
es: Ejemplo: <literal>python OR book</literal> coincide con todos los paquetes que contengan <literal>python</literal> en su información de paquete y todos los paquetes que contengan <literal>book</literal> en su información de paquete.
ja: 例: <literal>python OR book</literal> は、パッケージ情報に <literal>python</literal> を含むすべてのパッケージと、パッケージ情報に <literal>book</literal> を含むすべてのパッケージに一致します。
ko: 예: <literal>python OR book</literal>은 패키지 정보에 <literal>python</literal>이 들어 있는 모든 패키지와 패키지 정보에 <literal>book</literal>이 들어 있는 모든 패키지와 일치합니다.
zh_hk: 範例：<literal>python OR book</literal> 會比對套裝軟體資訊中包含 <literal>python</literal> 的所有套裝軟體，以及套裝軟體資訊中包含 <literal>book</literal> 的所有套裝軟體。

source: You can combine these search string modifiers. You can use AND, OR, doublt quotation marks, and * all in one search string.
de: Sie können diese Suchzeichenfolgenmodifizierer kombinieren. Verwenden Sie UND, ODER, doppelte Anführungszeichen und * in einer Suchzeichenfolge.
es: Usted puede combinar estos modificadores de cadenas de búsqueda. Puede utilizar AND, OR, comillas dobles y * en una sola cadena de búsqueda.
ja: これらの検索文字列修飾子は組み合わせることができます。AND、OR、二重引用符、および * をすべて 1 つの検索文字列で使用することができます。
ko: 이러한 검색 문자열 수정자를 함께 사용할 수 있습니다. 즉, 하나의 검색 문자열에서 AND와 OR, 큰따옴표, *를 모두 사용할 수 있습니다.
zh_hk: 您可以結合這些搜尋字串修飾鍵，並在單一搜尋字串中使用 AND、OR、雙引號及 *。

source: Clear the Search Field
de: Suchfeld löschen
es: Borrar el campo Buscar
ja: 検索フィールドの消去
ko: 검색 필드 지우기
zh_hk: 清除搜尋欄位

source: To clear both the search string and the list of search results, use the Search field or the Edit menu.
de: Verwenden Sie zum Löschen der Suchzeichenfolge und der Suchergebnisse das Suchfeld oder das Menü "Bearbeiten".
es: Para borrar la cadena de búsqueda y la lista de resultados de búsqueda, utilice el campo Buscar o el menú Editar.
ja: 検索文字列と検索結果リストの両方を消去するには、「検索」フィールドまたは「編集」メニューを使用します。
ko: 검색 문자열과 검색 결과 목록을 모두 지우려면 검색 필드 또는 편집 메뉴를 사용합니다.
zh_hk: 若要清除搜尋字串與搜尋結果清單，請使用 [搜尋] 欄位或 [編輯] 功能表。

source: In the Search field, click the <literal>X</literal> icon.
de: Klicken Sie im Suchfeld auf das Symbol <literal>X</literal>.
es: En el campo Buscar, haga clic en el icono <literal>X</literal>.
ja: 「検索」フィールドで <literal>X</literal> アイコンをクリックします。
ko: 검색 필드에서 <literal>X</literal> 아이콘을 누릅니다.
zh_hk: 在 [搜尋] 欄位中，按一下 <literal>X</literal> 圖示。

source: On the <guimenu>Edit</guimenu> menu, select the <guimenuitem>Clear Search</guimenuitem> option.
de: Wählen Sie im Menü <guimenu>Bearbeiten</guimenu> die Option <guimenuitem>Suche löschen</guimenuitem>.
es: En el menú <guimenu>Editar</guimenu>, seleccione la opción <guimenuitem>Borrar búsqueda</guimenuitem>.
ja: <guimenu>「編集」</guimenu>メニューで<guimenuitem>「検索を消去」</guimenuitem>オプションを選択します。
ko: <guimenu>편집</guimenu> 메뉴에서 <guimenuitem>검색 지우기</guimenuitem> 옵션을 선택합니다.
zh_hk: 在 [<guimenu>編輯</guimenu>] 功能表中，選取 [<guimenuitem>清除搜尋</guimenuitem>] 選項。

source: Cancel the Search
de: Suche abbrechen
es: Cancelar la búsqueda
ja: 検索の取り消し
ko: 검색 취소
zh_hk: 取消搜尋

source: During a search operation, a busy bar displays at the right end of the status bar at the bottom of the Package Manager window. On the right end of the busy bar is an <literal>X</literal> icon. Click the <literal>X</literal> icon in the busy bar to cancel the search in progress.
de: Während eines Suchvorgangs wird im unteren Bereich des Fensters "Package Manager" auf der rechten Seite der Statusleiste eine Fortschrittsleiste angezeigt. Auf der rechten Seite der Fortschrittsleiste befindet sich ein <literal>X</literal>-Symbol. Klicken Sie auf das <literal>X</literal>-Symbol in der Fortschrittsleiste, um den Suchvorgang abzubrechen.
es: Durante una operación de búsqueda, aparece una barra de ocupación en el extremo derecho de la barra de estado ubicada en la parte inferior de la ventana de Package Manager. En el extremo derecho de la barra de ocupación hay un icono <literal>X</literal>. Haga clic en el icono <literal>X</literal> de la barra de ocupación para cancelar la búsqueda en curso.
ja: 検索の実行中は、パッケージマネージャーウィンドウ下部のステータスバーの右端にビジーバーが表示されます。ビジーバーの右端に <literal>X</literal> アイコンがあります。実行中の検索を取り消すには、ビジーバーの <literal>X</literal> アイコンをクリックします。
ko: 검색 작업 중에는 패키지 관리자 창 아래쪽에 있는 상태 표시줄의 오른쪽 끝에 사용 중 표시줄이 표시됩니다. 사용 중 표시줄의 오른쪽 끝에는 <literal>X</literal> 아이콘이 표시됩니다. 진행 중인 검색을 취소하려면 사용 중 표시줄의 <literal>X</literal> 아이콘을 누릅니다.
zh_hk: 執行搜尋時，[套裝軟體管理員] 視窗底部狀態列右邊會顯示一個忙碌中狀態列。忙碌中狀態列右邊有一個 <literal>X</literal> 圖示。按一下忙碌中狀態列的 <literal>X</literal> 圖示即可在進行搜尋時取消搜尋。

source: Redisplay Previous Search Results
de: Vorherige Suchergebnisse erneut anzeigen
es: Volver a visualizar los resultados de la búsqueda anterior
ja: 以前の検索結果の再表示
ko: 이전 검색 결과 다시 표시
zh_hk: 重新顯示之前的搜尋結果

source: Results from searches that you have already performed during the current Package Manager session are saved in <guimenuitem>Recent Searches</guimenuitem> in the categories pane.
de: Die Suchergebnisse eines Suchvorgangs, den Sie während der aktuellen Package Manager-Sitzung ausgeführt haben, werden im Kategoriebereich unter <guimenuitem>Letzte Suchläufe</guimenuitem> gespeichert.
es: Los resultados de las búsquedas que ya ha realizado durante la sesión actual de Package Manager se guardan en <guimenuitem>Búsquedas recientes</guimenuitem>, en el panel de categorías.
ja: 現在のパッケージマネージャーセッションですでに実行した検索の結果は、カテゴリ区画の<guimenuitem>「最近の検索」</guimenuitem>に保存されています。
ko: 현재 패키지 관리자 세션 중 이미 수행한 검색의 결과가 범주 창의 <guimenuitem>최근 검색</guimenuitem>에 저장되어 있습니다.
zh_hk: 您在目前的套裝軟體管理員階段作業中已經執行的搜尋結果，會儲存在類別窗格的 [<guimenuitem>最近的搜尋</guimenuitem>] 中。

source: Select the <guimenuitem>Recent Searches</guimenuitem> label in the categories pane to display an informational message in the package list pane. The package list pane shows the list of previous search results. Click a "results" link to redisplay those results.
de: Wählen Sie im Kategoriebereich die Beschriftung <guimenuitem>Letzte Suchläufe</guimenuitem>, um im Paketlistenbereich eine Informationsmeldung anzuzeigen. Im Paketlistenbereich wird eine Liste der vorherigen Suchergebnisse angezeigt. Klicken Sie auf eine "Ergebnisse"-Verknüpfung, um diese Suchergebnisse erneut anzuzeigen.
es: Seleccione la etiqueta <guimenuitem>Búsquedas recientes</guimenuitem> en el panel de categorías para mostrar un mensaje informativo en el panel de la lista de paquetes. El panel de la lista de paquetes muestra la lista de resultados de la búsqueda anterior. Haga clic en el enlace "resultados" para volver a visualizar esos resultados.
ja: カテゴリ区画で<guimenuitem>「最近の検索」</guimenuitem>ラベルをクリックすると、パッケージリスト区画に情報メッセージが表示されます。パッケージリスト区画には以前の検索結果が表示されます。それらの結果を再表示するには、「結果」リンクをクリックします。
ko: 패키지 목록 창에 정보 메시지를 표시하려면 범주 창에서 <guimenuitem>최근 검색</guimenuitem> 레이블을 선택합니다. 그러면 패키지 목록 창에 이전 검색 결과 목록이 표시됩니다. 해당 결과를 다시 표시하려면 "결과" 링크를 누릅니다.
zh_hk: 在類別窗格中選取 [<guimenuitem>最近的搜尋</guimenuitem>] 標籤，即可在套裝軟體清單窗格中顯示資訊訊息。套裝軟體清單窗格會顯示之前搜尋結果的清單。按一下「結果」連結即可重新顯示那些結果。

source: Select the arrow to the left of the <guimenuitem>Recent Searches</guimenuitem> label to expand or hide the list of previous search results in the categories pane. Select an item in the list of recent searches to redisplay those search results.
de: Wählen Sie den Pfeil links neben <guimenuitem>Letzte Suchläufe</guimenuitem>, um die Liste der vorherigen Suchergebnisse im Kategoriebereich zu erweitern oder auszublenden. Wählen Sie in der Liste der letzten Suchläufe ein Element aus, um diese Suchergebnisse erneut anzuzeigen.
es: Seleccione la flecha hacia la izquierda de la etiqueta <guimenuitem>Búsquedas recientes</guimenuitem> para ampliar u ocultar la lista de resultados de la búsqueda anterior en el panel de categorías. Seleccione un elemento de la lista de búsquedas recientes para volver a visualizar esos resultados de búsqueda.
ja: <guimenuitem>「最近の検索」</guimenuitem>ラベルの左にある矢印をクリックすると、カテゴリ区画で以前の検索結果のリストを展開したり非表示にしたりできます。最近の検索のリストで項目を選択すると、それらの検索結果が再表示されます。
ko: 범주 창에서 이전 검색 결과 목록을 확장하거나 숨기려면 <guimenuitem>최근 검색</guimenuitem> 레이블 왼쪽에 있는 화살표를 선택합니다. 해당 검색 결과를 다시 표시하려면 최근 검색 목록에서 항목을 선택합니다.
zh_hk: 選取 [<guimenuitem>最近的搜尋</guimenuitem>] 標籤左邊的箭頭，即可在類別窗格中展開或隱藏之前搜尋結果的清單。在最近的搜尋清單中選取一個項目，即可重新顯示那些搜尋結果。
