Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: <guimenuitem>All Publishers (Search)</guimenuitem> — Shows an informational message in the package list pane instead of a list of packages. The message lists all publishers that you have configured and reminds you how to view all packages from those publishers. See <xref linkend="search-pkg"/> for information about searching with <guimenuitem>All Publishers (Search)</guimenuitem>.
de: <guimenuitem>Alle Herausgeber (Suche)</guimenuitem> – Zeigt im Paketlistenbereich eine Informationsmeldung anstelle einer Liste der Pakete an. In der Meldung werden alle Herausgeber aufgeführt, die Sie konfiguriert haben. In dieser Meldung wird außerdem beschrieben, wie Sie alle Pakete dieser Herausgeber anzeigen können. Unter <xref linkend="search-pkg"/> finden Sie weitere Informationen zum Suchen mithilfe der Option <guimenuitem>Alle Herausgeber (Suche)</guimenuitem>.
es: <guimenuitem>Todos los editores (buscar)</guimenuitem>: muestra un mensaje informativo en el panel de la lista de paquetes, en lugar de una lista de paquetes. El mensaje muestra todos los editores que ha configurado y le recuerda cómo ver todos los paquetes de esos editores. Consulte <xref linkend="search-pkg"/> para obtener información sobre cómo realizar búsquedas con <guimenuitem>Todos los editores (buscar)</guimenuitem>.
ja: <guimenuitem>「すべての発行元 (検索)」</guimenuitem> — パッケージリスト区画にパッケージのリストではなく情報メッセージを表示します。メッセージには、設定済みの発行元の一覧と、それらの発行元からのすべてのパッケージを表示する方法が示されます。<guimenuitem>「すべての発行元 (検索)」</guimenuitem>を使用した検索の詳細については、<xref linkend="search-pkg"/>を参照してください。
ko: <guimenuitem>모든 게시자(검색)</guimenuitem> — 패키지 목록 창에 패키지 목록 대신 정보 메시지를 표시합니다. 메시지에는 구성한 모든 게시자가 나열되며 해당 게시자의 모든 패키지를 확인할 수 있는 방법이 표시됩니다. <guimenuitem>모든 게시자(검색)</guimenuitem>를 사용하는 검색에 대한 자세한 내용은 <xref linkend="search-pkg"/>을 참조하십시오.
zh_hk: <guimenuitem>全部的發佈者 (搜尋)</guimenuitem> — 在套裝軟體清單窗格中顯示資訊訊息，而非顯示套裝軟體清單。訊息會列出您已經配置的所有發佈者，並提醒您如何檢視來自這些發佈者的所有套裝軟體。請參閱 <xref linkend="search-pkg"/> 瞭解有關使用 [<guimenuitem>全部的發佈者 (搜尋)</guimenuitem>] 進行搜尋的資訊。

source: <guimenuitem>Add...</guimenuitem> — Opens the Add Publisher window.
de: <guimenuitem>Hinzufügen...</guimenuitem> – Öffnet das Fenster "Herausgeber hinzufügen".
es: <guimenuitem>Agregar...</guimenuitem>: abre la ventana Agregar editor.
ja: <guimenuitem>「追加...」</guimenuitem> — 「発行元を追加」ウィンドウを開きます。
ko: <guimenuitem>추가...</guimenuitem> — 게시자 추가 창을 엽니다.
zh_hk: <guimenuitem>增加...</guimenuitem> — 開啟 [增加發佈者] 視窗。

source: By Package Status
de: Nach Paketstatus
es: Por estado de paquete
ja: パッケージ状態別
ko: 패키지 상태별
zh_hk: 依套裝軟體狀態

source: The <guimenu>View</guimenu> drop-down menu enables you to list packages according to package status. Package status can be installed, not installed, or an update is available. The icons displayed on the <guimenu>View</guimenu> menu match the icons displayed in the Status column of the package list pane.
de: Über das Dropdown-Menü <guimenu>Ansicht</guimenu> können Sie die Pakete in Abhängigkeit des Paketstatus aufführen. Der Paketstatus zeigt an, ob ein Paket installiert oder nicht installiert ist oder ob ein Update für das Paket verfügbar ist. Die Symbole im Menü <guimenu>Ansicht</guimenu> entsprechen den Symbolen, die in der Spalte "Status" des Paketlistenbereichs angezeigt werden.
es: El menú desplegable <guimenu>Ver</guimenu> le permite mostrar paquetes según el estado del paquete. El paquete puede tener el estado Instalado, No instalado o Actualizaciones disponibles. Los iconos mostrados en el menú <guimenu>Ver</guimenu> coinciden con los iconos mostrados en la columna Estado del panel de la lista de paquetes.
ja: <guimenu>「表示」</guimenu>ドロップダウンメニューを使用すると、パッケージ状態に基づいてパッケージを一覧表示できます。パッケージ状態は、インストール済み、未インストール、更新利用可能のいずれかです。<guimenu>「表示」</guimenu>メニューに表示されるアイコンは、パッケージリスト区画の「状態」列に表示されるアイコンと一致します。
ko: <guimenu>보기</guimenu> 드롭다운 메뉴를 통해 패키지 상태에 따라 패키지를 나열할 수 있습니다. 패키지 상태는 설치됨, 설치되지 않음, 업데이트를 사용할 수 있음일 수 있습니다. <guimenu>보기</guimenu> 메뉴에 표시되는 아이콘은 패키지 목록 창의 상태 열에 표시되는 아이콘과 동일합니다.
zh_hk: [<guimenu>檢視</guimenu>] 下拉式功能表可讓您依照套裝軟體狀態列出套裝軟體。套裝軟體狀態可能是已安裝、未安裝或有更新可用。[<guimenu>檢視</guimenu>] 功能表中顯示的圖示與套裝軟體清單窗格 [狀態] 資料欄中顯示的圖示相符。

source: <guimenuitem>All Packages</guimenuitem> — Shows all packages available from the selected publisher in the selected category or matching the specified search string.
de: <guimenuitem>Alle Pakete</guimenuitem> – Zeigt alle von dem ausgewählten Herausgeber verfügbaren Pakete, die in der ausgewählten Kategorie enthalten sind oder mit der angegebenen Suchzeichenfolge übereinstimmen.
es: <guimenuitem>Todos los paquetes</guimenuitem>: muestra todos los paquetes disponibles del editor seleccionado en la categoría seleccionada o que coinciden con la cadena de búsqueda especificada.
ja: <guimenuitem>「すべてのパッケージ」</guimenuitem> — 選択した発行元の選択したカテゴリ内のパッケージまたは指定した検索文字列と一致するパッケージをすべて表示します。
ko: <guimenuitem>모든 패키지</guimenuitem> — 선택된 범주 내 선택된 게시자로부터 사용 가능한 모든 패키지 또는 지정된 검색 문자열과 일치하는 모든 패키지를 표시합니다.
zh_hk: <guimenuitem>所有套裝軟體</guimenuitem> — 顯示可從所選類別的所選發佈者取得的所有套裝軟體，或者是與指定搜尋字串相符的所有套裝軟體。

source: Example: To list all web services packages from the <literal>solaris</literal> publisher that are installed, not installed, or have updates available, select <literal>solaris</literal> from the <guimenu>Publisher</guimenu> menu, select the <menuchoice><guimenu>Web Services</guimenu></menuchoice> category, and select <guimenuitem>All Packages</guimenuitem> from the <guimenu>View</guimenu> menu.
de: Beispiel: Wählen Sie zum Aufführen aller Web Services-Pakete vom Herausgeber <literal>solaris</literal>, die installiert oder nicht installiert sind oder für die Updates verfügbar sind, im Menü <guimenu>Herausgeber</guimenu> die Option <literal>solaris</literal>. Wählen Sie die Kategorie <menuchoice><guimenu>Web Services</guimenu></menuchoice> und anschließend die Option <guimenuitem>Alle Pakete</guimenuitem>, die sich im Menü <guimenu>Ansicht</guimenu> befindet.
es: Ejemplo: Si desea mostrar todos los paquetes de servicios web del editor <literal>solaris</literal> que están instalados, que no están instalados o que tienen actualizaciones disponibles, seleccione <literal>solaris</literal> del menú <guimenu>Editor</guimenu>, luego seleccione la categoría <menuchoice><guimenu>Servicios web</guimenu></menuchoice> y, luego, <guimenuitem>Todos los paquetes</guimenuitem> del menú <guimenu>Ver</guimenu>.
ja: 例: <literal>solaris</literal> 発行元の Web サービスパッケージで、インストール済みのもの、インストールされていないもの、または使用可能な更新が存在するものをすべて表示するには、<guimenu>「発行元」</guimenu>メニューから <literal>solaris</literal> を選択し、<menuchoice><guimenu>「Web サービス」</guimenu></menuchoice>カテゴリを選択し、<guimenu>「表示」</guimenu>メニューから<guimenuitem>「すべてのパッケージ」</guimenuitem>を選択します。
ko: 예: <literal>solaris</literal> 게시자로부터 설치된 웹 서비스 패키지, 설치되지 않은 웹 서비스 패키지, 업데이트를 사용할 수 있는 웹 서비스 패키지를 모두 나열하려면 <guimenu>게시자</guimenu> 메뉴에서 <literal>solaris</literal>를 선택하고 <menuchoice><guimenu>웹 서비스</guimenu></menuchoice> 범주를 선택한 다음 <guimenu>보기</guimenu> 메뉴에서 <guimenuitem>모든 패키지</guimenuitem>를 선택합니다.
zh_hk: 範例：若要列出來自 <literal>solaris</literal> 發佈者且已安裝、未安裝或有可用更新的所有 Web 服務套裝軟體，請從 [<guimenu>發佈者</guimenu>] 功能表選取 <literal>solaris</literal>，選取 <menuchoice>[<guimenu>Web 服務</guimenu>]</menuchoice> 類別，然後從 [<guimenu>檢視</guimenu>] 功能表選取 [<guimenuitem>所有套裝軟體</guimenuitem>]。

source: <guimenuitem>Installed Packages</guimenuitem> — Shows all installed packages from the selected publisher in the selected category or matching the specified search string. See also the <menuchoice><guimenu>Publisher</guimenu><guimenuitem>All Installed Packages</guimenuitem></menuchoice> option.
de: <guimenuitem>Installierte Pakete</guimenuitem> – Zeigt alle installierten Pakete des ausgewählten Herausgebers an, die in der ausgewählten Kategorie enthalten sind oder mit der angegebenen Suchzeichenfolge übereinstimmen. Weitere Informationen dazu finden Sie unter <menuchoice><guimenu>Herausgeber</guimenu><guimenuitem>Alle installierten Pakete</guimenuitem></menuchoice>.
es: <guimenuitem>Paquetes instalados</guimenuitem>: muestra todos los paquetes instalados del editor seleccionado en la categoría seleccionada o que coinciden con la cadena de búsqueda especificada. También consulte la opción <menuchoice><guimenu>Editor</guimenu>,<guimenuitem>Todos los paquetes instalados</guimenuitem></menuchoice>.
ja: <guimenuitem>「インストール済みパッケージ」</guimenuitem> — 選択した発行元の選択したカテゴリ内のパッケージまたは指定した検索文字列と一致するパッケージで、インストール済みのものをすべて表示します。<menuchoice><guimenu>「発行元」</guimenu><guimenuitem>「すべてのインストール済みパッケージ」</guimenuitem></menuchoice>オプションも参照してください。
ko: <guimenuitem>설치된 패키지</guimenuitem> — 선택된 범주 내 선택된 게시자로부터 설치된 모든 패키지 또는 지정된 검색 문자열과 일치하는 설치된 모든 패키지를 표시합니다. <menuchoice><guimenu>게시자</guimenu><guimenuitem>설치된 모든 패키지</guimenuitem></menuchoice> 옵션을 참조하십시오.
zh_hk: <guimenuitem>已安裝的套裝軟體</guimenuitem> — 顯示在所選類別中，來自所選發佈者且您已安裝的所有套裝軟體，或者是與指定搜尋字串相符的所有已安裝套裝軟體。請參閱 <menuchoice>[<guimenu>發佈者</guimenu>] [<guimenuitem>所有已安裝的套裝軟體</guimenuitem>]</menuchoice> 選項。

source: Example: To list only the web server packages that are installed from the <literal>solaris</literal> publisher, select <literal>solaris</literal> from the <guimenu>Publisher</guimenu> menu, select the <menuchoice><guimenu>Web Services</guimenu></menuchoice> category, and select <guimenuitem>Installed Packages</guimenuitem> from the <guimenu>View</guimenu> menu.
de: Beispiel: Wählen Sie zum Aufführen nur der Webserverpakete, die vom Herausgeber <literal>solaris</literal> installiert wurden, im Menü <guimenu>Herausgeber</guimenu> die Option <literal>solaris</literal>. Wählen Sie die Kategorie <menuchoice><guimenu>Web Services</guimenu></menuchoice> und dann die Option <guimenuitem>Installierte Pakete</guimenuitem>, die sich im Menü <guimenu>Ansicht</guimenu> befindet.
es: Ejemplo: Si desea mostrar sólo los paquetes de servidor web que están instalados del editor <literal>solaris</literal>, seleccione <literal>solaris</literal> del menú <guimenu>Editor</guimenu>, luego seleccione la categoría <menuchoice><guimenu>Servicios web</guimenu></menuchoice> y, luego, <guimenuitem>Paquetes instalados</guimenuitem> del menú <guimenu>Ver</guimenu>.
ja: 例: <literal>solaris</literal> 発行元の Web サービスパッケージで、インストール済みのものだけを一覧表示するには、<guimenu>「発行元」</guimenu>メニューから <literal>solaris</literal> を選択して、<menuchoice><guimenu>「Web サービス」</guimenu></menuchoice>カテゴリを選択し、<guimenu>「表示」</guimenu>メニューから<guimenuitem>「インストール済みパッケージ」</guimenuitem>を選択します。
ko: 예: <literal>solaris</literal> 게시자로부터 설치된 웹 서버 패키지만 나열하려면 <guimenu>게시자</guimenu> 메뉴에서 <literal>solaris</literal>를 선택하고 <menuchoice><guimenu>웹 서비스</guimenu></menuchoice> 범주를 선택한 다음 <guimenu>보기</guimenu> 메뉴에서 <guimenuitem>설치된 패키지</guimenuitem>를 선택합니다.
zh_hk: 範例：若只要列出來自 <literal>solaris</literal> 發佈者且已安裝的 Web 伺服器套裝軟體，請從 [<guimenu>發佈者</guimenu>] 功能表選取 <literal>solaris</literal>，選取 <menuchoice>[<guimenu>Web 服務</guimenu>]</menuchoice> 類別，然後從 [<guimenu>檢視</guimenu>] 功能表選取 [<guimenuitem>已安裝的套裝軟體</guimenuitem>]。

source: <guimenuitem>Updates</guimenuitem> — Shows all packages from the selected publisher in the selected category or matching the specified search string that have updates available.
de: <guimenuitem>Updates</guimenuitem> – Zeigt alle Pakete vom ausgewählten Herausgeber an, die in der ausgewählten Kategorie enthalten sind oder mit der angegebenen Suchzeichenfolge übereinstimmen und für die Updates verfügbar sind.
es: <guimenuitem>Actualizaciones</guimenuitem>: muestra todos los paquetes del editor seleccionado en la categoría seleccionada o que coinciden con la cadena de búsqueda especificada que tienen actualizaciones disponibles.
ja: <guimenuitem>「更新」</guimenuitem> — 選択した発行元の選択したカテゴリ内のパッケージまたは指定した検索文字列と一致するパッケージで、使用可能な更新が存在するものをすべて表示します。
ko: <guimenuitem>업데이트</guimenuitem> — 선택된 범주 내 선택된 게시자로부터 업데이트를 사용할 수 있는 모든 패키지 또는 지정된 검색 문자열과 일치하는 업데이트를 사용할 수 있는 모든 패키지를 표시합니다.
zh_hk: <guimenuitem>更新</guimenuitem> — 顯示在所選類別中，來自所選發佈者且有更新可用的所有套裝軟體，或者是與指定搜尋字串相符且有更新可用的所有套裝軟體。

source: Example: To list all device drivers that have updates available from all publishers, select <guimenuitem>All Publishers</guimenuitem> from the <guimenu>Publisher</guimenu> menu, select the <guimenu>Drivers</guimenu> category, and select <guimenuitem>Updates</guimenuitem> from the <guimenu>View</guimenu> menu.
de: Beispiel: Wählen Sie zum Aufführen aller Gerätetreiber, für die Updates von allen Herausgebern verfügbar sind, im Menü <guimenu>Herausgeber</guimenu> die Option <guimenuitem>Alle Herausgeber</guimenuitem>. Wählen Sie die Kategorie <guimenu>Treiber</guimenu> und anschließend im Menü <guimenu>Ansicht</guimenu> die Option <guimenuitem>Updates</guimenuitem>.
es: Ejemplo: Para mostrar todos los controladores de dispositivos que tienen actualizaciones disponibles de todos los editores, seleccione <guimenuitem>Todos los editores</guimenuitem> del menú <guimenu>Editor</guimenu>, luego seleccione la categoría <guimenu>Controladores</guimenu> y, luego, seleccione <guimenuitem>Actualizaciones</guimenuitem> del menú <guimenu>Ver</guimenu>.
ja: 例: すべての発行元のデバイスドライバで、使用可能な更新が存在するものをすべて表示するには、<guimenu>「発行元」</guimenu>メニューから<guimenuitem>「すべての発行元」</guimenuitem>を選択し、<guimenu>「ドライバ」</guimenu>カテゴリを選択し、<guimenu>「表示」</guimenu>メニューから<guimenuitem>「更新」</guimenuitem>を選択します。
ko: 예: 모든 게시자로부터 업데이트를 사용할 수 있는 장치 드라이버를 모두 나열하려면 <guimenu>게시자</guimenu> 메뉴에서 <guimenuitem>모든 게시자</guimenuitem>를 선택하고 <guimenu>드라이버</guimenu> 범주를 선택한 다음 <guimenu>보기</guimenu> 메뉴에서 <guimenuitem>업데이트</guimenuitem>를 선택합니다.
zh_hk: 範例：若要列出可從所有發佈者取得可用更新的所有裝置驅動程式，請從 [<guimenu>發佈者</guimenu>] 功能表選取 [<guimenuitem>所有發佈者</guimenuitem>]，選取 [<guimenu>驅動程式</guimenu>] 類別，然後從 [<guimenu>檢視</guimenu>] 功能表選取 [<guimenuitem>更新</guimenuitem>]。

source: <guimenuitem>Not Installed Packages</guimenuitem> — Shows all packages from the selected publisher in the selected category or matching the specified search string that are not installed.
de: <guimenuitem>Nicht installierte Pakete</guimenuitem> – Zeigt alle Pakete vom ausgewählten Herausgeber an, die in der ausgewählten Kategorie enthalten sind oder mit der angegebenen Suchzeichenfolge übereinstimmen und nicht installiert sind.
es: <guimenuitem>Paquetes no instalados</guimenuitem>: muestra todos los paquetes del editor seleccionado en la categoría seleccionada o que coinciden con la cadena de búsqueda especificada que no están instalados.
ja: <guimenuitem>「インストールされていないパッケージ」</guimenuitem> — 選択した発行元の選択したカテゴリ内のパッケージまたは指定した検索文字列と一致するパッケージで、インストールされていないものをすべて表示します。
ko: <guimenuitem>설치되지 않은 패키지</guimenuitem> — 선택된 범주 내 선택된 게시자로부터 설치되지 않은 모든 패키지 또는 지정된 검색 문자열과 일치하는 설치되지 않은 모든 패키지를 표시합니다.
zh_hk: <guimenuitem>尚未安裝的套裝軟體</guimenuitem> — 顯示在所選類別中，來自所選發佈者且您尚未安裝的所有套裝軟體，或者是與指定搜尋字串相符且尚未安裝的所有套裝軟體。

source: Example: To list all the font packages that are currently not installed from the <literal>solaris</literal> publisher, select <literal>solaris</literal> from the <guimenu>Publisher</guimenu> menu, select the <menuchoice><guimenu>System</guimenu><guimenuitem>Fonts</guimenuitem></menuchoice> category, and then select <guimenuitem>Not Installed Packages</guimenuitem> from the <guimenu>View</guimenu> menu.
de: Beispiel: Wählen Sie zum Aufführen aller zurzeit nicht installierter Schriftartenpakete vom Herausgeber <literal>solaris</literal> im Menü <guimenu>Herausgeber</guimenu> die Option <literal>solaris</literal>. Wählen Sie dann die Kategorie <menuchoice><guimenu>System</guimenu><guimenuitem>Schriftarten</guimenuitem></menuchoice> und anschließend im Menü <guimenu>Ansicht</guimenu> die Option <guimenuitem>Nicht installierte Pakete</guimenuitem>.
es: Ejemplo: Si desea mostrar todos los paquetes de tipos de letra que actualmente no están instalados del editor <literal>solaris</literal>, seleccione <literal>solaris</literal> del menú <guimenu>Editor</guimenu>, luego seleccione la categoría <menuchoice><guimenu>Sistema</guimenu><guimenuitem>Tipos de letra</guimenuitem></menuchoice> y, luego, seleccione <guimenuitem>Paquetes no instalados</guimenuitem> del menú <guimenu>Ver</guimenu>.
ja: 例: <literal>solaris</literal> 発行元のフォントパッケージで、現在インストールされていないものをすべて表示するには、<guimenu>「発行元」</guimenu>メニューから <literal>solaris</literal> を選択し、<menuchoice><guimenu>「システム」</guimenu><guimenuitem>「フォント」</guimenuitem></menuchoice>カテゴリを選択し、<guimenu>「表示」</guimenu>メニューから<guimenuitem>「インストールされていないパッケージ」</guimenuitem>を選択します。
ko: 예: 현재 <literal>solaris</literal> 게시자로부터 설치되지 않은 글꼴 패키지를 모두 나열하려면 <guimenu>게시자</guimenu> 메뉴에서 <literal>solaris</literal>를 선택하고 <menuchoice><guimenu>시스템</guimenu><guimenuitem>글꼴</guimenuitem></menuchoice> 범주를 선택한 다음 <guimenu>보기</guimenu> 메뉴에서 <guimenuitem>설치되지 않은 패키지</guimenuitem>를 선택합니다.
zh_hk: 範例：若要列出來自 <literal>solaris</literal> 發佈者且目前尚未安裝的所有字型套裝軟體，請從 [<guimenu>發佈者</guimenu>] 功能表選取 <literal>solaris</literal>，選取 <menuchoice>[<guimenu>系統</guimenu>] [<guimenuitem>字型</guimenuitem>]</menuchoice> 類別，然後從 [<guimenu>檢視</guimenu>] 功能表選取 [<guimenuitem>尚未安裝的套裝軟體</guimenuitem>]。

source: <guimenuitem>Selected Packages</guimenuitem> — Lists all packages that are currently selected. See <xref linkend="select-pkg"/>.
de: <guimenuitem>Ausgewählte Pakete</guimenuitem> – Führt alle Pakete auf, die zurzeit ausgewählt sind. Weitere Informationen finden Sie unter <xref linkend="select-pkg"/>.
es: <guimenuitem>Paquetes seleccionados</guimenuitem>: muestra todos los paquetes que están actualmente seleccionados. Consulte <xref linkend="select-pkg"/>.
ja: <guimenuitem>「選択したパッケージ」</guimenuitem> — 現在選択されているすべてのパッケージを表示します。<xref linkend="select-pkg"/>を参照してください。
ko: <guimenuitem>선택된 패키지</guimenuitem> — 현재 선택된 모든 패키지를 나열합니다. <xref linkend="select-pkg"/>을 참조하십시오.
zh_hk: <guimenuitem>選取的套裝軟體</guimenuitem> — 列出目前選取的所有套裝軟體。請參閱 <xref linkend="select-pkg"/>。

source: By Category
de: Nach Kategorie
es: Por categoría
ja: カテゴリ別
ko: 범주별
zh_hk: 依類別

source: You can browse the available packages by type of software in the category pane on the left side of the Package Manager window. Click a category name to show subcategories. Packages in the selected category or subcategory are listed in the package list pane according to the selected publisher and package status and the specified search criteria.
de: Links im Fenster "Package Manager" können Sie im Kategoriebereich die verfügbaren Pakete nach Softwaretyp durchsuchen. Klicken Sie auf einen Kategorienamen, um die Unterkategorien anzuzeigen. Pakete in der ausgewählten Kategorie oder Unterkategorie werden in Abhängigkeit vom ausgewählten Herausgeber, dem Status der Pakete und den angegebenen Suchkriterien im Paketlistenbereich aufgeführt.
es: Puede buscar los paquetes disponibles por tipo de software en el panel de la categoría que se encuentra en el margen izquierdo de la ventana de Package Manager. Haga clic en el nombre de la categoría para mostrar las subcategorías. Los paquetes de la categoría o la subcategoría seleccionada se muestran en el panel de la lista de paquetes según el estado del editor y el paquete seleccionados y los criterios de búsqueda especificados.
ja: パッケージマネージャーウィンドウの左側のカテゴリ区画では、使用可能なパッケージをソフトウェアのタイプ別に参照できます。サブカテゴリを表示するにはカテゴリ名をクリックします。選択した発行元とパッケージ状態、および指定した検索条件に基づいて、選択したカテゴリまたはサブカテゴリのパッケージがパッケージリスト区画に一覧表示されます。
ko: 패키지 관리자 창 왼쪽에 있는 범주 창에서 소프트웨어 유형별로 사용 가능한 패키지를 찾아볼 수 있습니다. 하위 범주를 표시하려면 범주 이름을 누릅니다. 선택된 게시자 및 패키지 상태와 지정된 검색 조건에 따라 선택된 범주 또는 하위 범주의 패키지가 패키지 목록 창에 나열됩니다.
zh_hk: 您可以在 [套裝軟體管理員] 視窗左側的類別窗格中，依軟體類型瀏覽可用的套裝軟體。按一下類別名稱以顯示子類別。套裝軟體清單窗格中就會依照所選的發佈者、套裝軟體狀態及指定的搜尋條件，列出所選類別或子類別中的套裝軟體。

source: In addition to named types of software, the categories pane also enables you to select <guimenuitem>All Categories</guimenuitem> and <guimenuitem>Recent Searches</guimenuitem>. See <xref linkend="search-pkg"/> “Repeat a Previous Search” for information about <guimenuitem>Recent Searches</guimenuitem>.
de: Im Kategoriebereich können Sie neben den benannten Softwaretypen auch <guimenuitem>Alle Kategorien</guimenuitem> und <guimenuitem>Letzte Suchläufe</guimenuitem> auswählen. Unter <xref linkend="search-pkg"/> "Repeat a Previous Search" finden Sie weitere Informationen zu den <guimenuitem>Letzten Suchläufen</guimenuitem>.
es: Además de los tipos de software designados, el panel de categorías también le permite seleccionar <guimenuitem>Todas las categorías</guimenuitem> y <guimenuitem>Búsquedas recientes</guimenuitem>. Consulte <xref linkend="search-pkg"/> "Repetir la búsqueda anterior" para obtener información sobre <guimenuitem>Búsquedas recientes</guimenuitem>.
ja: 指定したタイプのソフトウェアに加え、カテゴリ区画では<guimenuitem>「すべてのカテゴリ」</guimenuitem>および<guimenuitem>「最近の検索」</guimenuitem>を選択することもできます。<guimenuitem>「最近の検索」</guimenuitem>の詳細については、<xref linkend="search-pkg"/>の「以前の検索の繰り返し」を参照してください。
ko: 범주 창에서는 소프트웨어 유형을 지정할 수도 있지만 <guimenuitem>모든 범주</guimenuitem> 및 <guimenuitem>최근 검색</guimenuitem>을 선택할 수도 있습니다. <guimenuitem>최근 검색</guimenuitem>에 대한 자세한 내용은 <xref linkend="search-pkg"/> "이전 검색 반복"을 참조하십시오.
zh_hk: 除了指定的軟體類型之外，類別窗格也可以讓您選取 [<guimenuitem>所有類別</guimenuitem>] 與 [<guimenuitem>最近的搜尋</guimenuitem>]。請參閱 <xref linkend="search-pkg"/> -「重複之前的搜尋」，瞭解有關 [<guimenuitem>最近的搜尋</guimenuitem>] 的資訊。

source: Searching for Packages
de: Suchen von Paketen
es: Búsqueda de paquetes
ja: パッケージの検索
ko: 패키지 검색
zh_hk: 搜尋套裝軟體

source: Use one of the following two methods to search for packages:
de: Wenden Sie eine der zwei folgenden Methoden an, um Pakete zu suchen:
es: Utilice uno de los siguientes dos métodos para buscar paquetes:
ja: パッケージを検索するには、次の 2 つの方法のいずれかを使用します。
ko: 다음 두 가지 방법 중 하나로 패키지를 검색할 수 있습니다.
zh_hk: 使用下列兩種方法的其中一種來搜尋套裝軟體：

source: Focus on the package list pane (for example, select <menuchoice><guimenu>Edit</guimenu><guimenuitem>Go to package list</guimenuitem></menuchoice> and start typing. As you type, matches are identified among the packages currently listed in the package list pane.
de: Fokussieren Sie den Paketlistenbereich (wählen Sie dazu z. B. <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Zur Paketliste wechseln</guimenuitem></menuchoice>) und geben Sie den Namen ein. Während der Tastatureingabe werden Übereinstimmungen unter den Paketen ermittelt, die zurzeit im Paketlistenbereich aufgeführt sind.
es: Concéntrese en el panel de la lista de paquetes (por ejemplo, seleccione <menuchoice><guimenu>Editar</guimenu><guimenuitem>Ir a lista de paquetes</guimenuitem></menuchoice> y comience a escribir. A medida que escribe, se identifican las coincidencias entre los paquetes actualmente mostrados en el panel de la lista de paquetes.
ja: パッケージリスト区画にフォーカスを移動します (たとえば、<menuchoice><guimenu>「編集」</guimenu><guimenuitem>「パッケージリストへ移動」</guimenuitem></menuchoice>を選択し、入力を開始します。入力するにつれて、パッケージリスト区画に現在表示されているパッケージの中で一致するものが特定されます。
ko: 패키지 목록 창에서 포커스를 설정합니다. 예를 들어, <menuchoice><guimenu>편집</guimenu><guimenuitem>패키지 목록으로 이동</guimenuitem></menuchoice>을 선택하고 입력을 시작합니다. 입력하는 내용에 따라 현재 패키지 목록 창에 나열된 패키지 중에서 일치 항목이 식별됩니다.
zh_hk: 移至套裝軟體清單窗格 (例如，選取 <menuchoice>[<guimenu>編輯</guimenu>] [<guimenuitem>進入套裝軟體列表</guimenuitem>]</menuchoice>) 並開始輸入。系統就會依照您輸入的內容，識別出與套裝軟體清單窗格目前列出的套裝軟體相符的項目。

source: Use the Search field in the tool bar.
de: Verwenden Sie das Suchfeld in der Symbolleiste.
es: Utilice el campo Buscar que se encuentra en la barra de herramientas.
ja: ツールバーの「検索」フィールドを使用します。
ko: 도구 모음의 검색 필드를 사용합니다.
zh_hk: 使用工具列中的 [搜尋] 欄位。

source: Enter a Search String
de: Suchzeichenfolge eingeben
es: Introducir una cadena de búsqueda
ja: 検索文字列を入力します。
ko: 검색 문자열 입력
zh_hk: 輸入搜尋字串

source: Enter a string in the Search field and then press the Enter key or click the magnifying glass icon to the right of the Search field.
de: Geben Sie in das Suchfeld eine Zeichenfolge ein, und drücken Sie die Eingabetaste, oder klicken Sie auf das Lupensymbol rechts neben dem Suchfeld.
es: Introduzca una cadena en el campo Buscar y luego presione la tecla INTRO o haga clic en el icono de lupa que se encuentra a la derecha del campo Buscar.
ja: 「検索」フィールドに文字列を入力したあと、Enter キーを押すか、「検索」フィールドの右にある虫めがねアイコンをクリックします。
ko: 검색 필드에 문자열을 입력한 다음 Enter 키를 누르거나 검색 필드 오른쪽에 있는 돋보기 아이콘을 누릅니다.
zh_hk: 在 [搜尋] 欄位中輸入字串並按 Enter 鍵，或按一下 [搜尋] 欄位右側的放大鏡圖示。
