Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: A person, group, or corporation that designs, creates, and publishes a package to a package server. The package server in turn serves the packages from the (default) publisher, for downloading purposes.
de: Eine Person, Gruppe oder ein Unternehmen, das ein Paket auf einem Paketserver entwirft, erstellt und veröffentlicht. Der Paketserver dient wiederum als Server für Pakete vom (Standard-) Herausgeber (zum Herunterladen).
es: Una persona, un grupo o una corporación que designa, crea y publica un paquete en un servidor de paquetes. El servidor de paquetes, a su vez, pone a disposición los paquetes del editor (predeterminado) para su descarga.
ja: パッケージを設計、作成しパッケージサーバーに発行する個人、グループ、または企業。パッケージサーバーは、(デフォルトの) 発行元からのパッケージをダウンロード用に提供します。
ko: 패키지를 설계하고 만들며 패키지 서버에 게시하는 개인, 그룹 또는 회사입니다. 패키지 서버는 (기본) 게시자의 패키지를 다운로드용으로 제공합니다.
zh_hk: 設計、建立並將套裝軟體發佈至套裝軟體伺服器的人員、群組或公司。套裝軟體伺服器相對地會提供 (預設) 發佈者的套裝軟體供人下載。

source: system publisher
de: Systemherausgeber
es: editor del sistema
ja: システム発行元
ko: 시스템 게시자
zh_hk: 系統發佈者

source: System publishers are special publishers used in linked images and non-global zones in particular, to ensure that certain packages stay in sync with the global zone. The global zone constrains packages within the non-global zones by configuring these special system publishers in the non-global zone. They are special because the non-global zones cannot make certain changes to them including removing, disabling, modifying, or changing their priority.
de: Systemherausgeber sind bestimmte Herausgeber, die insbesondere in verknüpften Abbildern und nicht globalen Zonen verwendet werden, um zu gewährleisten, dass bestimmte Pakete der globalen Zone entsprechen. Die globale Zone schränkt Pakete in nicht globalen Zonen ein, indem eben diese Systemherausgeber in der nicht globalen Zone konfiguriert werden. Diese Herausgeber sind besonders, weil die nicht globalen Zonen keine Änderungen an diesen vornehmen können (z. B. Entfernen, Deaktivieren, Bearbeiten oder Ändern ihrer Priorität).
es: Los editores del sistema son editores especiales utilizados en imágenes enlazadas y zonas no globales en particular para garantizar que determinados paquetes están sincronizados con la zona global. La zona global limita los paquetes que se encuentran dentro de las zonas no globales mediante la configuración de estos editores del sistema especiales en la zona no global. Son especiales porque las zonas no globales no pueden realizarles determinados cambios, como eliminar, inhabilitar, modificar o cambiar su prioridad.
ja: システム発行元は、特定のパッケージを大域ゾーンと同期された状態に保つために、特にリンクされたイメージと非大域ゾーンで使用される特殊な発行元です。大域ゾーンは、これらの特殊なシステム発行元を非大域ゾーンに設定することで、非大域ゾーン内のパッケージを制約します。システム発行元が特殊である理由は、非大域ゾーンはそれらに対して削除、無効化、変更、優先度の変更といった特定の変更を行うことができないことにあります。
ko: 시스템 게시자는 특정 패키지가 전역 영역과 동기화된 상태로 유지되도록 하기 위해 링크된 이미지, 특히 비전역 영역에서 사용되는 특수한 게시자입니다. 전역 영역은 비전역 영역에서 특수한 시스템 게시자를 구성하여 비전역 영역에서 패키지를 제약합니다. 비전역 영역은 우선 순위 제거, 사용 안함으로 설정, 수정 또는 변경을 비롯하여 특정 변경 사항을 적용할 수 없으므로 시스템 게시자가 특수하게 사용됩니다.
zh_hk: 系統發佈者是專門用於連結影像和非全域區域的特殊發佈者，其目的在於確保特定套裝軟體與全域區域保持同步。全域區域會藉由在非全域區域配置這些特殊的系統發佈者，以限制非全域區域內的套裝軟體。他們的特殊點在於非全域區域無法對他們進行某些變更，包括移除、停用、修改或變更其優先權

source: Oracle Solaris Image Packaging System
ko: Oracle Solaris 이미지 패키징 시스템
zh_hk: Oracle Solaris 影像封裝系統

source: Package Manager
ca: Gestor de Paquets
cs: Správce balíčků
ja: パッケージマネージャー
ko: 패키지 관리자
ru: Диспетчер пакетов
zh_hk: 套裝軟體管理員

source: translator-credits
ca: crèdits-traductor
cs: překladatelské-kredity
es: créditos del traductor
ja: Sun Microsystems
ko: Oracle Corporation
ru: переводчик - сведения об авторах
zh_hk: Oralce Corporation

source: U.S.A.
es: EE. UU.

source: OpenSolaris 2010.03 Package Manager Online Help
ca: Ajuda en línia del gestor de paquets d'OpenSolaris 2010.03
cs: Online nápověda správce balíčků pro Opensolaris 2010.03
ru: Интерактивная справка по диспетчеру пакетов OpenSolaris 2010.03.

source: OpenSolaris
ru: ОС OpenSolaris

source: Publications
ca: Publicacions
cs: Publikace
ru: Публикации

source: June 2009
ca: Juny del 2009
cs: Červen 2009
ru: Июнь 2009 г.

source: About the Package Manager
ca: Quant al Gestor de Paquets
cs: O Správci balíčků
ru: О диспетчере пакетов

source: Welcome to the <trademark>OpenSolaris</trademark> 2010.03 Package Manager online help!
ca: Benvinguts a l'ajuda en línia del gestor de paquets d'<trademark>OpenSolaris</trademark> 2010.03!
cs: Vítejte v online nápovědě Správce balíčků pro <trademark>OpenSolaris</trademark> 2010.03!
ru: Добро пожаловать в интерактивную справку по диспетчеру пакетов <trademark>OpenSolaris</trademark>

source: Use the help contents to learn how to use the Package Manager. Navigate through this help by clicking the topics displayed in the sidebar.
ca: Utilitzeu els continguts de l'ajuda per aprendre com utilitzar el gestor de paquets. Navegue a través d'aquesta ajuda tot clicant als temes mostrats en la barra lateral.
cs: Využijte obsahu nápovědy pro zjištění, jak Správce balíčků používat. Nápovědou se můžete pohybovat klikáním na kategorie zobrazené na postranní liště.
ru: Начните обучение использованию диспетчера пакетов с содержания справки. Для перехода по разделам справки выберите соответствующую тему на боковой панели.

source: The OpenSolaris 2010.03 Package Manager application is a graphical user interface for the Image Packaging System (IPS) software. The Package Manager provides a subset of the functionality offered by the command-line (CLI) clients provided with IPS.
ca: L'aplicació del Gestor de Paquets d'OpenSolaris 2010.03 és una interfície gràfica d'usuari pel programari del sistema d'empaquetament d'imatges (IPS). El Gestor de Paquets proporciona un subconjunt de funcionalitats ofertes pels clients de línia de comandes (CLI) proporcionades amb IPS.
cs: Správce balíčků pro OpenSolaris 2010.03 je grafické uživatelské rozhraní softwaru Image Packaging System (IPS). Správce balíčků poskytuje podmnožinu funkcionalit nabízených klienty pro příkazovou řádku (CLI) poskytovaných z IPS.
ru: Диспетчер пакетов OpenSolaris 2010.03 представляет собой графический пользовательский интерфейс для программного обеспечения системы управления пакетами (IPS). В диспетчере пакетов реализовано подмножество функциональных возможностей, предоставляемых клиентами с интерфейсом командной строки, поставляемых вместе с системой IPS.

source: The Package Manager enables you to perform the following tasks:
ca: El Gestor de Paquets us permet realitzar les següents tasques:
cs: Správce balíčků Vám umožňuje provádět následující:
ru: Диспетчер пакетов дает возможность решать следующие задачи:

source: Install, remove, and search for packages
ca: Instal·lar, treure i cercar paquets
cs: Instalovat, odebírat či hledat balíčky.
ru: Установка, удаление и поиск пакетов

source: Update your system
ca: Actualitzar el vostre sistema
cs: Aktualizovat Váš systém
ru: Обновление системы

source: Add and manage publishers
ca: Afegir i gestiona publicadors
cs: Přidávat a spravovat vydavatele.
ru: Добавление издателей и управление ими

source: Create, remove, and manage boot environments
ca: Crear, eliminar, i gestionar entorns d'arranc
cs: Vytvářet, odstraňovat a spravovat bootovací prostředí
ru: Создание и удаление загрузочных сред, а также управление ими

source: See the <xref linkend="glossary"/> for a definition of the terms used in this document.
ca: Vegeu el <xref linkend="glosari"/> per a una definició dels temes utilitzats en aquest document.
cs: Viz <xref linkend="glossary"/>definice pojmů použitých v tomto dokumentu.
ru: В <xref linkend="glossary-"/> приведены определения терминов, используемых в данном документе.

source: About Image Packaging System
ca: Quant al Sistema Gestor de Paquets
cs: O balíčkovacím systému IPS
ru: О системе управления пакетами (IPS)

source: Image Packaging System (IPS) is a framework which provides for software lifecycle management including installation, upgrade, and removal. The OpenSolaris 2010.03 release uses IPS as its packaging system.
ru: Система управления пакетами (Image Packaging System; IPS) представляет собой платформу для управления жизненным циклом программного обеспечения, в том числе установки, обновления и удаления. В версии ОС OpenSolaris 2010.03 в качестве системы управления пакетами используется IPS.

source: After an initial installation of the OpenSolaris 2010.03 operating system, you will find that some of the software applications that you use on a regular basis are not immediately available to you. These software applications are available as packages in a repository for downloading and installing over the network. A repository is a source for packages.
ca: Després d'una instal·lació inicial del sistema operatiu OpenSolaris 2010.03, trobareu que falten algunes de les aplicacions que normalment utilitzeu, no estan disponibles immediatament. Aquestes aplicacions estan disponibles com a paquets en repositoris per a la seva descàrrega i intal·lació per mitjà de la xarxa. Un repositori és l'origen pels paquets.
cs: Po počáteční instalaci operačního systému OpenSolaris 2010.03 zjistíte, že některé běžně používané softwarové aplikace nejsou okamžitě k dispozici. Tyto softwarové aplikace jsou jako balíčky v repozitáři dostupné ke stažení a instalaci přes síť. Repozitář je zdroj balíčků.
ru: После первоначальной установки операционной системы OpenSolaris 2010.03 нередко выясняется, что многие часто используемые приложения не являются немедленно доступными. Такое прикладное ПО распространяется в виде пакетов в хранилище, доступных для загрузки и установки по сети. Хранилище представляет собой источник пакетов.

source: IPS provides a set of software tools that can be used to install packages from a repository, create and publish their own IPS packages, mirror an existing repository, and publish existing packages to a repository.
ru: В IPS входит ряд программных средств, которые можно использовать для установки пакетов из хранилища, создания и публикации собственных пакетов IPS, создания зеркала существующего хранилища, а также публикации существующих пакетов в хранилище.

source: Once you have installed packages, IPS enables you to search, update, and manage packages on your system.
ca: Una vegada hageu instal·lat els paquets, IPS us permet cercar, actualitzar, i gestionar els paquets al vostre sistema.
cs: Jakmile máte nainstalován balíček, IPS vám umožní hledat, aktualizovat a spravovat balíčky na Vašem systému.
ru: После установки пакетов система IPS позволяет выполнять в системе поиск, обновление пакетов иуправление ими.

source: With IPS , you can upgrade your system to a newer build of OpenSolaris, install and update your software to the latest available versions in a repository, and retrieve packages from mirror repositories.
ca: Amb IPS , podeu actualitzar el vostre sistema a una nova construcció d'OpenSolaris, instal·lar i actualitzar el vostre programari a la última versió disponible del repositori, i obtenir paquets des de la rèplica del repositori.
cs: Pomocí IPS systému můžete aktualizovat Váš systém na novější verzi OpenSolarisu, instalovat a aktualizovat Váš software na nejnovější verze v repozitáři a získávat balíčky ze zrcadleného repozitáře.
ru: Система IPS обеспечивает возможность обновления операционной системы до более свежей версии OpenSolaris, устанавливать программное обеспечение и обновлять его до самых свежих версий, доступных в хранилище,а также получать пакеты из зеркальных хранилищ.

source: The Package Manager provides a subset of the tasks that can be performed from the command-line.
ca: El Gestor de Paquets proporciona un conjunt de tasques que poden ser realitzades des de la línia de comandes.
cs: Správce balíčků poskytuje sadu úkolů, které mohou být provedeny z příkazové řádky.
ru: Диспетчер пакетов обеспечивает выполнение подмножества задач, которые могут выполнятьсяиз командной строки.

source: For the OpenSolaris 2010.03 release, if the system on which IPS is installed is on the network, IPS can automatically retrieve packages provided by the OpenSolaris publisher from the package repository located at <ulink url="http://pkg.opensolaris.org"/>.
ru: Если система версии OpenSolaris 2010.03, на которой установлена система управления пакетами, находится в сети, то пакеты, предоставляемые издателем OpenSolaris, могут автоматически поступать в систему IPS из хранилища по адресу <ulink url="http://pkg.opensolaris.org"/>.

source: For more IPS documentation, see the <ulink url="http://docs.sun.com/source/820-7679/index.html"><citetitle>Image Packaging System Guide</citetitle></ulink> and the <filename>pkg</filename><ulink url="http://opensolaris.org/sc/src/pkg/gate/src/man/">man pages</ulink>.
ca: Per a més documentació d'IPS, vegeu la <ulink url="http://docs.sun.com/source/820-7679/index.html"><citetitle>Guia del sistema d'empaquetament d'imatges</citetitle></ulink> i les <filename>pkg</filename><ulink url="http://opensolaris.org/sc/src/pkg/gate/src/man/">pàgines man</ulink>.
cs: Pro další dokumentaci k IPS navštivte <ulink url="http://docs.sun.com/source/820-7679/index.html"><citetitle>Průvodce správce balíčků</citetitle></ulink> a <ulink url="http://opensolaris.org/sc/src/pkg/gate/src/man/">manuálové stránky</ulink> <filename> pkg</filename>
ru: Для получения дополнительной информации о системе управления пакетами см. руководство <ulink url="http://docs.sun.com/source/820-7679/index.html"><citetitle>Image Packaging System Guide</citetitle></ulink> и <ulink url="http://opensolaris.org/sc/src/pkg/gate/src/man/">справочные страницы</ulink> <filename>pkg</filename>.

source: For more information about IPS, visit the <ulink url="http://opensolaris.org/os/project/pkg">project page</ulink>.
ca: Per a més informació quant a IPS, visiteu la <ulink url="http://opensolaris.org/os/project/pkg">pàgina del projecte</ulink>.
cs: Pro více informací o IPS navštivte <ulink url="http://opensolaris.org/os/project/pkg">stránku projektu</ulink>.
ru: Для получения дополнительной информации о системе управления пакетами посетите <ulink url="http://opensolaris.org/os/project/pkg">страницу проекта</ulink>

source: Getting Started With Package Manager
ca: Com començar amb el gestor de paquets
cs: Začínáme se Správcem balíčků.
ru: Начало работы с диспетчером пакетов

source: When you start the Package Manager, a Start Page similar to the example below is displayed:
ca: Quant inicieu el gestor de paquets, es mostra una pàgina d'inici semblant a la mostrada a continuació:
cs: Po spuštění Správce balíčků je zobrazena počáteční stránka podobná ukázce níže.
ru: При запуске диспетчера пакетов открывается начальная страница, показанная в приведенном ниже примере:

source: Package Manager Start Page
ca: Pàgina d'inici del gestor de paquets
cs: Počáteční stránka Správce balíčků
ru: Начальная страница диспетчера пакетов

source: The Start Page provides a list of featured packages that can be installed. It includes a list of some of the most popular and recent packages downloaded by the OpenSolaris community of users. The Recommended list of packages point to software applications that are frequently downloaded by the OpenSolaris user. Click the package links to install the packages.
ca: La pàgina d'inici proporciona un llistat dels paquets concrets que poden ser instal·lats. Això inclou un llistat d'alguns del paquets més populars i recents descarregats pels usuaris de la comunitat d'OpenSolaris. El llistat de paquets recomanats apunta a les aplicacions que són freqüentment descarregades pels usuaris d'OpenSolaris. Cliqueu als enllaços dels paquets per a instal·lar-los.
cs: Počáteční stránka poskytuje seznam dostupných balíčků, které mohou být nainstalovány. Zahrnuje seznam některých nejvíce populárních a nových balíčků stahovaných uživatelskou komunitou OpenSolaris. Seznam doporučených balíčků směřuje k softwarovým aplikacím často stahovaným uživateli OpenSolarisu. Po kliknutí na balíček bude balíček nainstalován.
ru: На начальной странице выводится список ключевых пакетов, доступных для установки. Среди прочего можно ознакомиться со списком наиболее популярных и недавно добавленных пакетов, загружаемых сообществом пользователей ОС OpenSolaris. Список рекомендованных пакетов содержит ссылки на прикладное программное обеспечение, часто загружаемое пользователем OpenSolaris. Для установки пакетов щелкните соответствующие ссылки.

source: The Start Page also provides links to more information about the OpenSolaris project, subscribe to newsletters and join the OpenSolaris community.
ca: La pàgina d'inici també proporciona enllaços a més informació quant al projecte OpenSolaris, subscripció a butlletins i la unió a la comunitat d'OpenSolaris.
cs: Počáteční stránka také poskytuje odkazy na další informace o projektu OpenSolaris, můžete si nechat zasílat buletin a připojit se ke komunitě OpenSolaris.
ru: На начальной странице приводятся также ссылки на дополнительные сведения о проекте OpenSolaris; также предоставляется возможность подписаться на новостные рассылки и вступить в сообщество OpenSolaris.

source: To close the Start Page and see the list of packages in the selected publisher, perform any of the following actions in the main window of the Package Manager:
ca: Per tancar la pàgina d'inici i visualitzar el llistat de paquets en el publicador seleccionat, realitzeu qualsevol de les següents accions en la finestra principal del gestor de paquets:
cs: Pro zavření počáteční stránky a zobrazení seznamu balíčků zvoleného vydavatele proveďte jakoukoli z následujících akcí v hlavním okně Správce balíčků.
ru: Для закрытия начальной страницы и перехода к списку пакетов от выбранного издателя можно выполнить одно из следующих действий в главном окне диспетчера пакетов:

source: Select a package category
ca: Seleccioneu una categoria de paquets
cs: Vyberte kategorii balíčku
ru: Выберите категорию пакетов

source: Change the <emphasis role="strong">View</emphasis> drop-down menu
ca: Canviar el menú desplegable de la <emphasis role="strong">Vista</emphasis>
cs: Změňte rozbalovací nabídku <emphasis role="strong">Náhled</emphasis>
ru: Изменить раскрывающееся меню <emphasis role="strong">Вид</emphasis>.

source: Perform a search
ca: Realitzar una cerca
cs: Proveďte hledání
ru: Выполните поиск

source: Change the publisher
ca: Canviar el publicador
cs: Změňte vydavatele
ru: Изменить издателя.

source: Select <menuchoice><guimenu>View</guimenu><guimenuitem>Start Page</guimenuitem></menuchoice> to return to the Start Page at anytime.
ca: Seleccioneu <menuchoice><guimenu>Visualitzar</guimenu><guimenuitem>Pàgina d'inici</guimenuitem></menuchoice> per a tornar a la pàgina d'inici en qualsevol moment.
cs: Vyberte <menuchoice><guimenu>Náhled</guimenu><guimenuitem>Úvodní stránka</guimenuitem></menuchoice> pro návrat na Úvodní stránku.
ru: На начальную страницу всегда можно вернуться путем выбора пункта меню <menuchoice><guimenu>Просмотр</guimenu><guimenuitem>Начальная страница</guimenuitem></menuchoice>.

source: See <xref linkend="edit-prefs"/> to turn off the <emphasis role="strong">initial display</emphasis> of the start page when the Package Manager starts.
ca: Vegeu <xref linkend="edit-prefs"/> per a activar l'<emphasis role="strong">aparença inicial</emphasis> de la pàgina d'inici quant el gestor de paquets es carrega.
cs: Viz také <xref linkend="edit-prefs"/> vypnutí <emphasis role="strong"> úvodní stránky</emphasis> při spuštění Správce balíčků.
ru: См. <xref linkend="edit-prefs"/> для получения информации об отключении <emphasis role="strong">первоначального отображения</emphasis> начальной страницы при запуске диспетчера пакетов.

source: About The Package Manager Window
ca: Quant a la Finestra del gestor de paquets
cs: O okně Správce balíčků
ru: Об окне диспетчера пакетов

source: Package Manager Main View
ca: Finestra principal del gestor de paquets
cs: Hlavní zobrazení Správce balíčků
ru: Главное представление диспетчера пакетов

source: The main window of the Package Manager consists of the following elements :
ca: La finestra principal del Gestor de paquets consisteix amb els següents elements :
cs: Hlavní okno Správce balíčků se zkládá z následujících částí:
ru: Главное окно диспетчера пакетов состоит из следующих элементов:

source: Menubar
ca: Barra de menú
cs: Hlavní nabídka
ru: Строка меню

source: The menubar contains the menus and sub-menus required to perform all of the commands related to the Package Manager.
ca: La barra de menú conté els menús i submenús necessaris per realitzar totes les comandes relacionades amb el Gestor de paquets.
cs: Hlavní nabídka obsahuje menu a podmenu potřebná k provádění všech příkazů souvisejících se Správcem balíčků.
ru: В строке меню содержатся меню и подменю, требуемые для выполнения всех команд, связанных с диспетчером пакетов.

source: Toolbar
ca: Barra d'eines
cs: Panel nástrojů
ru: Панель инструментов

source: The toolbar contains the icons for a subset of the commands that can be performed by using the menus on the menubar. A <emphasis role="strong">Search</emphasis> field is also located on the toolbar. You can perform the following actions from the toolbar :
ca: La barra de menú conte les icones per al subconjunt de comandes que poden ser realitzades amb la utilització dels menús en la barra de menú. També hi ha situat un camp de <emphasis role="strong">Cerca</emphasis> en la barra de menú. Podeu realitzar les següents accions des de la barra de menú :
cs: Panel nástrojů obsahuje ikony pro podskupiny příkazů, které mohou být provedeny užitím hlavní nabídky. V panelu nástrojů se také nachází políčko <emphasis role="strong">Hledat</emphasis>. Je možno provést následující akce:
ru: На панели инструментов расположены значки для подмножества команд, выполняемых с помощью строки меню. Также на панели инструментов расположено поле <emphasis role="strong">Поиск</emphasis>. Панель инструментов предоставляет возможность вызова следующих функций:

source: <emphasis role="strong">Updates</emphasis> – Click <emphasis role="strong">Updates</emphasis> to check for and install the latest updates.
ca: <emphasis role="strong">Actualitzacions</emphasis> – Cliqueu a <emphasis role="strong">Actualitzacions</emphasis> per a comprovar i actualitzar els últims paquets.
cs: <emphasis role="strong">Aktualizovat</emphasis> - Klikněte na <emphasis role="strong">Aktualizovat</emphasis> pro zjištění a instalaci posledních aktualizací.
ru: <emphasis role="strong">Обновления</emphasis> – нажмите кнопку <emphasis role="strong">Обновления</emphasis> для проверки и установки последних обновлений.

source: <emphasis role="strong">Install/Update</emphasis> – Select a package and click <emphasis role="strong">Install/Update</emphasis> to install or update a package.
ca: <emphasis role="strong">Instal·lar/Actualitzar</emphasis> – Seleccioneu un paquet i cliqueu a <emphasis role="strong">Instal·lar/Actualitzar</emphasis> per a instal·lar o actualitzar un paquet.
cs: <emphasis role="strong">Instalovat/Aktualizovat</emphasis> - Zvolte balíček a klikněte na <emphasis role="strong">Instalovat/Aktualizovat</emphasis> pro instalaci nebo aktualizaci balíčku.
ru: <emphasis role="strong">Установка/обновление</emphasis> – для установки или обновления пакета выберите его и нажмите кнопку <emphasis role="strong">Установка/обновление</emphasis>.

source: <emphasis role="strong">Refresh</emphasis> – Click <emphasis role="strong">Refresh</emphasis> to reload the list of packages.
ca: <emphasis role="strong">Refrescar</emphasis> – Cliqueu a <emphasis role="strong">Refrescar</emphasis> per a recarregar el llistat de paquets.
cs: <emphasis role="strong">Obnovit</emphasis> - Klikněte na <emphasis role="strong">Obnovit</emphasis> k obnovení seznamu balíčků.
ru: <emphasis role="strong">Обновление</emphasis> – для повторной загрузки списка пакетов нажмите кнопку <emphasis role="strong">Обновить</emphasis>.
