Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: Select the Certificates tab to manage certificates for this publisher.
de: Wählen Sie die Registerkarte "Zertifikate", um die Zertifikate dieses Herausgebers zu verwalten.
es: Seleccione la ficha Certificados para gestionar los certificados de este editor.
ja: この発行元の証明書を管理するには、「証明書」タブを選択します。
ko: 인증서 탭을 선택하여 이 게시자에 대한 인증서를 관리합니다.
zh_hk: 選取 [憑證] 標籤以管理此發佈者的憑證。

source: Select the Signature Policy tab to manage signature policy for this publisher.
de: Wählen Sie die Registerkarte "Signaturrichtlinie", um die Signaturrichtlinie dieses Herausgebers zu verwalten.
es: Seleccione la ficha Política de firmas para gestionar la política de firmas de este editor.
ja: この発行元の署名ポリシーを管理するには、「署名ポリシー」タブを選択します。
ko: 서명 정책 탭을 선택하여 이 게시자에 대한 서명 정책을 관리합니다.
zh_hk: 選取 [簽名策略] 標籤以管理此發佈者的簽名策略。

source: Adding SSL Keys and Certificates
de: Hinzufügen der SSL-Schlüssel und -Zertifikate
es: Adición de claves y certificados SSL
ja: SSL キーと証明書の追加
ko: SSL 키 및 인증서 추가
zh_hk: 增加 SSL 金鑰和憑證

source: If a publisher has a secure origin, add the SSL key and SSL certificate for the publisher.
de: Wenn der Herausgeber einen sicheren Ursprung hat, fügen Sie den SSL-Schlüssel und das SSL-Zertifikat für diesen Herausgeber hinzu.
es: Si un editor tiene un origen seguro, agregue la clave y el certificado SSL para el editor.
ja: 発行元にセキュリティー保護された起点がある場合は、発行元の SSL キーと SSL 証明書を追加します。
ko: 게시자가 보안 원본을 가진 경우 게시자에 대한 SSL 키 및 SSL 인증서를 추가합니다.
zh_hk: 如果發佈者有安全的原始，請增加該發佈者的 SSL 金鑰和 SSL 憑證。

source: Click the General tab of the Modify Publisher window.
de: Klicken Sie im Fenster "Herausgeber ändern" auf die Registerkarte "Allgemein".
es: Haga clic en la ficha General de la ventana Modificar editor.
ja: 「発行元の変更」ウィンドウの「一般」タブをクリックします。
ko: 게시자 수정 창의 일반 탭을 누릅니다.
zh_hk: 按一下 [修改發佈者] 視窗中的 [一般] 標籤。

source: Click the SSL Key and Certificate label to display the SSL Key field and the SSL Certificate field.
de: Klicken Sie auf die Beschriftung "SSL-Schlüssel und -Zertifikat", um die Felder "SSL-Schlüssel" und "SSL-Zertifikat" anzuzeigen.
es: Haga clic en la etiqueta Certificado y clave SSL para visualizar el campo Clave SSL y el campo Certificado SSL.
ja: 「SSL キーと証明書」ラベルをクリックして、「SSL キー」フィールドと「SSL 証明書」フィールドを表示します。
ko: SSL 키 및 인증서 레이블을 눌러 SSL 키 필드 및 SSL 인증서 필드를 표시합니다.
zh_hk: 按一下 [SSL 金鑰和憑證] 標籤，顯示 [SSL 金鑰] 欄位和 [SSL 憑證] 欄位。

source: Click the <guibutton>Browse</guibutton> button to the right of the SSL Key field to select the SSL Key file.
de: Klicken Sie rechts neben dem Feld "SSL-Schlüssel" auf die Schaltfläche <guibutton>Durchsuchen</guibutton>, um die SSL-Schlüsseldatei auszuwählen.
es: Haga clic en el botón <guibutton>Buscar</guibutton> que se encuentra a la derecha del campo Clave SSL para seleccionar el archivo Clave SSL.
ja: 「SSL キー」フィールドの右にある<guibutton>「参照」</guibutton>ボタンをクリックし、SSL キーファイルを選択します。
ko: SSL 키 필드 오른쪽에 있는 <guibutton>찾아보기</guibutton> 버튼을 눌러 SSL 키 파일을 선택합니다.
zh_hk: 按一下 [SSL 金鑰] 欄位右方的 [<guibutton>瀏覽</guibutton>] 按鈕，選取 SSL 金鑰檔案。

source: Click the <guibutton>Browse</guibutton> button to the right of the SSL Certificate field to select the SSL Certificate file.
de: Klicken Sie rechts neben dem Feld "SSL-Zertifikat" auf die Schaltfläche <guibutton>Durchsuchen</guibutton>, um die SSL-Zertifikatsdatei auszuwählen.
es: Haga clic en el botón <guibutton>Buscar</guibutton> que se encuentra a la derecha del campo Certificado SSL para seleccionar el archivo de certificado SSL.
ja: 「SSL 証明書」フィールドの右にある<guibutton>「参照」</guibutton>ボタンをクリックし、SSL 証明書ファイルを選択します。
ko: SSL 인증서 필드 오른쪽에 있는 <guibutton>찾아보기</guibutton> 버튼을 눌러 SSL 인증서 파일을 선택합니다.
zh_hk: 按一下 [SSL 憑證] 欄位右方的 [<guibutton>瀏覽</guibutton>] 按鈕，選取 SSL 憑證檔案。

source: Managing Certificates
de: Verwalten von Zertifikaten
es: Gestión de certificados
ja: 証明書の管理
ko: 인증서 관리
zh_hk: 管理憑證

source: Click the Certificates tab of the Modify Publisher window.
de: Klicken Sie im Fenster "Herausgeber ändern" auf die Registerkarte "Zertifikate".
es: Haga clic en la ficha Certificados de la ventana Modificar editor.
ja: 「発行元の変更」ウィンドウの「証明書」タブをクリックします。
ko: 게시자 수정 창의 인증서 탭을 누릅니다.
zh_hk: 按一下 [修改發佈者] 視窗中的 [憑證] 標籤。

source: Use the buttons below the list of certificates to add a certificate or to remove, revoke, or reinstate the certificate that is currently selected in the list.
de: Verwenden Sie die Schaltfläche unter der Liste der Zertifikate, um ein Zertifikat hinzuzufügen oder um ein in der Liste ausgewähltes Zertifikat zu entfernen, zu widerrufen oder wiederherzustellen.
es: Utilice los botones debajo de la lista de certificados para agregar un certificado o eliminar, revocar o restablecer el certificado que actualmente está seleccionado en la lista.
ja: 証明書リストの下にあるボタンを使用して、証明書の追加、またはリストで現在選択されている証明書の削除、失効、回復を行います。
ko: 인증서 목록 아래의 버튼을 사용하여 인증서를 추가하거나 현재 목록에서 선택된 인증서를 제거, 해지 또는 복구합니다.
zh_hk: 使用憑證清單下的按鈕來增加憑證，或者是移除、撤銷或復原目前清單中所選取的憑證。

source: Note that any actions you take in the Modify Publisher window are applied to the selected publisher's certificates only after you click the <guibutton>OK</guibutton> button at the bottom of the Modify Publisher window. If you click the <guibutton>Cancel</guibutton> button, no changes are applied.
de: Beachten Sie, dass alle Aktionen, die Sie im Fenster "Herausgeber ändern" ausführen, erst dann auf die Zertifikate des ausgewählten Herausgebers angewendet werden, wenn Sie auf die Schaltfläche <guibutton>OK</guibutton> klicken, die sich im unteren Bereich des Fensters "Herausgeber ändern" befindet. Wenn Sie auf die Schaltfläche <guibutton>Abbrechen</guibutton> klicken, werden keine Änderungen angewendet.
es: Tenga en cuenta que las acciones realizadas en la ventana Modificar editor se aplican a los certificados del editor seleccionado después de hacer clic en el botón <guibutton>Aceptar</guibutton> que se encuentra en la parte inferior de la ventana Modificar editor. Si hace clic en el botón <guibutton>Cancelar</guibutton>, no se aplica ningún cambio.
ja: 「発行元の変更」ウィンドウで行う操作はすべて、「発行元の変更」ウィンドウ下部の<guibutton>「了解」</guibutton>ボタンをクリックしたあとにはじめて、選択した発行元の証明書に適用されます。<guibutton>「取消し」</guibutton>ボタンをクリックした場合、変更は適用されません。
ko: 게시자 수정 창에서 수행하는 작업은 게시자 수정 창 아래쪽에 있는 <guibutton>확인</guibutton> 버튼을 누른 후에만 선택된 게시자의 인증서에 적용됩니다. <guibutton>취소</guibutton> 버튼을 누르면 변경 사항이 적용되지 않습니다.
zh_hk: 請注意，您在 [修改發佈者] 視窗中所做的動作只有在您按一下 [修改發佈者] 視窗底部的 [<guibutton>確定</guibutton>] 按鈕後，才會套用至所選發佈者的憑證。如果按一下 [<guibutton>取消</guibutton>] 按鈕，則不會套用變更。

source: <guibutton>Add</guibutton>. Add a new publisher certificate for the publisher listed in the Modify Publisher window title. In the Add Publisher Certificate window, browse to select the certificate (<tt>.pem</tt>) file. Click the <guibutton>OK</guibutton> button at the bottom of the Add Publisher Certificate window. The newly added certificate is selected in the certificates list in the Certificates tab of the Modify Publisher window. The details pane indicates that this certificate is "marked to be added." This certificate will be added after you click the <guibutton>OK</guibutton> button on the Modify Publisher window.
de: <guibutton>Hinzufügen</guibutton>: Fügen Sie ein neues Herausgeberzertifikat für den Herausgeber hinzu, der im Titel des Fensters "Herausgeber ändern" aufgeführt ist. Suchen Sie im Fenster "Herausgeberzertifikat hinzufügen" die Zertifikatsdatei (<tt>.pem</tt>), um diese auszuwählen. Klicken Sie im unteren Bereich des Fensters "Herausgeberzertifikat hinzufügen" auf die Schaltfläche <guibutton>OK</guibutton>. Das neu hinzugefügte Zertifikat wird in der Zertifikatsliste der Registerkarte "Zertifikate" des Fensters "Herausgeber ändern" ausgewählt. Im Detailsbereich wird angezeigt, dass dieses Zertifikat zum Hinzufügen markiert ist. Dieses Zertifikat wird hinzugefügt, sobald Sie im Fenster "Herausgeber ändern" auf die Schaltfläche <guibutton>OK</guibutton> klicken.
es: <guibutton>Agregar</guibutton>. Agregue un certificado de editor nuevo para el editor mostrado en el título de la ventana Modificar editor. En la ventana Agregar certificado de editor, busque el archivo de certificado (<tt>.pem</tt>) para seleccionarlo. Haga clic en el botón <guibutton>Aceptar</guibutton> que se encuentra en la parte inferior de la ventana Agregar certificado de editor. El certificado recién agregado se selecciona en la lista de certificados que aparece en la ficha Certificados de la ventana Modificar editor. El panel de detalles indica que este certificado está "marcado para ser agregado". Este certificado se agregará después de hacer clic en el botón <guibutton>Aceptar</guibutton> que aparece en la ventana Modificar editor.
ja: <guibutton>「追加」</guibutton>。「発行元の変更」ウィンドウのタイトルに表示された発行元の新しい発行元証明書を追加します。「発行元証明書の追加」ウィンドウで、証明書 (<tt>.pem</tt>) ファイルを参照して選択します。「発行元証明書の追加」ウィンドウ下部の<guibutton>「了解」</guibutton>ボタンをクリックします。「発行元の変更」ウィンドウの「証明書」タブの証明書リストでは、新しく追加された証明書が選択されます。詳細区画には、この証明書が「追加対象として指定されている」ことが示されます。この証明書は、「発行元の変更」ウィンドウの<guibutton>「了解」</guibutton>ボタンをクリックしたあとで追加されます。
ko: <guibutton>추가</guibutton>. 게시자 수정 창 제목에 나열되는 게시자에 대한 새 게시자 인증서를 추가합니다. 게시자 인증서 추가 창에서 인증서(<tt>.pem</tt>) 파일을 찾아 선택합니다. 게시자 인증서 추가 창 아래쪽에 있는 <guibutton>확인</guibutton> 버튼을 누릅니다. 그러면 새로 추가된 인증서가 게시자 수정 창의 인증서 탭에 있는 인증서 목록에서 선택됩니다. 세부 정보 창에 이 인증서가 "추가 대상으로 표시"된 것으로 나타납니다. 게시자 수정 창에서 <guibutton>확인</guibutton> 버튼을 누르면 이 인증서가 추가됩니다.
zh_hk: <guibutton>增加</guibutton>。針對 [修改發佈者] 視窗標題中所列出的發佈者，增加一個新的發佈者憑證。在 [增加發佈者憑證] 視窗中，瀏覽並選取憑證 (<tt>.pem</tt>) 檔案。按一下 [增加發佈者憑證] 視窗底部的 [<guibutton>確定</guibutton>] 按鈕。新增加的憑證會在 [修改發佈者] 視窗 [憑證] 標籤的憑證清單中呈現選取狀態。詳細資訊窗格會指出此憑證 [標示為要新增]。此憑證將在您按一下 [修改發佈者] 視窗的 [<guibutton>確定</guibutton>] 按鈕後新增。

source: In the list of certificates for this publisher, select the certificate you want to modify or whose details you want to check. Details about the selected certificate are shown below the list of certificates and row of buttons. Note that an expired certificate can still be Approved and used to validate signed packages that were published (not necessarily installed) before the certificate expired.
de: Wählen Sie in der Liste der Zertifikate für diesen Herausgeber das Zertifikat aus, das Sie ändern möchten oder dessen Details Sie überprüfen möchten. Details zum ausgewählten Zertifikat werden unterhalb der Liste der Zertifikate und der Schaltflächenreihe angezeigt. Beachten Sie, dass ein abgelaufenes Zertifikat weiterhin "Genehmigt" und verwendet werden kann, um signierte Pakete zu überprüfen, die vor dem Ablauf des Zertifikats veröffentlicht (ggf. auch installiert) wurden.
es: En la lista de certificados para este editor, seleccione el certificado que desea modificar o cuyos detalles desea revisar. Los detalles sobre el certificado seleccionado se muestran debajo de la lista de certificados y de la fila de botones. Tenga en cuenta que incluso un certificado caducado puede estar aprobado y se puede utilizar para validar paquetes firmados que fueron publicados (y no necesariamente instalados) antes de que caduque el certificado.
ja: この発行元の証明書リストで、変更する証明書または詳細を確認する証明書を選択します。証明書リストと一連のボタンの下に、選択した証明書の詳細が表示されます。有効期限が切れた証明書が、まだ「承認済み」のままで、証明書の有効期限が切れる前に発行された (インストールされている必要はない) 署名付きパッケージの検証に使用されている場合があります。
ko: 이 게시자에 대한 인증서 목록에서 수정할 인증서 또는 세부 정보를 확인할 인증서를 선택합니다. 선택된 인증서에 대한 세부 정보가 인증서 목록 및 버튼 행 아래에 표시됩니다. 만료된 인증서가 계속 승인됨 상태일 수 있으며 인증서 만료 전 게시되었던(설치되지 않아도 됨) 서명된 패키지를 검증하는 데 사용될 수 있습니다.
zh_hk: 在此發佈者的憑證清單中，選取您要修改或要檢查其詳細資訊的憑證。所選憑證的詳細資訊會顯示在憑證清單和按鈕列下方。請注意，過期的憑證仍可以是 [已核准] 狀態，可用來驗證憑證過期前所發佈 (不一定要安裝) 的含簽名套裝軟體。

source: Click the headings of the list of certificates to resort the list. The Organization and Name columns are resizable.
de: Klicken Sie auf die Überschriften der Liste mit Zertifikaten, um die Liste wiederherzustellen. Die Größe der Spalten "Organisation" und "Name" kann geändert werden.
es: Haga clic en los encabezados de la lista de certificados para recurrir a la lista. El tamaño de las columnas Organización y Nombre se puede ajustar.
ja: 証明書リストを再ソートするには、リストの見出しをクリックします。「組織」列と「名前」列のサイズは変更可能です。
ko: 인증서 목록 제목을 눌러 목록을 다시 정렬합니다. 조직 및 이름 열의 크기를 조정할 수 있습니다.
zh_hk: 按一下憑證清單的標題來重新排序清單。您可以調整 [組織] 和 [名稱] 資料欄的大小。

source: <guibutton>Remove</guibutton>. Remove the certificate that is currently selected in the certificates list.
de: <guibutton>Entfernen</guibutton>: Entfernen Sie das Zertifikat, das zurzeit in der Zertifikatsliste ausgewählt ist.
es: <guibutton>Eliminar</guibutton>. Elimine el certificado que está actualmente seleccionado en la lista de certificados.
ja: <guibutton>「削除」</guibutton>。証明書リストで現在選択されている証明書を削除します。
ko: <guibutton>제거</guibutton>. 현재 인증서 목록에서 선택된 인증서를 제거합니다.
zh_hk: <guibutton>移除</guibutton>。移除目前在憑證清單中選取的憑證。

source: <guibutton>Revoke</guibutton>. If the certificate currently selected in the certificates list is Approved, click the <guibutton>Revoke</guibutton> button to treat this certificate as revoked. In the certificates list, the Status of this certificate changes to Revoked. This change is applied to the certificate after you click the <guibutton>OK</guibutton> button on the Modify Publisher window.
de: <guibutton>Widerrufen</guibutton>: Wenn das aktuell in der Zertifikatsliste ausgewählte Zertifikat genehmigt ist, klicken Sie auf die Schaltfläche <guibutton>Widerrufen</guibutton>, um das Zertifikat als widerrufen einzustufen. In der Zertifikatsliste ändert sich der Status dieses Zertifikats in "Widerrufen". Diese Änderung wird auf das Zertifikat angewendet, sobald Sie im unteren Bereich des Fensters "Herausgeber ändern" auf die Schaltfläche <guibutton>OK</guibutton> klicken.
es: <guibutton>Revocar</guibutton>. Si el certificado actualmente seleccionado en la lista de certificados está Aprobado, haga clic en el botón <guibutton>Revocar</guibutton> para tratar a este certificado como si estuviera revocado. En la lista de certificados, el Estado de este certificado cambiará a Revocado. Este cambio se aplicará al certificado después de hacer clic en el botón <guibutton>Aceptar</guibutton> que aparece en la ventana Modificar editor.
ja: <guibutton>「失効」</guibutton>。証明書リストで現在選択されている証明書が「承認済み」の場合、<guibutton>「失効」</guibutton>ボタンをクリックすると、この証明書は失効した証明書として扱われます。証明書リストでは、この証明書の「状態」が「失効済み」に変わります。この変更は、「発行元の変更」ウィンドウの<guibutton>「了解」</guibutton>ボタンをクリックしたあとで証明書に適用されます。
ko: <guibutton>해지</guibutton>. 현재 인증서 목록에서 선택된 인증서가 승인됨이면 <guibutton>해지</guibutton> 버튼을 눌러 이 인증서를 해지됨 상태로 처리합니다. 인증서 목록에서 이 인증서의 상태가 해지됨으로 변경됩니다. 게시자 수정 창에서 <guibutton>확인</guibutton> 버튼을 누르면 이 변경 사항이 인증서에 적용됩니다.
zh_hk: <guibutton>撤銷</guibutton>。如果目前在憑證清單中選取的憑證為 [已核准]，請按一下 [<guibutton>撤銷</guibutton>] 按鈕，將此憑證視為撤銷的憑證。在憑證清單中，此憑證的狀態會變更為 [已撤銷]。按一下 [修改發佈者] 視窗的 [<guibutton>確定</guibutton>] 按鈕後，便會將此變更套用至該憑證。

source: <guibutton>Reinstate</guibutton>. If the certificate currently selected in the certificates list is Revoked, click the <guibutton>Reinstate</guibutton> button to treat this certificate as approved. The details pane indicates that this certificate is "marked to be reinstated." This certificate will be reinstated after you click the <guibutton>OK</guibutton> button on the Modify Publisher window.
de: <guibutton>Wiederherstellen</guibutton>: Wenn das aktuell in der Zertifikatsliste ausgewählte Zertifikat widerrufen ist, klicken Sie auf die Schaltfläche <guibutton>Wiederherstellen</guibutton>, um dieses Zertifikat als genehmigt einzustufen. Im Detailsbereich wird angezeigt, dass dieses Zertifikat zum Wiederherstellen markiert ist. Dieses Zertifikat wird wiederhergestellt, sobald Sie im Fenster 'Herausgeber ändern' auf die Schaltfläche <guibutton>OK</guibutton> klicken.
es: <guibutton>Restablecer</guibutton>. Si el certificado actualmente seleccionado en la lista de certificados está Revocado, haga clic en el botón <guibutton>Restablecer</guibutton> para tratar a este certificado como si estuviera aprobado. El panel de detalles indica que este certificado está "marcado para ser restablecido". Este certificado se restablecerá después de hacer clic en el botón <guibutton>Aceptar</guibutton> que aparece en la ventana Modificar editor.
ja: <guibutton>「回復」</guibutton>。証明書リストで現在選択されている証明書が「失効済み」の場合、<guibutton>「回復」</guibutton>ボタンをクリックすると、この証明書は承認された証明書として扱われます。詳細区画には、この証明書が「回復対象として指定されている」ことが示されます。この証明書は、「発行元の変更」ウィンドウの<guibutton>「了解」</guibutton>ボタンをクリックしたあとで回復されます。
ko: <guibutton>복구</guibutton>. 현재 인증서 목록에서 선택된 인증서가 해지됨이면 <guibutton>복구</guibutton> 버튼을 눌러 이 인증서를 승인됨 상태로 처리합니다. 세부 정보 창에 이 인증서가 "복구 대상으로 표시"된 것으로 나타납니다. 게시자 수정 창에서 <guibutton>확인</guibutton> 버튼을 누르면 이 인증서가 복구됩니다.
zh_hk: <guibutton>復原</guibutton>。如果目前在憑證清單中選取的憑證為 [已撤銷]，請按一下 [<guibutton>復原</guibutton>] 按鈕，將此憑證視為核准的憑證。詳細資訊窗格會指出此憑證 [標示為要復原]。按一下 [修改發佈者] 視窗的 [<guibutton>確定</guibutton>] 按鈕後，便會復原此憑證。

source: Managing Signature Policy
de: Verwalten der Signaturrichtlinie
es: Gestión de la política de firmas
ja: 署名ポリシーの管理
ko: 서명 정책 관리
zh_hk: 管理簽名策略

source: Click the Signature Policy tab of the Modify Publisher window.
de: Klicken Sie im Fenster "Herausgeber ändern" auf die Registerkarte "Signaturrichtlinie".
es: Haga clic en la ficha Política de firmas de la ventana Modificar editor.
ja: 「発行元の変更」ウィンドウの「署名ポリシー」タブをクリックします。
ko: 게시자 수정 창의 서명 정책 탭을 누릅니다.
zh_hk: 按一下 [修改發佈者] 視窗中的 [簽名策略] 標籤。

source: Use the buttons on the Signature Policy tab to set the signature policy to use when installing packages from the publisher listed in the Modify Publisher window title.
de: Verwenden Sie die Schaltflächen auf der Registerkarte "Signaturrichtlinie", um die Signaturrichtlinie festzulegen, die beim Installieren von Paketen verwendet werden soll, die vom Herausgeber stammen, der im Titel des Fensters "Herausgeber ändern" aufgeführt ist.
es: Utilice los botones de la ficha Política de firmas para configurar la política de firmas a fin de utilizarla al instalar los paquetes del editor mostrado en el título de la ventana Modificar editor.
ja: 「署名ポリシー」タブのボタンを使用して、「発行元の変更」ウィンドウのタイトルに表示された発行元からパッケージをインストールするときに使用する署名ポリシーを設定します。
ko: 서명 정책 탭의 버튼을 사용하여 게시자 수정 창 제목에 나열되는 게시자의 패키지를 설치할 때 사용할 서명 정책을 설정합니다.
zh_hk: 安裝 [修改發佈者] 視窗標題中列出之發佈者的套裝軟體時，請使用 [簽名策略] 標籤中的按鈕來設定要使用的簽名策略。

source: To set the global signature policy, use the Signature Policy tab of the Preferences window (see <xref linkend="img-sig-policy"/>).
de: Öffnen Sie zum Festlegen der globalen Signaturrichtlinie die Registerkarte "Signaturrichtlinie" des Fensters "Einstellungen" (siehe <xref linkend="img-sig-policy"/>).
es: Si desea configurar la política de firmas global, utilice la ficha Política de firmas de la ventana Preferencias (consulte <xref linkend="img-sig-policy"/>).
ja: グローバルな署名ポリシーを設定するには、「設定」ウィンドウの「署名ポリシー」タブを使用します (<xref linkend="img-sig-policy"/>を参照)。
ko: 전역 서명 정책을 설정하려면 기본 설정 창의 서명 정책 탭을 사용합니다(<xref linkend="img-sig-policy"/> 참조).
zh_hk: 若要設定全域簽名策略，請使用 [喜好設定] 視窗中的 [簽名策略] 標籤 (請參閱 <xref linkend="img-sig-policy"/>)。

source: Signatures are ignored: Ignore signatures for all packages.
de: Signaturen werden ignoriert: Signaturen werden für alle Pakete ignoriert.
es: Las firmas se ignoran: ignore las firmas para todos los paquetes.
ja: 「署名を無視する」: すべてのパッケージの署名を無視します。
ko: 서명이 무시됨: 모든 패키지에 대한 서명을 무시합니다.
zh_hk: 忽略簽名：忽略所有套裝軟體的簽名。

source: Signatures are optional, but must be valid if provided: Verify that all packages with signatures are validly signed, but do not require all installed packages to be signed.
de: Signaturen sind optional, müssen jedoch bei Angabe gültig sein: Überprüfen Sie, ob alle Pakete mit Signaturen eine gültige Signatur haben. Installierte Pakete müssen jedoch nicht signiert sein.
es: Las firmas son opcionales, pero deben ser válidas si se las proporciona: Verifique que todos los paquetes con firmas estén firmados de manera válida, pero no solicite que se firmen todos los paquetes instalados.
ja: 「署名は任意であるが、指定する場合は有効である必要がある」: すべての署名付きパッケージが有効であることを確認しますが、インストールされるすべてのパッケージが署名されている必要はありません。
ko: 서명이 선택 사항이지만 제공할 경우 유효해야 함: 서명이 있는 모든 패키지가 유효하게 서명되었는지 확인하되 설치된 모든 패키지를 서명할 필요는 없습니다.
zh_hk: 簽名是選擇性的，但如果提供，必須有效：請確認含簽名的所有套裝軟體皆使用有效簽名，但並不要求所有已安裝的套裝軟體都必須含簽名。

source: One or more valid signatures are required: Require that all newly installed packages have at least one valid signature.
de: Eine oder mehrere gültige Signaturen erforderlich: Alle neu installierten Pakete müssen mindestens eine gültige Signatur haben.
es: Se necesitan una o varias firmas válidas: solicite que todos los paquetes recién instalados tengan al menos una firma válida.
ja: 「1 つ以上の有効な署名が必要」: 新しくインストールされるすべてのパッケージに少なくとも 1 つ有効な署名があることを要求します。
ko: 하나 이상의 유효한 서명이 필요함: 새로 설치된 모든 패키지의 서명이 하나 이상 유효해야 합니다.
zh_hk: 需要一或多個有效簽名：要求所有新安裝的套裝軟體至少有一個有效簽名。

source: Signatures are required and the certificate name must include the name or names specified in the text field when validating the signatures of a package. If more than one name is specified, the names must be comma-separated.
de: Signaturen sind erforderlich und der Zertifikatsname muss beim Überprüfen der Signaturen eines Pakets den Namen bzw. die Namen enthalten, die im Textfeld angegeben wurden. Wenn mehr als ein Name angegeben wurden, müssen diese durch ein Komma getrennt sein.
es: Las firmas se necesitan y el nombre del certificado debe incluir el nombre o los nombres especificados en el campo de texto al validar las firmas de un paquete. Si se especifica más de un nombre, los nombres deben estar separados por comas.
ja: 署名は必須であり、パッケージの署名の検証時にテキストフィールドで指定した名前が証明書名に含まれている必要があります。複数の名前を指定する場合は、名前をコンマで区切る必要があります。
ko: 서명이 필요하며 패키지 서명을 검증할 때 텍스트 필드에 지정된 이름이 인증서 이름에 포함되어야 합니다. 지정된 이름이 두 개 이상일 경우 이름은 쉼표로 구분되어야 합니다.
zh_hk: 需要簽名，且憑證名稱必須包括驗證套裝軟體簽名時在文字欄位指定的名稱。如果指定多個名稱，名稱必須使用逗號分隔。

source: Removing Publishers
de: Entfernen der Herausgeber
es: Eliminación de editores
ja: 発行元の削除
ko: 게시자 제거
zh_hk: 移除發佈者

source: Perform the following steps to remove a publisher:
ca: Realitzeu els següent passos per a treure un publicador:
cs: Proveďte následující kroky pro odstranění vydavatele:
de: Gehen Sie wie folgt vor, um einen Herausgeber zu entfernen:
es: Para suprimir un editor, realice los pasos siguientes:
ja: 発行元を削除するには、次の手順を実行します。
ko: 다음 단계를 수행하여 게시자를 제거합니다.
ru: Для удаления издателя выполните следующие действия:
zh_hk: 執行下列步驟可以移除發佈者：

source: Select the publisher that you want to remove.
de: Wählen Sie die Herausgeber aus, die Sie entfernen möchten.
es: Seleccione el editor que desea eliminar.
ja: 削除する発行元を選択します。
ko: 제거할 게시자를 선택합니다.
zh_hk: 選取想要移除的發佈者。

source: Click the <guibutton>Remove</guibutton> button to the right of the publisher list.
de: Klicken Sie rechts neben der Herausgeberliste auf die Schaltfläche <guibutton>Entfernen</guibutton>.
es: Haga clic en el botón <guibutton>Eliminar</guibutton> que se encuentra a la derecha de la lista de editores.
ja: 発行元リストの右にある<guibutton>「削除」</guibutton>ボタンをクリックします。
ko: 게시자 목록 오른쪽에 있는 <guibutton>제거</guibutton> 버튼을 누릅니다.
zh_hk: 按一下發佈者清單右方的 [<guibutton>移除</guibutton>] 按鈕。

source: If the selected publisher is a system publisher, the <guibutton>Remove</guibutton> button is disabled. The Details pane indicates that the selected publisher is a system publisher and displays a message that this publisher cannot be modified or removed.
de: Wenn der ausgewählte Herausgeber ein Systemherausgeber ist, ist die Schaltfläche <guibutton>Entfernen</guibutton> deaktiviert. Im Bereich "Details" wird angezeigt, dass der ausgewählte Herausgeber ein Systemherausgeber ist. Eine Meldung wird angezeigt, die Sie informiert, dass dieser Herausgeber nicht geändert oder entfernt werden kann.
es: Si el editor seleccionado es un editor del sistema, el botón <guibutton>Eliminar</guibutton> está inhabilitado. El panel Detalles indica que el editor seleccionado es un editor del sistema y muestra un mensaje que establece que este editor no se puede modificar ni eliminar.
ja: 選択した発行元がシステム発行元の場合、<guibutton>「削除」</guibutton>ボタンは使用不可になります。「詳細」区画には、選択した発行元がシステム発行元であることが示され、この発行元の変更や削除を行うことはできないというメッセージが表示されます。
ko: 선택된 게시자가 시스템 게시자일 경우 <guibutton>제거</guibutton> 버튼이 사용 안함으로 설정됩니다. 세부 정보 창에 선택된 게시자가 시스템 게시자인 것으로 나타나며 이 게시자를 수정 또는 제거할 수 없음을 알리는 메시지가 표시됩니다.
zh_hk: 如果所選的發佈者是系統發佈者，則會停用 [<guibutton>移除</guibutton>] 按鈕。[詳細資訊] 窗格會指出所選的發佈者為系統發佈者，並顯示訊息無法修改或移除此發佈者的訊息。

source: Managing Boot Environments
de: Verwalten der Boot-Umgebungen
es: Gestión de entornos de inicio
ja: ブート環境の管理
ko: 부트 환경 관리
zh_hk: 管理啟動環境
