Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: Go to step 2 in the <xref linkend="gilfh"/> section. Follow the instructions to delete old or unused boot environments and free up disk space.
ca: Aneu al pas 2 de la <xref linkend="gilfh"/> secció. Seguiu les instruccions per a eliminar entorn d'arranc antics o sense utilitzar i allibereu espai al disc.
cs: Přejděte na krok 2 v sekci <xref linkend="gilfh"/>. Následujte instrukce pro smazání starých nebo nepoužívaných bootovacích prostředí a uvolnění místa na disku.
ru: Перейдите к этапу 2 в разделе <xref linkend="gilfh"/> . Удалите устаревшие или неиспользуемые среды загрузки в соответствии с инструкциями для освобождения дисковогопространства.

source: Click <guibutton>Update All</guibutton> in the <emphasis role="strong">Update Manager</emphasis> window to restart the process of updating all packages.
ca: Cliqueu a <guibutton>Actualitzar tot</guibutton> en la finestra del <emphasis role="strong">Gestor de paquets</emphasis> per a reiniciar el procés d'actualització de tots els paquets.
cs: Klikněte na <guibutton>Aktualizovat Vše</guibutton> v okně <emphasis role="strong">Správce aktualizací</emphasis> pro restart procesu aktualizace balíčků.
ru: Перезапустите обновление всех пакетов кнопкой <guibutton>Обновить все</guibutton> в окне <emphasis role="strong">Диспетчер обновлений</emphasis>.

source: 2010.03 Release Notes
ca: Notes de la versió 2010.03
cs: 2010.03 Poznámky k vydání
ru: Заметки о выпуске 2010.03

source: The Release Notes for 2010.03 are available at the following location: <ulink url="http://docs.sun.com/source/820-7679/index.html"/>.
ca: Les Notes de la versió 2010.03 estan disponibles a la següent localització: <ulink url="http://docs.sun.com/source/820-7679/index.html"/>.
cs: Poznámky k vydání 2010.03 jsou dostupné na následujícím umístění: <ulink url="http://docs.sun.com/source/820-7679/index.html"/>.
ru: Заметки о выпуске 2010.03 расположены по следующему адресу: <ulink url="http://docs.sun.com/source/820-7679/index.html"/>.

source: Image Packaging System Glossary
ca: Glosari del Sistema d'empaquetament d'imatges
cs: Slovník balíčkovacího systému IPS
ru: Глоссарий системы управления пакетами

source: A person, group, or corporation that provides packages. Packages for a publisher are found in a repository, from which the package system retrieves package data.
ru: Лицо, группа лиц или организация, предоставляющие пакеты. Пакеты издателя располагаются в хранилище, из которого данные о пакетах поступают в систему управления пакетами.

source: repository
ca: repositori
cs: repozitář
ru: хранилище

source: A location where clients can publish and retrieve package content such as files contained within the package, and package metadata which includes information about the package such as its name and description.
ca: Una localització on els clients poden publicar i recuperar el contingut del paquet com els fitxers continguts en un paquet, i les metadades del paquet les quals inclouen informació quant al paquet com el seu nom i la seva descripció.
cs: Umístění, kde klienti mohou publikovat a získávat obsah balíčků jako jsou soubory, metada, která zahrnují informace o balíčku (jméno a popis).
ru: Местоположение, в котором клиенты могут публиковать и получать содержимое пакетов, например, файлы внутри пакета, а также метаданные пакета, включающие в себя сведения о пакете, такие как его имя и описание.

source: boot environment
ca: entorn d'arranc
cs: bootovací prostředí
ru: Загрузочная среда

source: For an OpenSolaris 2010.03 release, a boot environment is an instance of a bootable OpenSolaris environment. The root file system and all other file systems of the boot environment that contain system software are required to be ZFS datasets.
ru: В контексте выпуска OpenSolaris 2010.03 загрузочная среда представляет собой экземпляр загружаемой среды ОС OpenSolaris. Корневая файловая система и все остальные файловые системы загрузочной среды, содержащие системное программное обеспечение, должны являться наборами данных ZFS.

source: The active boot environment is the one that is currently booted. Many boot environments can present on an OpenSolaris system and an inactive boot environment can be in a state of waiting for activation upon system reboot.
ca: L'entorn d'arranc actual és el que actualment està arrancat. Qualsevol Entorn d'arranc pot presentar un sistema OpenSolaris i un Entorn d'arranc inactiu pot tenir un estat esperant l'activació després de reiniciar el sistema.
cs: Aktivní bootovací prostředí je to, které bude zavedeno. Na systému OpenSolaris může být umístěno více bootovacích prostředí a neaktivní prostředí mohou být ve stavu čekající na aktivaci po restartu systému.
ru: Активной называется среда загрузки, загруженная в данный момент. В системе OpenSolaris может быть несколько сред загрузки, и неактивные среды загрузки могут находиться в состоянии ожидания активации после перезагрузки системы.

source: A collection of software in a package that comprises an entire or partial operating system. The package is suitable for installation.
ca: Una col·lecció de programari dins d'un paquet que comprimeix un sencer o parcial sistema operatiu. El paquet és adequat per a la instal·lació.
cs: Sbírka softwaru v balíčku, která komprimuje celý nebo část operačního systému.
ru: Набор программного обеспечения в пакете, который содержит всю операционную систему или ее часть. Такой пакет может быть использован для установки.

source: An image is a location on your system where packages and their associated files, directories, links, and dependencies can be installed.
ca: Una imatge és una localització en el vostre sistema on els paquets, els seus fitxers, directoris, enllaços, i dependències associades poden ser instal·lats.
cs: Obraz je umístění na systému, kam jsou instalovány všechny balíčky a jejich přidružené soubory, adresáře, odkazy a závislosti.
ru: Образ представляет собой местоположение в системе, куда могут устанавливаться пакеты и связанные с ними файлы, каталоги, ссылки и зависимости.

source: Location of a package repository specified by a URI, that contains a complete set of package data.
ru: Местоположение хранилища пакетов, соответствующее идентификатору URI и содержащее полный набор данных пакета.

source: An alternate name for a publisher.
ca: Un nom alternatiu per a un publicador.
cs: Alternativní název pro vydavatele.
ru: Альтернативное имя издателя.

source: mirror
ru: зеркало

source: Location of a package repository, specified by a URI, that contains only package files.
ru: Местоположение хранилища пакетов, соответствующее идентификатору URI и содержащее только файлы пакета.

source: Sun Microsystems, Inc. has intellectual property rights relating to technology embodied in the product that is described in this document. In particular, and without limitation, these intellectual property rights may include one or more U.S. patents or pending patent applications in the U.S. and in other countries.
ru: Компания Sun Microsystems, Inc. имеет интеллектуальные права собственности натехнологию, воплощенную в продукте, который описан в данном документе. В частности, и помимо прочего, данные интеллектуальные права собственности могут включать один или более патентов США либо заявки на патенты в США и других странах.

source: U.S. Government Rights – Commercial software. Government users are subject to the Sun Microsystems, Inc. standard license agreement and applicable provisions of the FAR and its supplements.
ru: Права правительства США – коммерческое программное обеспечение. Пользователи из государственных организаций подчинены стандартному лицензионному соглашению Sun Microsystems, Inc.,положениям документа FAR и его дополнений.

source: This distribution may include materials developed by third parties.
ru: Данный выпуск может включать в себя материалы, разработанные третьими сторонами.

source: Parts of the product may be derived from Berkeley BSD systems, licensed from the University of California. UNIX is a registered trademark in the U.S. and other countries, exclusively licensed through X/Open Company, Ltd.
ru: Части данного продукта могут быть основаны на системах Berkeley BSD, лицензированных в Калифорнийском университете. UNIX является зарегистрированной торговой маркой в США и других странах, лицензируемой исключительно через компанию X/Open Company, Ltd.

source: Sun, Sun Microsystems, the Sun logo, the Solaris logo, the Java Coffee Cup logo, docs.sun.com, Java, and Solaris are trademarks or registered trademarks of Sun Microsystems, Inc. or its subsidiaries in the U.S. and other countries. All SPARC trademarks are used under license and are trademarks or registered trademarks of SPARC International, Inc. in the U.S. and other countries. Products bearing SPARC trademarks are based upon an architecture developed by Sun Microsystems, Inc.
ru: Sun, Sun Microsystems, логотипы Sun, Solaris и Java Coffee Cup, docs.sun.com, Java и Solaris являются торговыми марками или зарегистрированными торговыми марками Sun Microsystems, Inc. или ее филиалов в США и других странах. Все торговые марки SPARC используются по лицензии и являются торговыми марками или зарегистрированными торговыми марками SPARC International, Inc. в СШАи других странах. Изделия с торговыми марками SPARC основаны на архитектуре, разработанной Sun Microsystems, Inc.

source: The OPEN LOOK and <trademark>Sun</trademark> Graphical User Interface was developed by Sun Microsystems, Inc. for its users and licensees. Sun acknowledges the pioneering efforts of Xerox in researching and developing the concept of visual or graphical user interfaces for the computer industry. Sun holds a non-exclusive license from Xerox to the Xerox Graphical User Interface, which license also covers Sun's licensees who implement OPEN LOOK GUIs and otherwise comply with Sun's written license agreements.
ru: Графический интерфейс пользователя OPEN LOOK и <trademark>Sun</trademark> былразработан компанией Sun Microsystems, Inc. для пользователей и лицензиатов компании. Компания Sun признает первенство компании Xerox в исследовании и разработке концепции визуальных или графических интерфейсов для компьютерной промышленности. Компания Sun имеет неисключительную лицензию компании Xerox на графический интерфейс пользователя Xerox, лицензия на который распространяется также на лицензиатов компании Sun, внедряющих интерфейсы OPEN LOOK и выполняющих все прочие письменные лицензионные соглашения, заключенные ими с компанией Sun.

source: Products covered by and information contained in this publication are controlled by U.S. Export Control laws and may be subject to the export or import laws in other countries. Nuclear, missile, chemical or biological weapons or nuclear maritime end uses or end users, whether direct or indirect, are strictly prohibited. Export or reexport to countries subject to U.S. embargo or to entities identified on U.S. export exclusion lists, including, but not limited to, the denied persons and specially designated nationals lists is strictly prohibited.
ru: Изделия и сведения, описываемые в данной публикации, находятся под юрисдикцией законов США об экспортном контроле и законов об экспорте или импорте других стран. Строго запрещено прямое или косвенное использование конечными пользователями в целях разработки ядерного, ракетного, химического или биологического оружия, а также судов с атомным двигателем. Строго запрещен экспорт или реэкспорт в страны, на которые наложено эмбарго США или находящиеся в списке исключения экспорта из США, включая, без ограничений, списки запрещенных лиц и специальные списки лиц из данных стран.

source: DOCUMENTATION IS PROVIDED “AS IS” AND ALL EXPRESS OR IMPLIED CONDITIONS, REPRESENTATIONS AND WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT, ARE DISCLAIMED, EXCEPT TO THE EXTENT THAT SUCH DISCLAIMERS ARE HELD TO BE LEGALLY INVALID.
ru: ДОКУМЕНТАЦИЯ ПРЕДОСТАВЛЯЕТСЯ НА УСЛОВИЯХ «КАК ЕСТЬ» БЕЗ КАКИХ-ЛИБО ПРЯМЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ УСЛОВИЙ, ПРЕДОСТАВЛЕНИЙ СВЕДЕНИЙ И ГАРАНТИЙ, ВКЛЮЧАЯ ЛЮБЫЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ГОДНОСТИ ДЛЯ ПРОДАЖИ, ПРИГОДНОСТИ К КОНКРЕТНОЙ ЦЕЛИ ИСПОЛЬЗОВАНИЯ ИЛИ НЕНАРУШЕНИЯ ЧЬИХ-ЛИБО ПРАВ, КРОМЕ СЛУЧАЕВ, КОГДА ПОДОБНЫЕ ОТКАЗЫ ПРИЗНАЮТСЯ НЕ ИМЕЮЩИМИ ЮРИДИЧЕСКОЙ СИЛЫ.

source: Image Packaging System (IPS) is a software delivery system that interacts with a network repository. The IPS software is a framework which provides for software lifecycle management including installation, upgrade, and removal.
ca: El Sistema d'empaquetament d'imatges (IPS) és un programari de sistema de prestació de serveis que interactua amb un repositori de xarxa. El programari IPS és un framework el qual proporciona al gestor el cicle de vida del programari: instal·lació, actualització, i eliminació.
cs: Balíčkovací systém IPS je software, který spolupracuje se síťovým repozitářem. IPS software je framework, který poskytuje správu životního cyklu balíčku zahrnující jeho instalaci, aktualizaci a odstranění.

source: The OpenSolaris 2010.03 release uses IPS as its packaging system.
ca: El llançament d'OpenSolaris 2010.03 utilitza IPS com el seu sistema de paquets.
cs: OpenSolaris 2010.03 využívá jako balíčkovací systém IPS.

source: Users can use IPS to install packages from a repository, create and publish their own IPS packages, mirror an existing repository, and publish existing packages to a repository.
ca: Els usuaris poden utilitzar IPS per a instal·lar paquets des d'un repositori, crear i publicar els seus paquets IPS propis, fer una rèplica d'un repositori existent, i publicar paquets existents a un repositori.
cs: Uživatelé mohou použít IPS pro instalaci balíčků z repozitáře, vytváření a publikování jejich vlastních balíčků, zrcadlit existující repozitář nebo publikovat existující balíčky v repozitáři.

source: If the system on which IPS is installed is on the network, IPS can automatically access the OpenSolaris publisher. For the OpenSolaris 2010.03 release, your IPS client can access the packages from <ulink url="http://pkg.opensolaris.org"/>.
ca: Si el sistema on està instal·lat IPS té accés a la xarxa, IPS pot accedir de forma automàtica al publicador d'OpenSolaris. Pel llançament d'OpenSolaris 2010.03, el vostre client IPS pot accedir als paquets de <ulink url="http://pkg.opensolaris.org"/>.
cs: Pokud je systém, kde je IPS nainstalován, připojen k síti, IPS se může automaticky připojit k OpenSolaris vydavateli. V případě verze OpenSolaris 2010.03 může váš IPS klient získat balíčky z <ulink url="http://pkg.opensolaris.org"/>.

source: games
ca: jocs

source: compiler
ca: compilador

source: tools
ca: eines

source: book
ca: llibre

source: The <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Publishers</guimenuitem></menuchoice> dialog enables the user to add and manage the configured publishers. A publisher is a person, group, or corporation that designs, creates, and publishes a package to a repository. A repository is a source for packages. Every publisher has a origin URI (Universal Resource Identifier) associated with it. Read the following sections to learn how to add and manage publishers on your system.
ca: El diàleg <menuchoice><guimenu>Fitxer</guimenu><guimenuitem>Gestionar Publicadors</guimenuitem></menuchoice> permet a l'usuari sfegir i gestionar els publicadors configurats. un publicador és una persona, grup, o corporació que dissenya, crea, i publica un paquet en un repositori. Un repositori és una font pels paquets. Cada publicador té una URI (Universal Resource Identifier) origen associada a ell. Llegiu les següents seccions per a afegir i gestionar publicadors en el vostre sistema.
cs: Dialog <menuchoice><guimenu>Soubor</guimenu><guimenuitem>Správa vydavatelů</guimenuitem></menuchoice> umožňuje uživateli přidávat a spravovat nastavení vydavatelů. Vydavatel je osoba, skupina nebo korporace, která navrhuje a vydává balíčky do repozitáře. Repozitář je zdroj balíčků. Každý vydavatel má své URI (Universal Resource Identifier). Pro zjištění, jak přidávat a spravovat vydavatele na Vašem systému, čtěte následující sekce.

source: A person, group, or corporation that designs, creates, and publishes a package to a repository. The repository in turn serves the packages from the (default) publisher, for downloading purposes.
ca: Una persona, grup, o corporació que dissenya, crea, i publica un paquet en un repositori. El repositori serveix els paquets des del publicador (predeterminat), per a propòsits de descàrrega.
cs: Osoba, skupina nebo společnost, která navrhuje, vytváří a zveřejňuje balíčky do repozitáře. Repozitář pak poskytuje balíčky z (výchozí) vydavatele pro účely stahování.

source: For an OpenSolaris release, a boot environment is an instance of a bootable OpenSolaris environment. The root file system and all other file systems of the boot environment that contain system software are required to be ZFS datasets.
ca: Per a una versió d'OpenSolaris, un Entorn d'arranc és una instància d'un entorn d'OpenSolaris arrancable. El sistema de fitxers arrel i tots els altres sistemes de fitxers de l'entorn d'arranc que conté el sistema de programari són necessaris per als registres de ZFS.
cs: Pro vydání OpenSolarisu je bootovací prostředí instancí bootovatelného OpenSolaris prostředí. Kořenový souborový systém a všechny ostaní souborové systémy bootovacího prostředí, které obsahují systémový software, jsou požadovány ZFS datasetem.

source: Location of a package repository specified by a URI.
ca: La localització d'un repositori de paquets especificada amb un URI.
cs: Umístění repozitáře balíčků je specifikovánoURI adresou.
