Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: In the Alias field, you can enter an alternate name for this publisher.
de: In das Feld "Alias" können Sie einen alternativen Namen für diesen Herausgeber eingeben.
es: En el campo Alias, puede introducir un nombre alternativo para este editor.
ja: 「別名」フィールドには、この発行元の代替名を入力できます。
ko: 별칭 필드에 이 게시자에 대한 대체 이름을 입력할 수 있습니다.
zh_hk: 在 [別名] 欄位中，您可以輸入此發佈者的替代名稱。

source: Click the <guibutton>Add</guibutton> button.
de: Klicken Sie auf die Schaltfläche <guibutton>Hinzufügen</guibutton>.
es: Haga clic en el botón <guibutton>Agregar</guibutton>.
ja: <guibutton>「追加」</guibutton>ボタンをクリックします。
ko: <guibutton>추가</guibutton> 버튼을 누릅니다.
zh_hk: 按一下 [<guibutton>增加</guibutton>] 按鈕。

source: The Adding Publisher dialog is displayed. Click <guibutton>Cancel</guibutton> to cancel the process. Click Details to view verbose information.
de: Das Dialogfeld "Herausgeber wird hinzugefügt" wird angezeigt. Klicken Sie auf <guibutton>Abbrechen</guibutton>, um den Prozess abzubrechen. Klicken Sie auf "Details", um Verbose-Informationen anzuzeigen.
es: Aparecerá el cuadro de diálogo Agregando editor. Haga clic en el botón <guibutton>Cancelar</guibutton> para anular el proceso. Haga clic en Detalles para ver información detallada.
ja: 「発行元を追加」ダイアログが表示されます。処理を取り消すには、<guibutton>「取消し」</guibutton>をクリックします。詳細情報を表示するには、「詳細」をクリックします。
ko: 게시자 추가 대화 상자가 표시됩니다. 프로세스를 취소하려면 <guibutton>취소</guibutton>를 누르고, 자세한 정보를 표시하려면 세부 정보를 누릅니다.
zh_hk: 會顯示 [增加發佈者] 對話方塊。按一下 [<guibutton>取消</guibutton>] 可取消程序。按一下 [詳細資訊] 可檢視詳細資訊。

source: If the new publisher is added successfully, the Adding Publisher Complete dialog is displayed and shows the new publisher name, alias, and URI.
de: Wenn der neue Herausgeber erfolgreich hinzugefügt werden konnte, wird das Dialogfeld "Hinzufügen des Herausgebers abgeschlossen" mit dem Namen, Alias und der URI des neuen Herausgebers angezeigt.
es: Si el nuevo editor se ha agregado correctamente, aparecerá el cuadro de diálogo Agregar editor completado y mostrará el nombre, el alias y el URI del nuevo editor.
ja: 新しい発行元が正常に追加されると、「発行元を追加しました」ダイアログが表示され、新しい発行元の名前、別名、および URI が表示されます。
ko: 새 게시자가 성공적으로 추가된 경우 새 게시자 이름, 별칭 및 URI를 나타내는 게시자 추가 완료 대화 상자가 표시됩니다.
zh_hk: 如果已成功增加新的發佈者，會顯示 [增加發佈者完成] 對話方塊，並顯示新的發佈者名稱、別名和 URI。

source: If the new publisher is not added, the Publisher Error dialog is displayed with information about the problem.
de: Wenn der neue Herausgeber nicht hinzugefügt wird, wird das Dialogfeld "Herausgeberfehler" mit Fehlerinformationen angezeigt.
es: Si el nuevo editor no se ha agregado, aparecerá el cuadro de diálogo Error de editor con información sobre el problema.
ja: 新しい発行元が追加されなかった場合、「発行元エラー」ダイアログが表示され、問題に関する情報が表示されます。
ko: 새 게시자가 추가되지 않은 경우 문제에 대한 정보를 나타내는 게시자 오류 대화 상자가 표시됩니다.
zh_hk: 如果未增加新的發佈者，會顯示 [發佈者發生錯誤] 對話方塊，內含關於此問題的資訊。

source: The new publisher is the last publisher listed in the Manage Publishers window and is enabled and sticky.
de: Der neue Herausgeber wird als letzter Herausgeber im Fenster "Herausgeber verwalten" aufgeführt. Er ist aktiviert und als Sticky-Herausgeber festgelegt.
es: El nuevo editor es el último editor de la lista que aparece en la ventana Administrar editores, y está habilitado y es permanente.
ja: 新しい発行元は、「発行元の管理」ウィンドウで発行元リストの最後に表示され、有効および固定的になります。
ko: 새 게시자는 게시자 관리 창에 마지막 게시자로 나열되며 사용으로 설정되고 고정으로 지정됩니다.
zh_hk: 新的發佈者是列於 [管理發佈者] 視窗中的最新發佈者，而且已啟用和固定。

source: See <xref linkend="modify-publisher"/> for information about changing the priority of the new publisher, changing the enabled and sticky settings, changing the publisher alias, adding a publisher origin, setting an SSL key and certificate, adding a publisher mirror, and managing publisher certificates and signature policy.
de: Unter <xref linkend="modify-publisher"/> finden Sie Informationen dazu, wie Sie die Priorität für einen neuen Herausgeber, den aktivierten Status und Sticky-Einstellungen, den Herausgeber-Alias ändern können und wie Sie einen Herausgeberursprung hinzufügen können, einen SSL-Schlüssel und ein SSL-Zertifikat festlegen können, einen Herausgeberspiegel hinzufügen können und Herausgeberzertifikate sowie Signaturrichtlinie verwalten können.
es: Consulte <xref linkend="modify-publisher"/> para obtener información sobre cambiar la prioridad del nuevo editor, cambiar las configuraciones habilitadas y permanentes, cambiar el alias de editor, agregar el origen de editor, configurar una clave y un certificado SSL, agregar un reflejo de editor y gestionar certificados y políticas de firmas de editor.
ja: 新しい発行元の優先度の変更、有効設定と固定的設定の変更、発行元の別名の変更、発行元の起点の追加、SSL キーと証明書の設定、発行元のミラーの追加、および発行元証明書と署名ポリシーの管理については、<xref linkend="modify-publisher"/>を参照してください。
ko: 새 게시자의 우선 순위 변경, 사용 및 고정 설정 변경, 게시자 별칭 변경, 게시자 원본 추가, SSL 키 및 인증서 설정, 게시자 미러 추가, 게시자 인증서 및 서명 정책 추가에 대한 자세한 내용은 <xref linkend="modify-publisher"/>을 참조하십시오.
zh_hk: 請參閱 <xref linkend="modify-publisher"/> 以瞭解變更新發佈者的優先權、變更已啟用和固定設定、變更發佈者別名、增加發佈者原始、設定 SSL 金鑰和憑證、增加發佈者鏡像，以及管理發佈者憑證和簽名策略的相關資訊。

source: Modifying Publishers
de: Ändern von Herausgebern
es: Modificación de editores
ja: 発行元の変更
ko: 게시자 수정
zh_hk: 修改發佈者

source: To modify the attributes of a publisher, select the <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Publishers</guimenuitem></menuchoice> menu option. Currently configured publishers are listed in the Manage Publishers window.
de: Wählen Sie zum Ändern der Attribute eines Herausgebers die Menüoption <menuchoice><guimenu>Datei</guimenu><guimenuitem>Herausgeber verwalten</guimenuitem></menuchoice>. Die aktuell konfigurierten Herausgeber werden im Fenster "Herausgeber verwalten" aufgeführt.
es: Para modificar los atributos de un editor, seleccione la opción de menú <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Administrar editores</guimenuitem></menuchoice>. Los editores actualmente configurados se muestran en la ventana Administrar editores.
ja: 発行元の属性を変更するには、<menuchoice><guimenu>「ファイル」</guimenu><guimenuitem>「発行元の管理」</guimenuitem></menuchoice>メニューオプションを選択します。現在設定されている発行元が「発行元の管理」ウィンドウに一覧表示されます。
ko: 게시자 속성을 수정하려면 <menuchoice><guimenu>파일</guimenu><guimenuitem>게시자 관리</guimenuitem></menuchoice> 메뉴 옵션을 선택합니다. 현재 구성된 게시자가 게시자 관리 창에 나열됩니다.
zh_hk: 若要修改發佈者屬性，選取 <menuchoice>[<guimenu>檔案</guimenu>] [<guimenuitem>管理發佈者</guimenuitem>]</menuchoice> 功能表選項。目前配置的發佈者會列於 [管理發佈者] 視窗中。

source: In the Manage Publishers window you can change the priority of a publisher, enable or disable a publisher, set the publisher to be sticky or non-sticky, and remove a publisher. See <xref linkend="priority-stickiness"/> and <xref linkend="remove-publisher"/>.
de: Im Fenster "Herausgeber verwalten" können Sie die Priorität für einen Herausgeber ändern, einen Herausgeber aktivieren oder deaktivieren, einen Herausgeber als Sticky-Herausgeber festlegen oder diese Einstellung zurücksetzen und einen Herausgeber entfernen. Weitere Informationen finden Sie unter <xref linkend="priority-stickiness"/> und <xref linkend="remove-publisher"/>.
es: En la ventana Administrar editores puede cambiar la prioridad de un editor, habilitar o deshabilitar un editor, configurar al editor para que sea permanente o no permanente y eliminar un editor. Consulte <xref linkend="priority-stickiness"/> y <xref linkend="remove-publisher"/>.
ja: 「発行元の管理」ウィンドウでは、発行元の優先度の変更、発行元の有効化または無効化、発行元を固定的または非固定的に設定すること、および発行元の削除を行うことができます。<xref linkend="priority-stickiness"/>および<xref linkend="remove-publisher"/>を参照してください。
ko: 게시자 관리 창에서 게시자의 우선 순위를 변경하고, 게시자를 사용 또는 사용 안함으로 설정하고, 게시자를 고정 또는 비고정으로 설정하고, 게시자를 제거할 수 있습니다. <xref linkend="priority-stickiness"/> 및 <xref linkend="remove-publisher"/>를 참조하십시오.
zh_hk: 在 [管理發佈者] 視窗中，您可以變更發佈者的優先權、啟用或停用發佈者、設定發佈者為固定或非固定以及移除發佈者。請參閱 <xref linkend="priority-stickiness"/> 和 <xref linkend="remove-publisher"/>。

source: Click the <guibutton>Modify</guibutton> button to open the Modify Publisher window. In the Modify Publisher window you can change the publisher alias, add or remove a publisher origin, add or remove a publisher mirror, set an SSL key and certificate, and manage publisher certificates and signature policy. See <xref linkend="origin-mirror"/> and <xref linkend="pub-security"/>.
de: Klicken Sie auf die Schaltfläche <guibutton>Ändern</guibutton>, um das Fenster "Herausgeber ändern" zu öffnen. Im Fenster "Herausgeber ändern" können Sie den Herausgeber-Alias ändern, einen Herausgeberursprung und Herausgeberspiegel hinzufügen oder entfernen, einen SSL-Schlüssel oder ein SSL-Zertifikat festlegen und Herausgeberzertifikate und Signaturrichtlinie verwalten. Weitere Informationen finden Sie unter <xref linkend="origin-mirror"/> und <xref linkend="pub-security"/>.
es: Haga clic en el botón <guibutton>Modificar</guibutton> para abrir la ventana Modificar editor. En la ventana Modificar editor puede cambiar el alias de editor, agregar o eliminar el origen de editor, agregar o eliminar un reflejo de editor, configurar una clave y un certificado SSL y gestionar certificados y políticas de firmas de editor. Consulte <xref linkend="origin-mirror"/> y <xref linkend="pub-security"/>.
ja: <guibutton>「変更」</guibutton>ボタンをクリックして「発行元の変更」ウィンドウを開きます。「発行元の変更」ウィンドウでは、発行元の別名の変更、発行元の起点の追加または削除、発行元のミラーの追加または削除、SSL キーと証明書の設定、および発行元証明書と署名ポリシーの管理を行うことができます。<xref linkend="origin-mirror"/>および<xref linkend="pub-security"/>を参照してください。
ko: 게시자 수정 창을 열려면 <guibutton>수정</guibutton> 버튼을 누릅니다. 게시자 수정 창에서 게시자 별칭을 변경하고, 게시자 원본을 추가 또는 제거하고, 게시자 미러를 추가 또는 제거하고, SSL 키 및 인증서를 설정하고, 게시자 인증서 및 서명 정책을 관리할 수 있습니다. <xref linkend="origin-mirror"/> 및 <xref linkend="pub-security"/>을 참조하십시오.
zh_hk: 按一下 [<guibutton>修改</guibutton>] 按鈕開啟 [修改發佈者] 視窗。在 [修改發佈者] 視窗中，您可以變更發佈者別名、增加或移除發佈者原始、增加或移除發佈者鏡像、設定 SSL 金鑰和憑證，以及管理發佈者憑證和簽名策略。請參閱 <xref linkend="origin-mirror"/> 和 <xref linkend="pub-security"/>。

source: Changing Priority and Stickiness
de: Ändern der Priorität und der Stickiness
es: Cambio de prioridad y permanencia
ja: 優先度と固定性の変更
ko: 우선 순위 및 고착성 변경
zh_hk: 變更優先權和固定性

source: Select the <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Publishers</guimenuitem></menuchoice> menu option to display the Manage Publishers window.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Datei</guimenu><guimenuitem>Herausgeber verwalten</guimenuitem></menuchoice>, um das Fenster Herausgeber verwalten' anzuzeigen.
es: Seleccione la opción de menú <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Administrar editores</guimenuitem></menuchoice> para mostrar la ventana Administrar editores.
ja: <menuchoice><guimenu>「ファイル」</guimenu><guimenuitem>「発行元の管理」</guimenuitem></menuchoice>メニューオプションを選択して「発行元の管理」ウィンドウを表示します。
ko: 게시자 관리 창을 표시하려면 <menuchoice><guimenu>파일</guimenu><guimenuitem>게시자 관리</guimenuitem></menuchoice> 메뉴 옵션을 선택합니다.
zh_hk: 選取 <menuchoice>[<guimenu>檔案</guimenu>] [<guimenuitem>管理發佈者</guimenuitem>]</menuchoice> 功能表選項，以顯示 [管理發佈者] 視窗。

source: Publisher Priority
de: Herausgeberpriorität
es: Prioridad de editor
ja: 発行元の優先度
ko: 게시자 우선 순위
zh_hk: 發佈者優先權

source: Publishers are listed in priority order in the Manage Publishers window. The publisher at the top of the list is the highest priority publisher. The publisher at the bottom of the list is the lowest priority publisher.
de: Herausgeber werden im Fenster "Herausgeber verwalten" entsprechend ihrer Priorität aufgeführt. Der oberste Herausgeber in der Liste ist der Herausgeber mit der höchsten Priorität. Der unterste Herausgeber in der Liste ist der Herausgeber mit der niedrigsten Priorität.
es: Los editores se muestran en orden de prioridad en la ventana Administrar editores. El editor con la prioridad más alta se muestra al principio de la lista. El editor con la prioridad más baja se muestra al final de la lista.
ja: 発行元は優先度の順に「発行元の管理」ウィンドウに表示されます。リストの最上部の発行元は優先度のもっとも高い発行元です。リストの最下部の発行元は優先度のもっとも低い発行元です。
ko: 게시자는 게시자 관리 창에 우선 순위대로 나열됩니다. 우선 순위가 가장 높은 게시자가 목록 위쪽에 표시되고, 우선 순위가 가장 낮은 게시지가 목록 아래쪽에 표시됩니다.
zh_hk: [管理發佈者] 視窗中會依照優先順序列出發佈者。清單最上方的發佈者為優先權最高的發佈者。清單最下方的發佈者為優先權最低的發佈者。

source: The publisher at the top of the list is also known as the preferred publisher.
de: Der oberste Herausgeber in der Liste wird auch als bevorzugter Herausgeber bezeichnet.
es: El editor que se muestra al principio de la lista también se conoce como "editor preferido".
ja: リストの最上部の発行元は優先発行元とも呼ばれます。
ko: 목록 위쪽에 있는 게시자를 기본 게시자라고 하기도 합니다.
zh_hk: 清單最上方的發佈者也稱為喜好的發佈者。

source: The preferred publisher cannot be disabled or removed.
de: Der bevorzugte Herausgeber kann nicht deaktiviert oder entfernt werden.
es: El editor preferido no se puede inhabilitar ni eliminar.
ja: 優先発行元を無効にしたり削除したりすることはできません。
ko: 기본 게시자는 사용 안함으로 설정하거나 제거할 수 없습니다.
zh_hk: 無法停用或移除喜好的發佈者。

source: When you search for packages and do not specify a publisher, the catalogs of higher priority publishers are searched first.
de: Wenn Sie Pakete suchen und keinen Herausgeber angeben, werden zuerst die Kataloge der Herausgeber mit höherer Priorität durchsucht.
es: Cuando se buscan paquetes y no se especifica un editor, primero se busca en los catálogos de los editores con la prioridad más alta.
ja: 発行元を指定せずにパッケージを検索する場合、優先度の高い発行元のカタログから順に検索されます。
ko: 패키지를 검색할 때 게시자를 지정하지 않을 경우 우선 순위가 더 높은 게시자의 카탈로그가 먼저 검색됩니다.
zh_hk: 當您搜尋套裝軟體而且未指定發佈者時，會先搜尋優先權較高的發佈者目錄。

source: When you update a package that was installed from a non-sticky publisher, the catalogs of higher priority publishers are searched first for updates.
de: Wenn Sie ein Paket aktualisieren, das von keinem Sticky-Herausgeber installiert wurde, werden zuerst die Kataloge von Herausgebern mit höherer Priorität nach Updates durchsucht.
es: Cuando se actualiza un paquete instalado de un editor no permanente, primero se buscan actualizaciones para los catálogos de editores con la prioridad más alta.
ja: 非固定的発行元のインストール済みパッケージを更新する場合、優先度の高い発行元のカタログから順に更新が検索されます。
ko: 비고정 게시자로부터 설치된 패키지를 업데이트하면 우선 순위가 더 높은 게시자의 카탈로그가 업데이트를 위해 먼저 검색됩니다.
zh_hk: 當您更新非固定發佈者安裝的套裝軟體時，會先搜尋優先權較高的發佈者目錄以進行更新。

source: To change the priority of a publisher, perform the following steps:
de: Führen Sie zum Ändern der Priorität eines Herausgebers die folgenden Schritte aus:
es: Para cambiar la prioridad de un editor, realice los siguientes pasos:
ja: 発行元の優先度を変更するには、次の手順を実行します。
ko: 게시자의 우선 순위를 변경하려면 다음 단계를 수행합니다.
zh_hk: 若要變更發佈者優先權，請執行下列步驟：

source: Click to highlight a publisher row in the list in the Manage Publishers window.
de: Klicken Sie im Fenster "Herausgeber verwalten" auf eine Herausgeberzeile in der Liste, um diese Zeile zu markieren.
es: Haga clic para resaltar la fila de un editor en la lista de la ventana Administrar editores.
ja: 「発行元の管理」ウィンドウのリストで発行元の行をクリックして強調表示します。
ko: 게시자 관리 창의 목록에서 게시자 행을 눌러 강조 표시됩니다.
zh_hk: 在 [管理發佈者] 視窗中，按一下以反白顯示清單中的發佈者列。

source: Click the <guibutton>Up</guibutton> and <guibutton>Down</guibutton> buttons to the right of the publisher list to increase or reduce the priority of the selected publisher. The selected publisher listing moves up and down in the list to show its new priority.
de: Klicken Sie auf die Schaltflächen <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton> rechts neben der Herausgeberliste, um die Priorität des ausgewählten Herausgebers zu erhöhen oder zu verringern. Die Anzeige des ausgewählten Herausgebers wird nach oben und nach unten verschoben, um die neue Priorität anzuzeigen.
es: Haga clic en los botones <guibutton>Arriba</guibutton> y <guibutton>Abajo</guibutton> que se encuentran a la derecha de la lista de editores para aumentar o reducir la prioridad del editor seleccionado. El editor seleccionado de la lista se puede mover hacia arriba o hacia abajo para mostrar su nueva prioridad.
ja: 発行元リストの右にある<guibutton>「上へ」</guibutton>ボタンと<guibutton>「下へ」</guibutton>ボタンをクリックして、選択した発行元の優先度を高くしたり低くしたりします。選択した発行元がリスト内で上下に移動して新しい優先度を示します。
ko: 게시자 목록 오른쪽에 있는 <guibutton>위쪽</guibutton> 및 <guibutton>아래쪽</guibutton> 버튼을 눌러 선택된 게시자의 우선 순위를 높이거나 낮춥니다. 새 우선 순위에 따라 나열되는 선택된 게시자가 목록 위쪽/아래쪽으로 이동됩니다.
zh_hk: 按一下發佈者清單右方的 [<guibutton>向上</guibutton>] 和 [<guibutton>向下</guibutton>] 按鈕，提高或降低所選發佈者的優先權。所選發佈者在清單中的位置會往上或往下移動，以顯示其新的優先權。

source: If the selected publisher is a system publisher, then the <guibutton>Up</guibutton> and <guibutton>Down</guibutton> buttons are disabled. You cannot change the priority of a system publisher. Because you cannot change the priority of a system publisher, you cannot lower the priority of the publisher that is the next higher priority above a system publisher, and you cannot raise the priority of a publisher that is the next lower priority below a system publisher.
de: Wenn der ausgewählte Herausgeber ein Systemherausgeber ist, sind die Schaltflächen <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton> deaktiviert. Sie können die Priorität eines Systemherausgebers nicht ändern. Aus diesem Grund können Sie die Priorität eines Herausgebers, der sich auf der nächst höheren Prioritätstufe über dem Systemherausgeber befindet, nicht verringern. Sie können auch die Priorität eines Herausgebers auf einer Prioritätsstufe unterhalb des Systemherausgebers nicht erhöhen.
es: Si el editor seleccionado es un editor del sistema, los botones <guibutton>Arriba</guibutton> y <guibutton>Abajo</guibutton> están inhabilitados. No puede cambiar la prioridad de un editor del sistema. Debido a que no puede cambiar la prioridad de un editor del sistema, no puede reducir la prioridad del editor que tiene la segunda prioridad más alta por encima de un editor del sistema, y no puede aumentar la prioridad de un editor que tiene la segunda prioridad más baja por debajo de un editor del sistema.
ja: 選択した発行元がシステム発行元の場合、<guibutton>「上へ」</guibutton>ボタンと<guibutton>「下へ」</guibutton>ボタンは使用不可になります。システム発行元の優先度を変更することはできません。システム発行元の優先度は変更できないため、システム発行元より 1 つだけ優先度の高い発行元の優先度を低くすることや、システム発行元より 1 つだけ優先度の低い発行元の優先度を高くすることはできません。
ko: 선택된 게시자가 시스템 게시자일 경우 <guibutton>위쪽</guibutton> 및 <guibutton>아래쪽</guibutton> 버튼이 사용 안함으로 설정됩니다. 시스템 게시자의 우선 순위는 변경할 수 없습니다. 시스템 게시자의 우선 순위는 변경할 수 없으므로 시스템 게시자보다 우선 순위가 한 단계 높은 게시자의 우선 순위를 낮출 수 없으며 시스템 게시자보다 우선 순위가 한 단계 낮은 게시자의 우선 순위를 높일 수 없습니다.
zh_hk: 如果所選的發佈者是系統發佈者，則會停用 [<guibutton>向上</guibutton>] 和 [<guibutton>向下</guibutton>] 按鈕。您無法變更系統發佈者的優先權。因為無法變更系統發佈者的優先權，所以您不能降低位於系統發佈者上一個較高優先權的發佈者優先權，也不能提高位於系統發佈者下一個較低優先權的發佈者優先權。

source: Click the <guibutton>OK</guibutton> button at the bottom of the Manage Publishers window.
de: Klicken Sie im unteren Bereich des Fensters "Herausgeber verwalten" auf die Schaltfläche <guibutton>OK</guibutton>.
es: Haga clic en el botón <guibutton>Aceptar</guibutton> que se encuentra en la parte inferior de la ventana Administrar editores.
ja: 「発行元の管理」ウィンドウ下部の<guibutton>「了解」</guibutton>ボタンをクリックします。
ko: 게시자 관리 창 아래쪽에 있는 <guibutton>확인</guibutton> 버튼을 누릅니다.
zh_hk: 按一下 [管理發佈者] 視窗底部的 [<guibutton>確定</guibutton>] 按鈕。

source: Enabled and Sticky
de: Aktiviert und Sticky
es: Habilitados y permanentes
ja: 有効と固定的
ko: 사용 및 고정
zh_hk: 已啟用和固定

source: When you add a publisher, the enabled and sticky attributes are set by default. The preferred publisher (see <xref linkend="set-pub-order"/> above) cannot be disabled. A system publisher cannot be disabled, and the sticky setting of a system publisher cannot be changed. All other enabled and sticky settings can be changed.
de: Wenn Sie einen Herausgeber hinzufügen, werden das Sticky-Attribut sowie das Attribut zum Aktivieren standardmäßig festgelegt. Der bevorzugte Herausgeber (siehe <xref linkend="set-pub-order"/> oben) kann nicht deaktiviert werden. Ein Systemherausgeber kann nicht deaktiviert werden, und die Sticky-Einstellung bei einem Systemherausgeber kann nicht geändert werden. Alle anderen aktivierten und Sticky-Einstellungen können geändert werden.
es: Cuando agrega un editor, los atributos habilitados y permanentes están configurados de manera predeterminada. El editor preferido (consulte <xref linkend="set-pub-order"/> arriba) no se puede inhabilitar. Un editor del sistema no se puede inhabilitar, y la configuración permanente de un editor del sistema no se puede cambiar. Todas las demás configuraciones habilitadas y permanentes se pueden cambiar.
ja: 発行元を追加すると、有効属性と固定的属性がデフォルトで設定されます。優先発行元 (前述の<xref linkend="set-pub-order"/>を参照) を無効にすることはできません。システム発行元を無効にすることはできず、システム発行元の固定的設定を変更することはできません。ほかの有効設定と固定的設定はすべて変更可能です。
ko: 게시자를 추가하면 기본적으로 사용 및 고정 속성이 설정됩니다. 기본 게시자(<xref linkend="set-pub-order"/> 참조)는 사용 안함으로 설정할 수 없습니다. 시스템 게시자도 사용 안함으로 설정할 수 없으며, 시스템 게시자의 고정 설정도 변경할 수 없습니다. 기타 모든 사용 및 고정 설정은 변경할 수 있습니다.
zh_hk: 當您增加發佈者，預設會設定已啟用和固定屬性。無法停用喜好的發佈者 (請參閱上述的 <xref linkend="set-pub-order"/>)。您無法停用系統發佈者，而且無法變更系統發佈者的固定設定。可變更所有其他已啟用和固定設定。

source: If the sticky attribute is set for a publisher, then a package that was installed from that publisher cannot be updated from a different publisher. If the sticky attribute is not set for a publisher, then that publisher is non-sticky. If a publisher is non-sticky, then a package that originally came from that publisher can be updated from another publisher. A different publisher might have a newer version of a package than the original publisher of the package. If you want to update to that newer version, the original publisher needs to be non-sticky. Also, if a lower priority publisher is non-sticky, then higher-priority publishers will be searched first for updates for packages installed from that non-sticky publisher.
de: Wenn das Sticky-Attribut für einen Herausgeber festgelegt ist, kann ein Paket, das von diesem Herausgeber installiert wurde, nicht durch einen anderen Herausgeber aktualisiert werden. Wenn das Sticky-Attribut nicht für einen Herausgeber festgelegt ist, handelt es sich um keinen Sticky-Herausgeber. Wenn es kein Sticky-Herausgeber ist, kann ein Paket, das von diesem Herausgeber stammt, durch einen anderen Herausgeber aktualisiert werden. Ein anderer Herausgeber könnte u. U. eine neuere Version des Pakets haben als der ursprüngliche Herausgeber dieses Pakets. Wenn Sie auf diese neuere Version aktualisieren möchten, darf der ursprüngliche Herausgeber kein Sticky-Herausgeber sein. Wenn ein Herausgeber mit niedrigerer Priorität kein Sticky-Herausgeber ist, werden zuerst die Herausgeber mit höherer Priorität auf Updates für Pakete durchsucht, die von diesem Herausgeber (nicht sticky) installiert wurden.
es: Si el atributo permanente está configurado para un editor, un paquete que se instaló de ese editor no se puede actualizar de un editor diferente. Si el atributo permanente no está configurado para un editor, ese editor no es permanente. Si un editor no es permanente, un paquete que originalmente provino de ese editor se puede actualizar de otro editor. Un editor diferente puede tener una versión más reciente de un paquete que el editor original del paquete. Si desea actualizar a esa versión más reciente, el editor original no debe ser permanente. Además, si un editor con una prioridad más baja no es permanente, primero se buscarán actualizaciones de paquetes para los editores con la prioridad más alta que tengan paquetes instalados de ese editor no permanente.
ja: 発行元に固定的属性が設定されている場合、その発行元からインストールされたパッケージは、別の発行元から更新することはできません。発行元に固定的属性が設定されていない場合、その発行元は非固定的です。非固定的発行元の場合、その発行元から最初にインストールされたパッケージは、別の発行元から更新することができます。パッケージの元の発行元よりも新しいバージョンのパッケージが別の発行元に存在することもあります。そのより新しいパッケージに更新するには、元の発行元が非固定的でなければなりません。また、優先度の低い非固定的発行元の場合、その発行元からインストールされたパッケージの更新は、より優先度の高い発行元から順に検索されます。
ko: 게시자에 대한 고정 속성을 설정하면 해당 게시자로부터 설치된 패키지를 다른 게시자로부터 업데이트할 수 없습니다. 게시자에 대한 고정 속성을 설정하지 않으면 해당 게시자가 비고정으로 설정됩니다. 게시자가 비고정일 경우 원래 해당 게시자로부터 온 패키지를 다른 게시자로부터 업데이트할 수 있습니다. 다른 게시자가 원래 패키지 게시자보다 최신 패키지 버전을 가지고 있는 경우가 있습니다. 이때 해당 최신 버전으로 업데이트하려면 원래 게시자를 비고정으로 설정해야 합니다. 또한 우선 순위가 더 낮은 게시자가 비고정일 경우 우선 순위가 더 높은 게시자가 비고정 게시자로부터 설치된 패키지의 업데이트를 위해 먼저 검색됩니다.
zh_hk: 如果已針對發佈者設定固定屬性，則無法從不同發佈者更新該發佈者所安裝的套裝軟體。如果未針對發佈者設定固定屬性，則該發佈者為非固定。如果發佈者為非固定，則可透過另一個發佈者更新原先由該發佈者安裝的套裝軟體。不同發佈者的套裝軟體版本可能會比原始發佈者的套裝軟體版本還要新。如果您要更新成較新的版本，原始發佈者需要為非固定。此外，如果較低優先權發佈者為非固定，會為該非固定發佈者安裝的套裝軟體先搜尋較高優先權發佈者以進行更新。
