Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: Add, modify, and delete IPS package publishers. See <xref linkend="manage-publisher"/>.
de: Hinzufügen, Ändern und Löschen von IPS-Paketherausgebern: weitere Informationen unter <xref linkend="manage-publisher"/>.
es: Agregar, modificar y suprimir editores de paquetes IPS. Consulte <xref linkend="manage-publisher"/>.
ja: IPS パッケージ発行元の追加、変更、および削除。<xref linkend="manage-publisher"/>を参照してください。
ko: IPS 패키지 게시자 추가, 수정 및 삭제. <xref linkend="manage-publisher"/> 참조
zh_hk: 增加、修改及刪除 IPS 套裝軟體發佈者。請參閱 <xref linkend="manage-publisher"/>。

source: List, rename, delete, and manage boot environments. See <xref linkend="manage-be"/>.
de: Aufführen, Umbennenen, Löschen und Verwalten von Boot-Umgebungen: weitere Informationen unter <xref linkend="manage-be"/>.
es: Mostrar, renombrar, suprimir y gestionar entornos de inicio. Consulte <xref linkend="manage-be"/>.
ja: ブート環境の一覧表示、名前の変更、削除、および管理。<xref linkend="manage-be"/>を参照してください。
ko: 부트 환경 나열, 이름 변경, 삭제 및 관리. <xref linkend="manage-be"/> 참조
zh_hk: 列出、重新命名、刪除及管理啟動環境。請參閱 <xref linkend="manage-be"/>。

source: Create a WebInstall installation file (<filename>.p5i</filename>). See <xref linkend="webinstall"/>.
de: Erstellen einer WebInstall-Installationsdatei (<filename>.p5i</filename>): weitere Informationen unter <xref linkend="webinstall"/>.
es: Crear un archivo de instalación WebInstall (<filename>.p5i</filename>). Consulte <xref linkend="webinstall"/>.
ja: WebInstall インストールファイル (<filename>.p5i</filename>) の作成。<xref linkend="webinstall"/>を参照してください。
ko: WebInstall 설치 파일(<filename>.p5i</filename>) 만들기. <xref linkend="webinstall"/> 참조
zh_hk: 建立 WebInstall 安裝檔案 (<filename>.p5i</filename>)。請參閱 <xref linkend="webinstall"/>。

source: This documentation refers to the following features of the Package Manager window:
de: Diese Dokumentation bezieht sich auf die folgenden Funktionen im Fenster "Package Manager":
es: Esta documentación hace referencia a las siguientes funciones de la ventana de Package Manager:
ja: このマニュアルでは、パッケージマネージャーウィンドウの次の機能について説明します。
ko: 이 설명서에서는 패키지 관리자 창의 다음 기능을 다룹니다.
zh_hk: 此文件說明下列的 [套裝軟體管理員] 視窗功能：

source: The large pane in the center of the window is the package list pane. Sometimes this pane shows informational messages, but usually this pane contains a list of packages.
de: Der große Fensterbereich in der Mitte enthält den Paketlistenbereich. In diesem Fensterbereich werden manchmal auch Informationsmeldungen angezeigt. I. d. R. ist in diesem Fensterbereich jedoch eine Liste der Pakete enthalten.
es: El panel de gran tamaño en el centro de la ventana es el panel de la lista de paquetes. A veces, este panel muestra mensajes informativos, pero, en general, contiene una lista de paquetes.
ja: ウィンドウ中央の大きい区画はパッケージリスト区画です。この区画には、情報メッセージが表示されることもありますが、通常はパッケージのリストが表示されます。
ko: 창 가운데에 있는 큰 창은 패키지 목록 창입니다. 이 창에 정보 메시지가 표시되는 경우도 있지만 일반적으로는 패키지 목록이 표시됩니다.
zh_hk: 視窗中央的大型窗格是套裝軟體清單窗格。此窗格有時顯示資訊訊息，但通常會顯示套裝軟體的清單。

source: The menu bar at the top of the window provides most Package Manager functionality.
de: In der Menüleiste im oberen Bereich des Fensters befinden sich die meisten Package Manager-Funktionalitäten.
es: La barra de menú en la parte superior de la ventana proporciona la mayoría de las funciones de Package Manager.
ja: ウィンドウ上部のメニューバーには、パッケージマネージャーの機能のほとんどが用意されています。
ko: 창 위쪽의 메뉴 표시줄은 패키지 관리자의 거의 모든 기능을 제공합니다.
zh_hk: 視窗頂端的功能表列會提供大部分的套裝軟體管理員功能。

source: The tool bar just below the menu bar has buttons on the left that provide some often-used operations. The buttons on the left of the separator have global functionality: Update all packages that have updates available or refresh the list of packages and package status. The buttons on the right of the separator only operate on selected packages.
de: In der Symbolleiste direkt unter der Menüleiste befinden sich links Schaltflächen zum Ausführen häufiger Operationen. Die Schaltflächen links von der Trennlinie haben globale Funktionen: Aktualisieren aller Pakete, für die Updates verfügbar sind, oder Aktualisieren der Paketliste und des Paketstatus. Die Schaltflächen rechts von der Trennlinie sind nur für ausgewählte Pakete vorgesehen.
es: La barra de herramientas justo debajo de la barra de menú tiene botones a la izquierda que proporcionan algunas de las operaciones más utilizadas. Los botones que se encuentran a la izquierda del separador tienen funciones globales: actualizar todos los paquetes que tengan actualizaciones disponibles o refrescar la lista de paquetes y estados de paquetes. Los botones que se encuentran a la derecha del separador sólo funcionan en los paquetes seleccionados.
ja: メニューバーのすぐ下にあるツールバーの左側には、頻繁に使用されるいくつかの操作のボタンがあります。セパレータの左にあるボタンはグローバルな機能を持ち、使用可能な更新が存在するすべてのパッケージの更新、およびパッケージリストとパッケージ状態の更新を行うことができます。セパレータの右にあるボタンは、選択されているパッケージだけを操作します。
ko: 메뉴 표시줄 아래에 있는 도구 모음의 왼쪽에는 자주 사용되는 몇 가지 작업을 제공하는 버튼이 있습니다. 구분선 왼쪽의 버튼은 전역 기능(업데이트를 사용할 수 있는 모든 패키지 업데이트 또는 패키지 목록 및 패키지 상태 새로 고침)을 수행합니다. 구분선 오른쪽의 버튼은 선택된 패키지에 대해서만 작동합니다.
zh_hk: 功能表列正下方的工具列左邊有按鈕，這些按鈕可提供一些常用的操作功能。分隔線左邊的按鈕提供的是全域功能：可更新有可用更新的所有套裝軟體，或重新整理套裝軟體清單與套裝軟體狀態。分隔線右邊的按鈕則只能在選取的套裝軟體中使用。

source: The Search field on the right of the tool bar helps control the content of the package list pane. See <xref linkend="search-pkg"/>.
de: Das Suchfeld rechts in der Symbolleiste dient zur Steuerung des Inhalts des Paketlistenbereichs. Weitere Informationen dazu finden Sie unter <xref linkend="search-pkg"/>.
es: El campo Buscar que se encuentra a la derecha de la barra de herramientas ayuda a controlar el contenido del panel de la lista de paquetes. Consulte <xref linkend="search-pkg"/>.
ja: ツールバーの右側の「検索」フィールドを利用すると、パッケージリスト区画の内容を制御できます。<xref linkend="search-pkg"/>を参照してください。
ko: 도구 모음 오른쪽의 검색 필드는 패키지 목록 창의 컨텐츠를 제어하는 데 유용합니다. <xref linkend="search-pkg"/> 참조
zh_hk: 工具列右邊的 [搜尋] 欄位可協助您控制套裝軟體清單窗格的內容。請參閱 <xref linkend="search-pkg"/>。

source: The <guimenu>Publisher</guimenu> drop-down menu below the buttons helps control the content of the package list pane and also enables you to add a new publisher. See <xref linkend="list-pkg"/> “By Publisher.”
de: Über das Dropdown-Menü <guimenu>Herausgeber</guimenu> unter den Schaltflächen können Sie den Inhalt des Paketlistenbereichs bestimmen und auch einen neuen Herausgeber hinzufügen. Weitere Informationen dazu finden Sie unter <xref linkend="list-pkg"/> "Nach Herausgeber".
es: El menú desplegable <guimenu>Editor</guimenu> debajo de los botones ayuda a controlar el contenido del panel de la lista de paquetes y también permite agregar un nuevo editor. Consulte <xref linkend="list-pkg"/> "Por editor".
ja: ボタンの下にある<guimenu>「発行元」</guimenu>ドロップダウンメニューを使用すると、パッケージリスト区画の内容を制御できるほか、新しい発行元を追加することもできます。<xref linkend="list-pkg"/>の「発行元別」を参照してください。
ko: 버튼 아래의 <guimenu>게시자</guimenu> 드롭다운 메뉴는 패키지 목록 창의 컨텐츠를 제어하는 데 유용하며 새 게시자를 추가하는 데도 사용할 수 있습니다. <xref linkend="list-pkg"/> "게시자별" 참조
zh_hk: 按鈕下方的 [<guimenu>發佈者</guimenu>] 下拉式功能表不但可協助您控制套裝軟體清單窗格的內容，也可讓您增加新的發佈者。請參閱 <xref linkend="list-pkg"/> -「依發佈者」。

source: The <guimenu>View</guimenu> drop-down menu below the Search field helps control the content of the package list pane. See Listing Packages “By Package Status.”
de: Über das Dropdown-Menü <guimenu>Ansicht</guimenu> unter dem Suchfeld können Sie den Inhalt des Paketlistenbereichs bestimmen. Weitere Informationen dazu finden Sie unter "Aufführen von Paketen" und "Nach Paketstatus".
es: El menú desplegable <guimenu>Ver</guimenu> debajo del campo Buscar ayuda a controlar el contenido del panel de la lista de paquetes. Consulte la lista de paquetes "Por estado de paquete".
ja: 「検索」フィールドの下にある<guimenu>「表示」</guimenu>ドロップダウンメニューを使用すると、パッケージリスト区画の内容を制御できます。「パッケージの一覧表示」の「パッケージ状態別」を参照してください。
ko: 검색 필드 아래의 <guimenu>보기</guimenu> 드롭다운 메뉴는 패키지 목록 창의 컨텐츠를 제어하는 데 유용합니다. "패키지 상태별" 패키지 나열 참조
zh_hk: [搜尋] 欄位下方的 [<guimenu>檢視</guimenu>] 下拉式功能表可協助您控制套裝軟體清單窗格的內容。請參閱「列出套裝軟體」-「依套裝軟體狀態」。

source: The category pane below the <guimenu>Publisher</guimenu> menu helps control the content of the package list pane. See Listing Packages “By Category.”
de: Im Kategoriebereich unter dem Menü <guimenu>Herausgeber</guimenu> können Sie den Inhalt des Paketlistenbereichs bestimmen. Weitere Informationen dazu finden Sie unter "Aufführen von Paketen" und "Nach Kategorie".
es: El panel de la categoría debajo del menú <guimenu>Editor</guimenu> ayuda a controlar el contenido del panel de la lista de paquetes. Consulte la lista de paquetes "Por categoría".
ja: <guimenu>「発行元」</guimenu>メニューの下にあるカテゴリ区画を使用すると、パッケージリスト区画の内容を制御できます。「パッケージの一覧表示」の「カテゴリ別」を参照してください。
ko: <guimenu>게시자</guimenu> 메뉴 아래의 범주 창은 패키지 목록 창의 컨텐츠를 제어하는 데 유용합니다. "범주별" 패키지 나열 참조
zh_hk: [<guimenu>發佈者</guimenu>] 功能表下方的類別窗格可協助您控制套裝軟體清單窗格的內容。請參閱「列出套裝軟體」-「依類別」。

source: Below the list of software categories is a list of searches that you have performed in this session.
de: Unterhalb der Liste mit Softwarekategorien befindet sich die Liste der Suchvorgänge, die Sie in dieser Sitzung ausgeführt haben.
es: Debajo de la lista de categorías de software hay una lista de búsquedas que usted ha realizado en esta sesión.
ja: ソフトウェアカテゴリのリストの下に、このセッションで実行した検索のリストがあります。
ko: 소프트웨어 범주 목록 아래에는 이 세션에서 수행한 검색 목록이 표시됩니다.
zh_hk: 軟體類別清單下方是您已經在此階段作業中執行的搜尋清單。

source: Below the package list pane is the package details pane. See <xref linkend="package-version"/>.
de: Unterhalb des Paketlistenbereichs befindet sich der Fensterbereich mit Paketinformationen. Weitere Informationen dazu finden Sie unter <xref linkend="package-version"/>.
es: Debajo del panel de la lista de paquetes se encuentra el panel de detalles de paquetes. Consulte <xref linkend="package-version"/>.
ja: パッケージリスト区画の下に、パッケージの詳細区画があります。<xref linkend="package-version"/>を参照してください。
ko: 패키지 목록 창 아래에는 패키지 세부 정보 창이 표시됩니다. <xref linkend="package-version"/> 참조
zh_hk: 套裝軟體清單窗格下方是套裝軟體詳細資訊窗格。請參閱 <xref linkend="package-version"/>。

source: Managing Packages
de: Verwalten von Paketen
es: Gestión de paquetes
ja: パッケージの管理
ko: 패키지 관리
zh_hk: 管理套裝軟體

source: You can list packages according to various criteria. You can install, update, and remove packages.
de: Sie können Pakete nach unterschiedlichen Kriterien aufführen. Sie können Pakete installieren, aktualisieren und entfernen.
es: Puede mostrar paquetes según distintos criterios. Puede instalar, actualizar y eliminar paquetes.
ja: さまざまな条件に従ってパッケージを一覧表示できます。パッケージのインストール、更新、および削除を行うことができます。
ko: 다양한 조건에 따라 패키지를 나열할 수 있으며, 패키지를 설치, 업데이트 및 제거할 수 있습니다.
zh_hk: 您可以依據各種條件列出套裝軟體，也可以安裝、更新及移除套裝軟體。

source: Listing Packages
de: Aufführen von Paketen
es: Mostrar paquetes
ja: パッケージの一覧表示
ko: 패키지 나열
zh_hk: 列出套裝軟體

source: The list of packages in the Package Manager list pane is affected by the selections you make in the <guimenu>Publisher</guimenu> drop-down menu, the <guimenu>View</guimenu> drop-down menu, the categories pane, and the Search field.
de: Die Liste der Pakete im entsprechenden Package Manager-Listenbereich hängt von den der getroffenen Auswahl in den Dropdown-Menüs <guimenu>Herausgeber</guimenu> und <guimenu>Ansicht</guimenu> sowie von der Auswahl im Kategoriebereich und im Suchfeld ab.
es: La lista de paquetes en el panel de la lista de Package Manager se modifica según las selecciones realizadas en el menú desplegable <guimenu>Editor</guimenu>, el menú desplegable <guimenu>Ver</guimenu>, el panel de categorías y el campo Buscar.
ja: パッケージマネージャーのリスト区画に表示されるパッケージのリストは、<guimenu>「発行元」</guimenu>ドロップダウンメニュー、<guimenu>「表示」</guimenu>ドロップダウンメニュー、カテゴリ区画、および「検索」フィールドで選択した内容に影響されます。
ko: 패키지 관리자 목록 창의 패키지 목록은 <guimenu>게시자</guimenu> 드롭다운 메뉴, <guimenu>보기</guimenu> 드롭다운 메뉴, 범주 창 및 검색 필드에서 선택한 내용에 따라 달라집니다.
zh_hk: 套裝軟體管理員清單窗格中顯示的套裝軟體清單會依照您在 [<guimenu>發佈者</guimenu>] 下拉式功能表、[<guimenu>檢視</guimenu>] 下拉式功能表、類別窗格與 [搜尋] 欄位中所做的選擇而有所不同。

source: You can reorder the package list by clicking the column headings.
de: Sie können die Paketliste neu sortieren, indem Sie auf die Spaltenüberschriften klicken.
es: Puede reordenar la lista de paquetes haciendo clic en los encabezados de las columnas.
ja: 列見出しをクリックしてパッケージリストの順序を変更できます。
ko: 열 제목을 눌러 패키지 목록의 순서를 재지정할 수 있습니다.
zh_hk: 您可以按一下資料欄標題來重新排序套裝軟體清單。

source: You can use the <guibutton>Refresh</guibutton> button or the <menuchoice><guimenu>Package</guimenu><guimenuitem>Refresh</guimenuitem></menuchoice> menu option to reread repository catalogs and update the list of packages and package status. A refresh also is attempted whenever you open Package Manager.
de: Sie können die Schaltfläche <guibutton>Aktualisieren</guibutton> oder die Menüoption <menuchoice><guimenu>Paket</guimenu><guimenuitem>Aktualisieren</guimenuitem></menuchoice> verwenden, um die Repository-Kataloge neu zu lesen und die Liste der Pakete sowie Paketstatus zu aktualisieren. Die Aktualisierung erfolgt auch immer beim Öffnen des Package Manager.
es: Puede utilizar el botón <guibutton>Refrescar</guibutton> o la opción de menú <menuchoice><guimenu>Refrescar</guimenu><guimenuitem>paquete</guimenuitem></menuchoice> para releer los catálogos de depósito y actualizar la lista de paquetes y estados de paquetes. También se intenta realizar un refrescamiento cuando abre Package Manager.
ja: <guibutton>「更新」</guibutton>ボタンまたは<menuchoice><guimenu>「パッケージ」</guimenu><guimenuitem>「更新」</guimenuitem></menuchoice>メニューオプションを使用して、リポジトリカタログを再度読み込み、パッケージとパッケージ状態のリストを更新することができます。パッケージマネージャーを開いたときにも毎回更新が試みられます。
ko: <guibutton>새로 고침</guibutton> 버튼 또는 <menuchoice><guimenu>패키지</guimenu><guimenuitem>새로 고침</guimenuitem></menuchoice> 메뉴 옵션을 사용하여 저장소 카탈로그를 다시 읽고 패키지 목록 및 패키지 상태를 업데이트할 수 있습니다. 또한 새로 고침은 패키지 관리자를 열 때마다 시도됩니다.
zh_hk: 您可以使用 [<guibutton>重新整理</guibutton>] 按鈕或 <menuchoice>[<guimenu>套裝軟體</guimenu>] [<guimenuitem>重新整理</guimenuitem>]</menuchoice> 功能表選項來重新讀取儲存庫目錄，以及更新套裝軟體清單與套裝軟體狀態。只要開啟套裝軟體管理員，就會嘗試執行重新整理。

source: By Publisher
de: Nach Herausgeber
es: Por editor
ja: 発行元別
ko: 게시자별
zh_hk: 依發佈者

source: The <guimenu>Publisher</guimenu> drop-down menu enables you to list packages according to publisher.
de: Über das Dropdown-Menü <guimenu>Herausgeber</guimenu> können Sie die Pakete in Abhängigkeit der jeweiligen Herausgeber aufführen.
es: El menú desplegable <guimenu>Editor</guimenu> le permite mostrar paquetes según el editor.
ja: <guimenu>「発行元」</guimenu> ドロップダウンメニューを使用すると、発行元に基づいてパッケージを一覧表示できます。
ko: <guimenu>게시자</guimenu> 드롭다운 메뉴를 통해 게시자에 따라 패키지를 나열할 수 있습니다.
zh_hk: [<guimenu>發佈者</guimenu>] 下拉式功能表可讓您依照發佈者列出套裝軟體。

source: The top of the menu lists the name of each publisher that you have added using the Add Publisher dialog or using the <literal>pkg</literal> command. When you select one of these publishers, the package list pane shows only packages that are available from that selected publisher. The package list pane shows only the Name, Status, and Summary columns because the publisher is the same for every package.
de: Im oberen Bereich des Menüs sind die Namen der Herausgeber aufgeführt, die Sie über das Dialogfeld "Herausgeber hinzufügen" oder mithilfe des Befehls <literal>pkg</literal> hinzugefügt haben. Wenn Sie einen dieser Herausgeber auswählen, werden im Paketlistenbereich nur die Pakete aufgeführt, die vom ausgewählten Herausgeber verfügbar sind. Im Paketlistenbereich werden nur die Spalten "Name", "Status" und "Zusammenfassung" angezeigt, weil der Herausgeber bei allen Paketen der gleiche ist.
es: La parte superior del menú muestra el nombre de cada editor agregado mediante el cuadro de diálogo Agregar editor o mediante el comando <literal>pkg</literal>. Cuando selecciona uno de estos editores, el panel de la lista de paquetes muestra solamente los paquetes que están disponibles de ese editor seleccionado. El panel de la lista de paquetes muestra solamente las columnas Nombre, Estado y Resumen porque el editor es el mismo para todos los paquetes.
ja: メニューの上部には、「発行元を追加」ダイアログまたは <literal>pkg</literal> コマンドを使用して追加した各発行元の名前が表示されます。これらの発行元の 1 つを選択すると、その発行元から利用できるパッケージだけがパッケージリスト区画に表示されます。発行元はどのパッケージについても同じなので、パッケージリスト区画には「名前」、「状態」、および「概要」列だけが表示されます。
ko: 메뉴 위쪽에는 게시자 추가 대화 상자를 사용하거나 <literal>pkg</literal> 명령을 사용하여 추가한 각 게시자의 이름이 나열됩니다. 해당 게시자 중 하나를 선택하면 선택한 해당 게시자로부터 사용 가능한 패키지만 패키지 목록 창에 표시됩니다. 이 경우 모든 패키지에 대한 게시자가 동일하므로 패키지 목록 창에는 이름, 상태 및 요약 열만 표시됩니다.
zh_hk: 功能表頂端會列出您使用 [增加發佈者] 對話方塊或 <literal>pkg</literal> 指令新增的每個發佈者名稱。選取其中一個發佈者後，套裝軟體清單窗格就只會顯示該所選發佈者可使用的套裝軟體。套裝軟體清單窗格只會顯示 [名稱]、[狀態] 及 [摘要] 資料欄，因為每個套裝軟體的發佈者都相同。

source: <guimenuitem>All Publishers</guimenuitem> — Shows packages from all publishers in the package list pane. The package list pane shows columns Name, Status, Publisher, and Summary.
de: <guimenuitem>Alle Herausgeber</guimenuitem> – Zeigt im Paketlistenbereich alle Herausgeber an. Im Paketlistenbereich werden die Spalten "Name", "Status", "Herausgeber" und "Zusammenfassung" angezeigt.
es: <guimenuitem>Todos los editores</guimenuitem>: muestra los paquetes de todos los editores en el panel de la lista de paquetes. El panel de la lista de paquetes muestra las columnas Nombre, Estado, Editor y Resumen.
ja: <guimenuitem>「すべての発行元」</guimenuitem> — すべての発行元のパッケージをパッケージリスト区画に表示します。パッケージリスト区画には「名前」、「状態」、「発行元」、および「概要」列が表示されます。
ko: <guimenuitem>모든 게시자</guimenuitem> — 패키지 목록 창에 모든 게시자의 패키지를 표시합니다. 패키지 목록 창에는 이름, 상태, 게시자 및 요약 열이 표시됩니다.
zh_hk: <guimenuitem>所有發佈者</guimenuitem> — 在套裝軟體清單窗格中顯示所有發佈者的套裝軟體。套裝軟體清單窗格會顯示 [名稱]、[狀態]、[發佈者] 及 [摘要] 資料欄。

source: Example: To list all media device drivers that have updates available from all publishers, select <guimenuitem>All Publishers</guimenuitem> from the <guimenu>Publisher</guimenu> menu, select the <menuchoice><guimenu>Drivers</guimenu><guimenuitem>Media</guimenuitem></menuchoice> category, and select <guimenuitem>Updates</guimenuitem> from the <guimenu>View</guimenu> menu.
de: Beispiel: Wählen Sie zum Aufführen aller Mediengerätetreiber, für die Updates von allen Herausgebern verfügbar sind, im Menü <guimenu>Herausgeber</guimenu> die Option <guimenuitem>Alle Herausgeber</guimenuitem>. Wählen Sie dann die Kategorie <menuchoice><guimenu>Treiber</guimenu><guimenuitem>Medien</guimenuitem></menuchoice> und im Menü <guimenu>Ansicht</guimenu> die Option <guimenuitem>Updates</guimenuitem>.
es: Ejemplo: Para mostrar todos los controladores de dispositivos de medios que tienen actualizaciones disponibles de todos los editores, seleccione <guimenuitem>Todos los editores</guimenuitem> del menú <guimenu>Editor</guimenu>; luego, seleccione la categoría <menuchoice><guimenu>Medios</guimenu><guimenuitem>de controladores</guimenuitem></menuchoice> y <guimenuitem>Actualizaciones</guimenuitem> del menú <guimenu>Ver</guimenu>.
ja: 例: すべての発行元のメディアデバイスドライバで、使用可能な更新が存在するものをすべて表示するには、<guimenu>「発行元」</guimenu>メニューから<guimenuitem>「すべての発行元」</guimenuitem>を選択し、<menuchoice><guimenu>「ドライバ」</guimenu><guimenuitem>「メディア」</guimenuitem></menuchoice>カテゴリを選択し、<guimenu>「表示」</guimenu>メニューから<guimenuitem>「更新」</guimenuitem>を選択します。
ko: 예: 모든 게시자로부터 업데이트를 사용할 수 있는 매체 장치 드라이버를 모두 나열하려면 <guimenu>게시자</guimenu> 메뉴에서 <guimenuitem>모든 게시자</guimenuitem>를 선택하고 <menuchoice><guimenu>드라이버</guimenu><guimenuitem>매체</guimenuitem></menuchoice> 범주를 선택한 다음 <guimenu>보기</guimenu> 메뉴에서 <guimenuitem>업데이트</guimenuitem>를 선택합니다.
zh_hk: 範例：若要列出可從所有發佈者取得可用更新的所有媒體裝置驅動程式，請從 [<guimenu>發佈者</guimenu>] 功能表選取 [<guimenuitem>所有發佈者</guimenuitem>]，選取 <menuchoice>[<guimenu>驅動程式</guimenu>] [<guimenuitem>媒體</guimenuitem>]</menuchoice> 類別，然後從 [<guimenu>檢視</guimenu>] 功能表選取 [<guimenuitem>更新</guimenuitem>]。

source: <guimenuitem>All Installed Packages</guimenuitem> — Shows all packages that are installed from all publishers.
de: <guimenuitem>Alle installierten Pakete</guimenuitem> – Zeigt alle Pakete an, die von allen Herausgebern installiert sind.
es: <guimenuitem>Todos los paquetes instalados</guimenuitem>: muestra todos los paquetes que están instalados de todos los editores.
ja: <guimenuitem>「すべてのインストール済みパッケージ」</guimenuitem> — すべての発行元からインストールしたすべてのパッケージを表示します。
ko: <guimenuitem>설치된 모든 패키지</guimenuitem> — 모든 게시자로부터 설치된 패키지를 모두 표시합니다.
zh_hk: <guimenuitem>所有已安裝的套裝軟體</guimenuitem> — 顯示已從所有發佈者安裝的所有套裝軟體。

source: Example: To list all the font packages that are currently installed from the <literal>solaris</literal> publisher, select <guimenuitem>All Installed Packages</guimenuitem> from the <guimenu>Publisher</guimenu> menu, select the <menuchoice><guimenu>System</guimenu><guimenuitem>Fonts</guimenuitem></menuchoice> category, click on the Publisher column heading to sort the list by Publisher, and scroll down to the <literal>solaris</literal> entries.
de: Beispiel: Wählen Sie zum Aufführen aller Schriftartenpakete vom Herausgeber <literal>solaris</literal> die Option <guimenuitem>Alle installierten Pakete</guimenuitem> des Menüs <guimenu>Herausgeber</guimenu>. Wählen Sie die Kategorie <menuchoice><guimenu>System</guimenu><guimenuitem>Schriftarten</guimenuitem></menuchoice>, klicken Sie zum Sortieren der Liste nach Herausgeber auf die Spaltenüberschrift "Herausgeber" und scrollen Sie zu den <literal>solaris</literal>-Einträgen.
es: Ejemplo: Para mostrar todos los paquetes de tipos de letra que están actualmente instalados del editor <literal>solaris</literal>, seleccione <guimenuitem>Todos los paquetes instalados</guimenuitem> del menú <guimenu>Editor</guimenu>; luego, seleccione la categoría <menuchoice><guimenu>Sistema</guimenu><guimenuitem>Tipos de letra</guimenuitem></menuchoice>, haga clic en el encabezado de la columna Editor para ordenar la lista por Editor y desplácese hacia abajo hasta las entradas <literal>solaris</literal>.
ja: 例: <literal>solaris</literal> 発行元のフォントパッケージで、現在インストールされているものをすべて表示するには、<guimenu>「発行元」</guimenu>メニューから<guimenuitem>「すべてのインストール済みパッケージ」</guimenuitem>を選択し、<menuchoice><guimenu>「システム」</guimenu><guimenuitem>「フォント」</guimenuitem></menuchoice>カテゴリを選択し、「発行元」列見出しをクリックしてリストを発行元別にソートし、<literal>solaris</literal> エントリまで下へスクロールします。
ko: 예: 현재 <literal>solaris</literal> 게시자로부터 설치된 글꼴 패키지를 모두 나열하려면 <guimenu>게시자</guimenu> 메뉴에서 <guimenuitem>설치된 모든 패키지</guimenuitem>를 선택하고 <menuchoice><guimenu>시스템</guimenu><guimenuitem>글꼴</guimenuitem></menuchoice> 범주를 선택한 다음 게시자 열 제목을 눌러 목록을 게시자별로 정렬하고 <literal>solaris</literal> 항목이 표시될 때까지 아래로 스크롤합니다.
zh_hk: 範例：若要列出目前已從 <literal>solaris</literal> 發佈者安裝的字型套裝軟體，請從 [<guimenu>發佈者</guimenu>] 功能表選取 [<guimenuitem>所有已安裝的套裝軟體</guimenuitem>]，選取 <menuchoice>[<guimenu>系統</guimenu>] [<guimenuitem>字型</guimenuitem>]</menuchoice> 類別，按一下 [發佈者] 資料欄標題以依照發佈者排序清單，然後向下捲動至 <literal>solaris</literal> 項目。
