Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: A publisher that is disabled is not searched for updates or for packages to install. Catalogs of a disabled publisher are not refreshed. A disabled publisher is not shown on the <guimenu>Publisher</guimenu> drop-down menu.
de: Ein deaktivierter Herausgeber wird nicht auf Updates oder Pakete zum Installieren durchsucht. Kataloge eines deaktivierten Herausgebers werden nicht aktualisiert. Der deaktivierte Herausgeber wird nicht im Dropdown-Menü <guimenu>Herausgeber</guimenu> angezeigt.
es: No se buscan actualizaciones ni paquetes para instalar con relación a un editor inhabilitado. Los catálogos de un editor inhabilitado no se refrescan. Un editor inhabilitado no se muestra en el menú desplegable <guimenu>Editor</guimenu>.
ja: インストールするパッケージまたは更新を検索するとき、無効になっている発行元は検索対象になりません。無効になっている発行元のカタログは更新されません。無効になっている発行元は<guimenu>「発行元」</guimenu>ドロップダウンメニューに表示されません。
ko: 사용 안함으로 설정된 게시자는 업데이트 또는 설치할 패키지를 위해 검색되지 않으며, 사용 안함으로 설정된 게시자의 카탈로그는 새로 고쳐지지 않습니다. 사용 안함으로 설정된 게시자는 <guimenu>게시자</guimenu> 드롭다운 메뉴에 표시되지 않습니다.
zh_hk: 不會搜尋停用的發佈者進行更新或安裝套裝軟體。不會重新整理停用的發佈者目錄。[<guimenu>發佈者</guimenu>] 下拉式功能表不會顯示停用的發佈者。

source: To change the Enabled and Sticky settings for a publisher, perform the following steps:
de: Führen Sie zum Ändern der Einstellungen "Aktiviert" und "Sticky" die folgenden Schritte aus:
es: Para cambiar las configuraciones habilitadas y permanentes de un editor, realice los siguientes pasos:
ja: 発行元の「有効」設定または「固定的」設定を変更するには、次の手順を実行します。
ko: 게시자에 대한 사용 및 고정 설정을 변경하려면 다음 단계를 수행합니다.
zh_hk: 若要變更發佈者的已啟用和固定設定，請執行下列步驟：

source: Select the <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Publishers</guimenuitem></menuchoice> menu option to open the Manage Publishers window.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Datei</guimenu><guimenuitem>Herausgeber verwalten</guimenuitem></menuchoice>, um das Fenster "Herausgeber verwalten" zu öffnen.
es: Seleccione la opción de menú <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Administrar editores</guimenuitem></menuchoice> para abrir la ventana Administrar editores.
ja: <menuchoice><guimenu>「ファイル」</guimenu><guimenuitem>「発行元の管理」</guimenuitem></menuchoice>メニューオプションを選択して「発行元の管理」ウィンドウを開きます。
ko: <menuchoice><guimenu>파일</guimenu><guimenuitem>게시자 관리</guimenuitem></menuchoice> 메뉴 옵션을 선택하여 게시자 관리 창을 엽니다.
zh_hk: 選取 <menuchoice>[<guimenu>檔案</guimenu>] [<guimenuitem>管理發佈者</guimenuitem>]</menuchoice> 功能表選項，以開啟 [管理發佈者] 視窗。

source: Click an Enabled box or a Sticky box to toggle its setting.
de: Klicken Sie auf die Kontrollkästchen "Aktiviert" oder "Sticky", um diese Einstellungen auszuwählen bzw. die Auswahl aufzuheben.
es: Haga clic en el cuadro Habilitado o en el cuadro Permanente para activar/desactivar su configuración.
ja: 「有効」ボックスまたは「固定的」ボックスをクリックして、それぞれの設定を切り替えます。
ko: 사용 상자 또는 고정 상자를 눌러 설정을 토글합니다.
zh_hk: 按一下 [已啟用] 方塊或 [固定] 方塊以切換其設定。

source: Changing Alias, Origins, and Mirrors
de: Ändern des Alias, der Ursprünge und Spiegel
es: Cambio de alias, orígenes y reflejos
ja: 別名、起点、およびミラーの変更
ko: 별칭, 원본 및 미러 변경
zh_hk: 變更別名、原始和鏡像

source: Select the publisher you want to modify. The Details pane below the publisher list in the Manage Publishers window displays the current origins for the selected publisher.
de: Wählen Sie den Herausgeber aus, den Sie ändern möchten. Im Bereich "Details" unter der Herausgeberliste im Fenster "Herausgeber verwalten" werden die aktuellen Ursprünge des ausgewählten Herausgebers angezeigt.
es: Seleccione el editor que desea modificar. El panel Detalles debajo de la lista de editores en la ventana Administrar editores muestra los orígenes actuales del editor seleccionado.
ja: 変更する発行元を選択します。「発行元の管理」ウィンドウの発行元リストの下にある「詳細」区画に、選択した発行元の現在の起点が表示されます。
ko: 수정할 게시자를 선택합니다. 게시자 관리 창에서 게시자 목록 아래의 세부 정보 창에 선택된 게시자에 대한 현재 원본이 표시됩니다.
zh_hk: 選取您要修改的發佈者。[詳細資訊] 窗格 (位於 [管理發佈者] 視窗的發佈者清單下方) 會顯示所選發佈者的目前原始。

source: Click the <guibutton>Modify</guibutton> button to the right of the publisher list to open the Modify Publisher window.
de: Klicken Sie rechts neben der Herausgeberliste auf die Schaltfläche <guibutton>Ändern</guibutton>, um das Fenster "Herausgeber ändern" zu öffnen.
es: Haga clic en el botón <guibutton>Modificar</guibutton> que se encuentra a la derecha de la lista de editores para abrir la ventana Modificar editor.
ja: 発行元リストの右にある<guibutton>「変更」</guibutton>ボタンをクリックして「発行元の変更」ウィンドウを開きます。
ko: 게시자 목록 오른쪽에 있는 <guibutton>수정</guibutton> 버튼을 눌러 게시자 수정 창을 엽니다.
zh_hk: 按一下發佈者清單右方的 [<guibutton>修改</guibutton>] 按鈕，以開啟 [修改發佈者] 視窗。

source: If the selected publisher is a system publisher, the <guibutton>Modify</guibutton> button is disabled. The Details pane indicates that the selected publisher is a system publisher and displays a message that this publisher cannot be modified or removed.
de: Wenn der ausgewählte Herausgeber ein Systemherausgeber ist, ist die Schaltfläche <guibutton>Ändern</guibutton> deaktiviert. Im Bereich "Details" wird angezeigt, dass der ausgewählte Herausgeber ein Systemherausgeber ist. Eine Meldung wird angezeigt, die Sie informiert, dass dieser Herausgeber nicht geändert oder entfernt werden kann.
es: Si el editor seleccionado es un editor del sistema, el botón <guibutton>Modificar</guibutton> está inhabilitado. El panel Detalles indica que el editor seleccionado es un editor del sistema y muestra un mensaje que establece que este editor no se puede modificar ni eliminar.
ja: 選択した発行元がシステム発行元の場合、<guibutton>「変更」</guibutton>ボタンは使用不可になります。「詳細」区画には、選択した発行元がシステム発行元であることが示され、この発行元の変更や削除を行うことはできないというメッセージが表示されます。
ko: 선택된 게시자가 시스템 게시자일 경우 <guibutton>수정</guibutton> 버튼이 사용 안함으로 설정됩니다. 세부 정보 창에 선택된 게시자가 시스템 게시자인 것으로 나타나며 이 게시자를 수정 또는 제거할 수 없음을 알리는 메시지가 표시됩니다.
zh_hk: 如果所選的發佈者是系統發佈者，則會停用 [<guibutton>修改</guibutton>] 按鈕。[詳細資訊] 窗格會指出所選的發佈者為系統發佈者，並顯示無法修改或移除此發佈者的訊息。

source: Select the General tab to modify the publisher alias, add and remove origins, and add and remove mirrors.
de: Wählen Sie die Registerkarte "Allgemein", um den Herausgeber-Alias zu ändern und Ursprünge sowie Spiegel hinzuzufügen und zu entfernen.
es: Seleccione la ficha General para modificar el alias de editor, agregar y eliminar orígenes y agregar y eliminar reflejos.
ja: 発行元の別名の変更、起点の追加または削除、およびミラーの追加または削除を行うには、「一般」タブを選択します。
ko: 일반 탭을 선택하여 게시자 별칭을 수정하고, 원본을 추가 및 제거하고, 미러를 추가 및 제거합니다.
zh_hk: 選取 [一般] 標籤修改發佈者別名、增加和移除原始，以及增加和移除鏡像。

source: Publisher Alias
de: Herausgeber-Alias
es: Alias de editor
ja: 発行元の別名
ko: 게시자 별칭
zh_hk: 發佈者別名

source: The publisher alias is another name for the publisher. The alias name is used in the <guimenu>Publisher</guimenu> drop-down menu and in the package list pane.
de: Der Herausgeber-Alias ist ein anderer Name des Herausgebers. Der Aliasname wird im Dropdown-Menü <guimenu>Herausgeber</guimenu> und im Paketlistenbereich verwendet.
es: El alias de editor es otro nombre para el editor. El nombre de alias se utiliza en el menú desplegable <guimenu>Editor</guimenu> y en el panel de la lista de paquetes.
ja: 発行元の別名は、発行元の別の名前です。別名は<guimenu>「発行元」</guimenu>ドロップダウンメニューとパッケージリスト区画で使用されます。
ko: 게시자 별칭은 게시자의 다른 이름입니다. 별칭 이름은 <guimenu>게시자</guimenu> 드롭다운 메뉴와 패키지 목록 창에서 사용됩니다.
zh_hk: 發佈者別名是發佈者的另一個名稱。別名名稱用於 [<guimenu>發佈者</guimenu>] 下拉式功能表和套裝軟體清單窗格。

source: To change the alias of this publisher, perform the following steps:
de: Führen Sie zum Ändern des Alias dieses Herausgebers die folgenden Schritte aus:
es: Para cambiar el alias de este editor, realice los siguientes pasos:
ja: この発行元の別名を変更するには、次の手順を実行します。
ko: 이 게시자의 별칭을 변경하려면 다음 단계를 수행합니다.
zh_hk: 若要變更此發佈者的別名，請執行下列步驟：

source: On the General tab of the Modify Publisher window, enter a new name in the Alias field.
de: Geben Sie im Fenster "Herausgeber ändern" auf der Registerkarte "Allgemein" einen neuen Namen in das Feld "Alias" ein.
es: En la ficha General de la ventana Modificar editor, introduzca un nombre nuevo en el campo Alias.
ja: 「発行元の変更」ウィンドウの「一般」タブで、「別名」フィールドに新しい名前を入力します。
ko: 게시자 수정 창의 일반 탭에서 별칭 필드에 새 이름을 입력합니다.
zh_hk: 在 [修改發佈者] 視窗的 [一般] 標籤上，於 [別名] 欄位中輸入新名稱。

source: Click the <guibutton>OK</guibutton> button at the bottom of the Modify Publisher window.
de: Klicken Sie im unteren Bereich des Fensters "Herausgeber ändern" auf die Schaltfläche <guibutton>OK</guibutton>.
es: Haga clic en el botón <guibutton>Aceptar</guibutton> que se encuentra en la parte inferior de la ventana Modificar editor.
ja: 「発行元の変更」ウィンドウ下部の<guibutton>「了解」</guibutton>ボタンをクリックします。
ko: 게시자 수정 창 아래쪽에 있는 <guibutton>확인</guibutton> 버튼을 누릅니다.
zh_hk: 按一下 [修改發佈者] 視窗底部的 [<guibutton>確定</guibutton>] 按鈕。

source: The publisher alias has changed in the Manage Publishers window. Click the <guibutton>OK</guibutton> button at the bottom of the Manage Publishers window.
de: Im Fenster "Herausgeber verwalten" wird der Herausgeber-Alias geändert. Klicken Sie im unteren Bereich des Fensters "Herausgeber verwalten" auf die Schaltfläche <guibutton>OK</guibutton>.
es: El alias de editor ha cambiado en la ventana Administrar editores. Haga clic en el botón <guibutton>Aceptar</guibutton> que se encuentra en la parte inferior de la ventana Administrar editores.
ja: 「発行元の管理」ウィンドウで発行元の別名が変更されます。「発行元の管理」ウィンドウ下部の<guibutton>「了解」</guibutton>ボタンをクリックします。
ko: 게시자 별칭이 게시자 관리 창에서 변경되었습니다. 게시자 관리 창 아래쪽에 있는 <guibutton>확인</guibutton> 버튼을 누릅니다.
zh_hk: [管理發佈者] 視窗中的發佈者別名已變更。按一下 [管理發佈者] 視窗底部的 [<guibutton>確定</guibutton>] 按鈕。

source: Publisher Origins
de: Herausgeberursprünge
es: Orígenes de editor
ja: 発行元の起点
ko: 게시자 원본
zh_hk: 發佈者原始

source: An origin is the location of an IPS package repository or archive that contains both package metadata (package manifests and catalogs) and package content (package files).
de: Ein Ursprung ist der Speicherort eines IPS-Paket-Repository oder -Archivs, in dem beide Paket-Metadatentypen (Paketmanifeste und -kataloge) und der Paketinhalt (Paketdateien) enthalten sind.
es: Un origen es la ubicación de un contenedor o depósito de paquetes IPS que contiene metadatos de paquete (manifiestos y catálogos de paquete) y contenido de paquete (archivos de paquete).
ja: 起点は、パッケージのメタデータ (パッケージのマニフェストとカタログ) とパッケージの内容 (パッケージファイル) の両方を含む IPS パッケージリポジトリまたはアーカイブの場所です。
ko: 원본은 패키지 메타 데이터(패키지 매니페스트 및 카탈로그)와 패키지 내용(패키지 파일)을 모두 포함하는 IPS 패키지 저장소 또는 아카이브의 위치입니다.
zh_hk: 原始是 IPS 套裝軟體儲存庫的位置，或是包含套裝軟體中介資料 (套裝軟體清單和目錄) 以及套裝軟體內容 (套裝軟體檔案) 的歸檔。

source: An origin value is the URI of an IPS package repository.
de: Ein Ursprungswert ist die URI eines IPS-Paket-Repository.
es: Un valor de origen es el URI de un depósito de paquetes IPS.
ja: 起点の値は、IPS パッケージリポジトリの URI です。
ko: 원본 값은 IPS 패키지 저장소의 URI입니다.
zh_hk: 原始值是 IPS 套裝軟體儲存庫的 URI。

source: To change, add, or remove an origin for this publisher, perform the following steps:
de: Führen Sie zum Ändern, Hinzufügen oder Entfernen eines Ursprungs für diesen Herausgeber die folgenden Schritte aus:
es: Para cambiar, agregar o eliminar un origen de este editor, realice los siguientes pasos:
ja: この発行元の起点を変更、追加、または削除するには、次の手順を実行します。
ko: 이 게시자의 원본을 변경, 추가 또는 제거하려면 다음 단계를 수행합니다.
zh_hk: 若要變更、增加或移除此發佈者的原始，請執行下列步驟：

source: Select the General tab of the Modify Publisher window.
de: Wählen Sie im Fenster "Herausgeber ändern" die Registerkarte "Allgemein".
es: Seleccione la ficha General de la ventana Modificar editor.
ja: 「発行元の変更」ウィンドウの「一般」タブを選択します。
ko: 게시자 수정 창의 일반 탭을 선택합니다.
zh_hk: 選取 [修改發佈者] 視窗中的 [一般] 標籤。

source: Add an origin.
de: Fügen Sie einen Ursprung hinzu.
es: Agregue un origen.
ja: 起点を追加します。
ko: 원본을 추가합니다.
zh_hk: 增加原始。

source: In the Origin field, enter the URI of the new origin you want to associate with this publisher.
de: Geben Sie in das Feld "Ursprung" die URI des neuen Ursprungs ein, den Sie mit diesem Herausgeber verbinden möchten.
es: En el campo Origen, introduzca el URI del nuevo origen que desea asociar con este editor.
ja: この発行元に関連付ける新しい起点の URI を「起点」フィールドに入力します。
ko: 원본 필드에 이 게시자와 연결할 새 원본의 URI를 입력합니다.
zh_hk: 在 [原始] 欄位中，輸入您要與此發佈者建立關聯的新原始 URI。

source: Click the <guibutton>Add</guibutton> button. The new URI is added to the list below the Origin field.
de: Klicken Sie auf die Schaltfläche <guibutton>Hinzufügen</guibutton>. Die neue URI wird der Liste unterhalb des Felds "Ursprung" hinzugefügt.
es: Haga clic en el botón <guibutton>Agregar</guibutton>. El nuevo URI se agrega a la lista debajo del campo Origen.
ja: <guibutton>「追加」</guibutton>ボタンをクリックします。「起点」フィールドの下のリストに、新しい URI が追加されます。
ko: <guibutton>추가</guibutton> 버튼을 누릅니다. 그러면 새 URI가 원본 필드 아래의 목록에 추가됩니다.
zh_hk: 按一下 [<guibutton>增加</guibutton>] 按鈕。新的 URI 會新增至 [原始] 欄位下方的清單中。

source: Remove an origin.
de: Entfernen Sie einen Ursprung.
es: Elimine un origen.
ja: 起点を削除します。
ko: 원본을 제거합니다.
zh_hk: 移除原始。

source: In the list below the Origin field, select the URI you want to delete.
de: Wählen Sie in der Liste unter dem Feld "Ursprung" die URI aus, die Sie löschen möchten.
es: En la lista debajo del campo Origen, seleccione el URI que desea suprimir.
ja: 「起点」フィールドの下のリストで、削除する URI を選択します。
ko: 원본 필드 아래의 목록에서 삭제할 URI를 선택합니다.
zh_hk: 在 [原始] 欄位下方的清單中，選取您要刪除的 URI。

source: Click the <guibutton>Remove</guibutton> button. The selected URI is removed from the list. If only one origin is defined for this publisher, you cannot remove that origin.
de: Klicken Sie auf die Schaltfläche <guibutton>Entfernen</guibutton>. Die ausgewählte URI wird aus der Liste entfernt. Wenn für diesen Herausgeber nur ein Ursprung definiert ist, können Sie diesen Ursprung nicht entfernen.
es: Haga clic en el botón <guibutton>Eliminar</guibutton>. El URI seleccionado se elimina de la lista. Si se define un solo origen para este editor, no puede eliminarlo.
ja: <guibutton>「削除」</guibutton>ボタンをクリックします。選択した URI がリストから削除されます。この発行元に起点が 1 つだけ定義されている場合、その起点を削除することはできません。
ko: <guibutton>제거</guibutton> 버튼을 누릅니다. 그러면 선택된 URI가 목록에서 제거됩니다. 이 게시자에 대한 원본이 하나만 정의된 경우 해당 원본을 제거할 수 없습니다.
zh_hk: 按一下 [<guibutton>移除</guibutton>] 按鈕。所選的 URI 會從清單中移除。如果此發佈者只定義一個原始，則您無法移除該原始。

source: Change an origin.
de: Ändern Sie einen Ursprung.
es: Cambie un origen.
ja: 起点を変更します。
ko: 원본을 변경합니다.
zh_hk: 變更原始。

source: Add the new origin.
de: Fügen Sie diesen neuen Ursprung hinzu.
es: Agregue el origen nuevo.
ja: 新しい起点を追加します。
ko: 새 원본을 추가합니다.
zh_hk: 新增原始。

source: Delete the origin you want to change.
de: Löschen Sie den Ursprung, den Sie ändern möchten.
es: Suprima el origen que desea cambiar.
ja: 変更する起点を削除します。
ko: 변경할 원본을 삭제합니다.
zh_hk: 刪除您要變更的原始。

source: The origin changes are reflected in the Details pane in the Manage Publishers window. Click the <guibutton>OK</guibutton> button at the bottom of the Manage Publishers window.
de: Die Ursprungsänderungen werden im Fenster "Herausgeber verwalten" im Bereich "Details" angezeigt. Klicken Sie im unteren Bereich des Fensters "Herausgeber verwalten" auf die Schaltfläche <guibutton>OK</guibutton>.
es: Los cambios de origen se ven reflejados en el panel Detalles de la ventana Administrar editores. Haga clic en el botón <guibutton>Aceptar</guibutton> que se encuentra en la parte inferior de la ventana Administrar editores.
ja: 起点の変更が「発行元の管理」ウィンドウの「詳細」区画に反映されます。「発行元の管理」ウィンドウ下部の<guibutton>「了解」</guibutton>ボタンをクリックします。
ko: 원본 변경 사항이 게시자 관리 창의 세부 정보 창에 반영됩니다. 게시자 관리 창 아래쪽에 있는 <guibutton>확인</guibutton> 버튼을 누릅니다.
zh_hk: 原始的變更會反映在 [管理發佈者] 視窗的 [詳細資訊] 窗格中。按一下 [管理發佈者] 視窗底部的 [<guibutton>確定</guibutton>] 按鈕。

source: Publisher Mirrors
de: Herausgeberspiegel
es: Reflejos de editor
ja: 発行元のミラー
ko: 게시자 미러
zh_hk: 發佈者鏡像

source: A mirror is a location of an IPS package repository that contains only package content (package files). A mirror does not contain package metadata (package manifests and catalogs). Mirrors provide a subset of the data that origins provide. Mirrors can be used only for downloading package files. Package metadata is downloaded from the origin. IPS clients access the origin to obtain a publisher's catalog, even when the clients download package content from a mirror.
de: Ein Spiegel ist ein Speicherort eines IPS-Paket-Repository, das nur den Paketinhalt (Paketdateien) enthält. Ein Spiegel enthält keine Paketmetadaten (Paketmanifeste und Kataloge). Spiegel stellen eine Teil der Daten bereit, die an einem Ursprung zur Verfügung gestellt werden. Spiegel können nur zum Herunterladen von Paketdateien verwendet werden. Paketmetadaten werden vom Ursprung heruntergeladen. IPS-Clients greifen auf den Ursprung zu, um den Katalog eines Herausgeber zu holen, sogar wenn die Clients den Paketinhalt von einem Spiegel herunterladen.
es: Un reflejo es una ubicación de un depósito de paquetes IPS que sólo tiene contenido de paquete (archivos de paquete). Un reflejo no contiene metadatos de paquete (manifiestos y catálogos de paquete). Los reflejos proporcionan un subconjunto de datos que proporcionan los orígenes. Los reflejos se pueden utilizar sólo para descargar archivos de paquete. Los metadatos de paquete se descargan del origen. Los clientes de IPS acceden al origen para obtener el catálogo de un editor, incluso cuando los clientes descargan contenido de paquete de un reflejo.
ja: ミラーは、パッケージの内容 (パッケージファイル) だけを含む IPS パッケージリポジトリの場所です。ミラーにパッケージのメタデータ (パッケージのマニフェストとカタログ) は含まれません。ミラーでは、起点で提供されているデータの一部が提供されます。ミラーはパッケージファイルのダウンロードにのみ使用できます。パッケージのメタデータは起点からダウンロードされます。IPS クライアントは、パッケージの内容をミラーからダウンロードする場合でも、発行元のカタログを取得するために起点にアクセスします。
ko: 미러는 패키지 내용(패키지 파일)만 포함하는 IPS 패키지 저장소의 위치입니다. 미러에는 패키지 메타 데이터(패키지 매니페스트 및 카탈로그)가 포함되지 않습니다. 미러는 원본이 제공하는 데이터 중 일부만 제공합니다. 미러는 패키지 파일 다운로드에만 사용할 수 있습니다. 패키지 메타 데이터는 원본에서 다운로드됩니다. IPS 클라이언트는 클라이언트가 미러에서 패키지 내용을 다운로드하는 경우에도 원본에 액세스하여 게시자의 카탈로그를 가져옵니다.
zh_hk: 鏡像是僅包含套裝軟體內容 (套裝軟體檔案) 的 IPS 套裝軟體儲存庫位置。鏡像不包含套裝軟體中介資料 (套裝軟體清單和目錄)。鏡像提供原始所提供的資料子集。鏡像只能用來下載套裝軟體檔案。套裝軟體中介資料是從原始下載。即使用戶端從鏡像下載套裝軟體內容，IPS 用戶端仍會存取原始以取得發佈者目錄。

source: To add, remove, or change a mirror for this publisher, perform the following steps:
de: Führen Sie zum Hinzufügen, Entfernen oder Ändern eines Spiegels für diesen Herausgeber die folgenden Schritte aus:
es: Para agregar, eliminar o cambiar un reflejo de este editor, realice los siguientes pasos:
ja: この発行元のミラーを追加、削除、または変更するには、次の手順を実行します。
ko: 이 게시자에 대한 미러를 추가, 제거 또는 변경하려면 다음 단계를 수행합니다.
zh_hk: 若要增加、移除或變更此發佈者的鏡像，請執行下列步驟：

source: Click the Mirrors label to display the Mirror field and the list of mirrors.
de: Klicken Sie auf die Beschriftung "Spiegel", um das Feld "Spiegel" und die Liste der Spiegel anzuzeigen.
es: Haga clic en la etiqueta Reflejos para visualizar el campo Reflejo y la lista de reflejos.
ja: 「ミラー」ラベルをクリックして、「ミラー」フィールドとミラーのリストを表示します。
ko: 미러 레이블을 눌러 미러 필드 및 미러 목록을 표시합니다.
zh_hk: 按一下 [鏡像] 標籤以顯示 [鏡像] 欄位和鏡像清單。

source: Add a mirror.
de: Fügen Sie einen Spiegel hinzu.
es: Agregue un reflejo.
ja: ミラーを追加します。
ko: 미러를 추가합니다.
zh_hk: 增加鏡像。

source: In the Mirror field, enter the URI of the new mirror you want to associate with this publisher.
de: Geben Sie in das Feld "Spiegel" die URI des neuen Spiegels ein, den Sie mit diesem Herausgeber verbinden möchten.
es: En el campo Reflejo, introduzca el URI del nuevo reflejo que desea asociar con este editor.
ja: この発行元に関連付ける新しいミラーの URI を「ミラー」フィールドに入力します。
ko: 미러 필드에 이 게시자와 연결할 새 미러의 URI를 입력합니다.
zh_hk: 在 [鏡像] 欄位中，輸入您要與此發佈者建立關聯的新鏡像 URI。

source: Click the <guibutton>Add</guibutton> button. The new URI is added to the list below the Mirror field.
de: Klicken Sie auf die Schaltfläche <guibutton>Hinzufügen</guibutton>. Die neue URI wird der Liste unterhalb des Felds "Spiegel" hinzugefügt.
es: Haga clic en el botón <guibutton>Agregar</guibutton>. El nuevo URI se agrega a la lista debajo del campo Reflejo.
ja: <guibutton>「追加」</guibutton>ボタンをクリックします。「ミラー」フィールドの下のリストに、新しい URI が追加されます。
ko: <guibutton>추가</guibutton> 버튼을 누릅니다. 그러면 새 URI가 미러 필드 아래의 목록에 추가됩니다.
zh_hk: 按一下 [<guibutton>增加</guibutton>] 按鈕。新的 URI 會新增至 [鏡像] 欄位下方的清單中。

source: Remove a mirror.
de: Entfernen Sie einen Spiegel.
es: Elimine un reflejo.
ja: ミラーを削除します。
ko: 미러를 제거합니다.
zh_hk: 移除鏡像。

source: In the list below the Mirror field, select the URI you want to delete.
de: Wählen Sie in der Liste unter dem Feld "Spiegel" die URI aus, die Sie löschen möchten.
es: En la lista debajo del campo Reflejo, seleccione el URI que desea suprimir.
ja: 「ミラー」フィールドの下のリストで、削除する URI を選択します。
ko: 미러 필드 아래의 목록에서 삭제할 URI를 선택합니다.
zh_hk: 在 [鏡像] 欄位下方的清單中，選取您要刪除的 URI。

source: Click the <guibutton>Remove</guibutton> button. The selected URI is removed from the list.
de: Klicken Sie auf die Schaltfläche <guibutton>Entfernen</guibutton>. Die ausgewählte URI wird aus der Liste entfernt.
es: Haga clic en el botón <guibutton>Eliminar</guibutton>. El URI seleccionado se elimina de la lista.
ja: <guibutton>「削除」</guibutton>ボタンをクリックします。選択した URI がリストから削除されます。
ko: <guibutton>제거</guibutton> 버튼을 누릅니다. 그러면 선택된 URI가 목록에서 제거됩니다.
zh_hk: 按一下 [<guibutton>移除</guibutton>] 按鈕。選取的 URI 便會從清單中移除。

source: Change a mirror.
de: Ändern Sie einen Spiegel.
es: Cambie un reflejo.
ja: ミラーを変更します。
ko: 미러를 변경합니다.
zh_hk: 變更鏡像。

source: Delete the mirror you want to change.
de: Löschen Sie den Spiegel, den Sie ändern möchten.
es: Suprima el reflejo que desea cambiar.
ja: 変更するミラーを削除します。
ko: 변경할 미러를 삭제합니다.
zh_hk: 刪除您要變更的鏡像。

source: Add a new mirror.
de: Fügen Sie einen neuen Spiegel hinzu.
es: Agregue un nuevo reflejo.
ja: 新しいミラーを追加します。
ko: 새 미러를 추가합니다.
zh_hk: 增加新鏡像。

source: Managing Publisher Security
de: Verwalten der Herausgebersicherheit
es: Gestión de seguridad del editor
ja: 発行元のセキュリティーの管理
ko: 게시자 보안 관리
zh_hk: 管理發佈者安全性

source: Certificates are used to verify that packages have been appropriately signed before being installed, depending on the signature policy of the image or the publisher, whichever is more restrictive.
de: Zertifikate dienen zur Gewährleistung, dass Pakete vor ihrer Installation entsprechend der Signaturrichtlinie des Abbilds oder Herausgebers (je nachdem, welche mehr einschränkt) signiert sind.
es: Los certificados se utilizan para verificar que los paquetes se hayan firmado correctamente antes de ser instalados, según la política de firmas de la imagen o del editor, el que sea más restrictivo.
ja: パッケージのインストールの前に、パッケージが適切に署名されているかどうかが証明書を使用して確認されます。この確認は、イメージまたは発行元の署名ポリシーのどちらか制限の厳しい方に基づきます。
ko: 인증서는 이미지 또는 게시자의 서명 정책 중 더 제한적인 서명 정책에 따라 패키지 설치 전 패키지가 적절히 서명되었는지 확인하는 데 사용됩니다.
zh_hk: 憑證可用來確認套裝軟體在安裝前已正確地簽名，判斷的方式取決於影像或發佈者的簽名策略 (以較嚴格的為準)。

source: Select the publisher whose security you want to modify.
de: Wählen Sie den Herausgeber, dessen Sicherheitseinstellung Sie ändern möchten.
es: Seleccione el editor cuya seguridad desea modificar.
ja: セキュリティーを変更する発行元を選択します。
ko: 보안을 수정할 게시자를 선택합니다.
zh_hk: 選取想要修改其安全性的發佈者。

source: Click the <guibutton>Modify</guibutton> button to the right of the publisher list to open the Modify Publisher window. The publisher that was selected in the Manage Publishers window is listed in the title of the Modify Publisher window.
de: Klicken Sie rechts neben der Herausgeberliste auf die Schaltfläche <guibutton>Ändern</guibutton>, um das Fenster "Herausgeber ändern" zu öffnen. Der Herausgeber, der im Fenster "Herausgeber verwalten" ausgewählt wurde, wird im Titel des Fensters "Herausgeber ändern" aufgeführt.
es: Haga clic en el botón <guibutton>Modificar</guibutton> que se encuentra a la derecha de la lista de editores para abrir la ventana Modificar editor. El editor que fue seleccionado en la ventana Administrar editores se muestra en el título de la ventana Modificar editor.
ja: 発行元リストの右にある<guibutton>「変更」</guibutton>ボタンをクリックして「発行元の変更」ウィンドウを開きます。「発行元の変更」ウィンドウのタイトルには、「発行元の管理」ウィンドウで選択されていた発行元が表示されます。
ko: 게시자 목록 오른쪽에 있는 <guibutton>수정</guibutton> 버튼을 눌러 게시자 수정 창을 엽니다. 그러면 게시자 관리 창에서 선택된 게시자가 게시자 수정 창 제목에 나열됩니다.
zh_hk: 按一下發佈者清單右方的 [<guibutton>修改</guibutton>] 按鈕，以開啟 [修改發佈者] 視窗。在 [管理發佈者] 視窗中所選取的發佈者會列在 [修改發佈者] 視窗標題中。

source: Select the General tab to add the SSL key and SSL certificate if a publisher has a secure origin.
de: Wählen Sie die Registerkarte "Allgemein", um den SSL-Schlüssel und das SSL-Zertifikat hinzuzufügen, wenn ein Herausgeber über einen sicheren Ursprung verfügt.
es: Seleccione la ficha General para agregar la clave y el certificado SSL si un editor tiene un origen seguro.
ja: 発行元にセキュリティー保護された起点がある場合は、「一般」タブを選択して SSL キーと SSL 証明書を追加します。
ko: 게시자가 보안 원본을 가진 경우 일반 탭을 선택하여 SSL 키 및 SSL 인증서를 추가합니다.
zh_hk: 選取 [一般] 標籤以增加 SSL 金鑰和 SSL 憑證 (如果發佈者有安全的原始)。
