Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: All packages that have updates available from their current publisher are updated. If a package has an update available from a different publisher in your publisher list, that package is updated only if its current publisher is configured as non-sticky. If its current publisher is configured as sticky, then that package is not updated.
de: Alle Pakete, für die Updates von ihren aktuellen Herausgebern verfügbar sind, werden aktualisiert. Wenn für ein Paket Updates von einem anderen Herausgeber in Ihrer Herausgeberliste verfügbar sind, wird das Paket nur dann aktualisiert, wenn der jeweilige aktuelle Herausgeber nicht als Sticky-Herausgeber konfiguriert ist.
es: Todos los paquetes que tienen actualizaciones disponibles de su editor actual están actualizados. Si un paquete tiene una actualización disponible de un editor diferente de su lista de editores, el paquete se actualiza sólo si su editor actual está configurado como no permanente. Si su editor actual está configurado como permanente, ese paquete no está actualizado.
ja: それぞれの現在の発行元から更新が提供されているすべてのパッケージが更新されます。パッケージの更新が発行元リスト内の別の発行元から提供されている場合、そのパッケージが更新されるのは、その現在の発行元が非固定的と設定されている場合だけです。その現在の発行元が固定的と設定されている場合、そのパッケージは更新されません。
ko: 현재 게시자로부터 업데이트를 사용할 수 있는 모든 패키지가 업데이트됩니다. 게시자 목록의 다른 게시자로부터 패키지의 업데이트를 사용할 수 있으면, 현재 게시자가 비고정으로 구성된 경우에만 해당 패키지가 업데이트되고, 현재 게시자가 고정으로 구성된 경우 해당 패키지가 업데이트되지 않습니다.
zh_hk: 會更新可從目前發佈者取得可用更新的所有套裝軟體。如果發佈者清單中的其他發佈者也提供該套裝軟體的可用更新，只有當目前發佈者配置為非固定發佈者時，才能更新該套裝軟體。如果目前發佈者配置為固定發佈者，則不會更新該套裝軟體。

source: The Updates window displays, and the update process starts:
de: Das Fenster "Updates" wird angezeigt, und der Updateprozess wird gestartet:
es: Aparece la ventana Actualizaciones y comienza el proceso de actualización:
ja: 「更新」ウィンドウが表示され、更新処理が開始します。
ko: 업데이트 창이 표시되고 업데이트 프로세스가 시작됩니다.
zh_hk: 會顯示 [更新] 視窗，並開始更新程序：

source: The system refreshes all catalogs.
de: Alle Kataloge auf dem System werden aktualisiert.
es: El sistema refresca todos los catálogos.
ja: すべてのカタログが更新されます。
ko: 시스템이 모든 카탈로그를 새로 고칩니다.
zh_hk: 系統會重新整理所有目錄。

source: The system evaluates all installed packages to determine which packages have updates available.
de: Auf dem System werden die installierten Pakete ausgewertet, um zu ermitteln, für welche Pakete Updates verfügbar sind.
es: El sistema evalúa todos los paquetes instalados para determinar qué paquetes tienen actualizaciones disponibles.
ja: すべてのインストール済みパッケージが評価され、使用可能な更新が存在するパッケージが判定されます。
ko: 시스템이 설치된 모든 패키지를 평가하여 업데이트를 사용할 수 있는 패키지를 확인합니다.
zh_hk: 系統會評估所有已安裝的套裝軟體，判斷哪些套裝軟體有可用的更新。

source: If no packages have updates available, the message “No Updates Available” is displayed and processing stops.
de: Wenn für keine Pakete Updates verfügbar sind, wird die Meldung 'Keine Updates verfügbar' angezeigt, und der Vorgang wird beendet.
es: Si ningún paquete tiene actualizaciones disponibles, aparecerá el mensaje "No hay actualizaciones disponibles" y se procesarán detenciones.
ja: どのパッケージにも使用可能な更新が存在しない場合、「有効な更新はありません」というメッセージが表示され、処理は停止します。
ko: 업데이트를 사용할 수 있는 패키지가 없을 경우 "사용 가능한 업데이트 없음" 메시지가 표시되고 처리가 중지됩니다.
zh_hk: 如果套裝軟體沒有可用的更新，會顯示「沒有可用更新」訊息並停止處理。

source: If package updates are available, the packages to be updated are listed for your review. This is your last chance to click the <guibutton>Cancel</guibutton> button to abort the update.
de: Wenn Paketupdates verfügbar sind, werden die zu aktualisierenden Pakete für Sie zum Überprüfen aufgeführt. An dieser Stelle können Sie noch auf <guibutton>Abbrechen</guibutton> klicken, um das Update abzubrechen.
es: Si hay actualizaciones de paquete disponibles, se muestran los paquetes para actualizar a fin de que los revise. Ésta es la última oportunidad para hacer clic en el botón <guibutton>Cancelar</guibutton> a fin de abandonar la actualización.
ja: 使用可能なパッケージ更新が存在する場合、更新されるパッケージが確認のために一覧表示されます。更新を中止するには<guibutton>「取消し」</guibutton>ボタンをクリックします。これ以降は中止できません。
ko: 패키지 업데이트를 사용할 수 있을 경우 검토를 위해 업데이트할 패키지가 나열됩니다. 후속 단계부터는 더 이상 <guibutton>취소</guibutton> 버튼을 눌러 업데이트를 중단할 수 없습니다.
zh_hk: 如果套裝軟體有可用更新，會列出要更新的套裝軟體供您檢視。這是您最後一次可按一下 [<guibutton>取消</guibutton>] 按鈕中斷更新的機會。

source: Click the <guibutton>Proceed</guibutton> button to continue with the update.
de: Klicken Sie auf die Schaltfläche <guibutton>Fortfahren</guibutton>, um das Update fortzusetzen.
es: Haga clic en el botón <guibutton>Continuar</guibutton> para continuar con la actualización.
ja: 更新を続行するには<guibutton>「続行」</guibutton>ボタンをクリックします。
ko: <guibutton>진행</guibutton> 버튼을 눌러 업데이트를 계속합니다.
zh_hk: 按一下 [<guibutton>繼續</guibutton>] 按鈕繼續更新。

source: The system might create a new boot environment (BE), as described in <xref linkend="update_all"/> above, depending on which packages are being updated.
de: Auf dem System kann je nach Paketen, die aktualisiert werden, eine neue Boot-Umgebung (BU) erstellt werden (siehe dazu <xref linkend="update_all"/> oben).
es: El sistema puede crear un nuevo entorno de inicio, como se describió en <xref linkend="update_all"/> arriba, según los paquetes que se están instalando.
ja: 前述の<xref linkend="update_all"/>で説明されているとおり、更新されるパッケージによっては、新しいブート環境 (BE) が作成されることがあります。
ko: 위의 <xref linkend="update_all"/>에 설명된 대로 업데이트 중인 패키지에 따라 시스템이 새 BE(부트 환경)를 만들 수 있습니다.
zh_hk: 視已更新的套裝軟體而定，系統可能會建立新的啟動環境 (BE)，如以上 <xref linkend="update_all"/> 所述。

source: If the system determined that a new BE is required but was not able to create a new BE, an error message is displayed. If the problem is not enough disk space, perform the following steps:
de: Wenn auf dem System festgestellt wird, dass eine neue BU erforderlich ist, diese aber nicht erstellt werden konnte, wird eine Fehlermeldung angezeigt. Wenn die Urasche dafür nicht genug Speicherplatz ist, führen Sie die folgenden Schritte aus:
es: Si el sistema determina que se necesita un nuevo entorno de inicio pero éste no se pudo crear, aparecerá un mensaje de error. Si el problema es que no hay suficiente espacio en disco, realice los siguientes pasos:
ja: 新しい BE が必要な場合にそれを作成できなかったときは、エラーメッセージが表示されます。問題がディスク容量不足であれば、次の手順を実行してください。
ko: 새 BE가 필요한 것으로 확인되었지만 새 BE를 만들 수 없을 경우 오류 메시지가 표시됩니다. 디스크 공간 부족 문제일 경우 다음 단계를 수행합니다.
zh_hk: 如果系統判斷需要建立新的 BE，但卻無法建立新的 BE，則會顯示錯誤訊息。如果問題是磁碟空間不足，請執行下列步驟：

source: Click <guibutton>Close</guibutton> to cancel the Updates process.
de: Klicken Sie auf <guibutton>Schließen</guibutton>, um den Updatevorgang abzubrechen.
es: Haga clic en el botón <guibutton>Cerrar</guibutton> para cancelar el proceso de actualización.
ja: <guibutton>「閉じる」</guibutton>をクリックして更新処理を取り消します。
ko: <guibutton>닫기</guibutton>를 눌러 업데이트 프로세스를 취소합니다.
zh_hk: 按一下 [<guibutton>關閉</guibutton>]，取消更新程序。

source: Follow the instructions in <xref linkend="remove-be"/> to remove a BE that is no longer needed.
de: Befolgen Sie die Anweisungen unter <xref linkend="remove-be"/>, um eine nicht mehr erforderliche BU zu entfernen.
es: Siga las instrucciones que aparecen en <xref linkend="remove-be"/> para eliminar un entorno de inicio que ya no se necesita.
ja: <xref linkend="remove-be"/>の手順に従って、不要になった BE を削除します。
ko: <xref linkend="remove-be"/>의 지침에 따라 더 이상 필요하지 않은 BE를 제거합니다.
zh_hk: 遵循 <xref linkend="remove-be"/> 中的說明，移除不再需要的 BE。

source: Select <guibutton>Updates</guibutton> again to restart the Updates process.
de: Wählen Sie erneut <guibutton>Updates</guibutton>, um den Updatevorgang neu zu starten.
es: Vuelva a seleccionar <guibutton>Actualizaciones</guibutton> para reiniciar el proceso de actualización.
ja: もう一度<guibutton>「更新」</guibutton>をクリックして更新処理を再度開始します。
ko: <guibutton>업데이트</guibutton>를 다시 선택하여 업데이트 프로세스를 다시 시작합니다.
zh_hk: 再次選取 [<guibutton>更新</guibutton>] 重新啟動更新程序。

source: The system downloads all package updates.
de: Alle Paketupdates werden auf das System heruntergeladen.
es: El sistema descarga todas las actualizaciones de paquetes.
ja: すべてのパッケージ更新がダウンロードされます。
ko: 시스템이 모든 패키지 업데이트를 다운로드합니다.
zh_hk: 系統會下載所有套裝軟體更新。

source: The system installs the package updates. If a cloned BE was created, the updates are installed in the clone. If no clone was created, the updates are installed in the current BE.
de: Die Paketupdates werden auf dem System installiert. Wenn eine Klon-BU erstellt wurde, werden die Updates im Klon installiert. Wenn kein Klon erstellt wurde, werden die Updates in der aktuellen BU installiert.
es: El sistema instala todas las actualizaciones de paquetes. Si se creó un entorno de inicio clonado, las actualizaciones se instalan en la clonación. Si no se creó una clonación, las actualizaciones se instalan en el entorno de inicio actual.
ja: パッケージ更新がインストールされます。BE のクローンが作成されている場合、更新はクローンにインストールされます。クローンが作成されていない場合、更新は現在の BE にインストールされます。
ko: 시스템이 패키지 업데이트를 설치합니다. 복제된 BE가 만들어진 경우 업데이트가 복제본에 설치되며, 복제본이 만들어지지 않은 경우 업데이트가 현재 BE에 설치됩니다.
zh_hk: 系統會安裝套裝軟體更新。如果已建立複製的 BE，更新會安裝在複製中。如果未建立複製，更新會安裝在目前的 BE 中。

source: If an error occurs at any time during the update process, the Details panel is expanded and the details of the error are displayed. An error status indicator is shown next to the failed stage.
de: Wenn während des Updatevorgangs ein Fehler auftritt, wird der Bereich "Details" erweitert, um die Fehlerdetails anzuzeigen. Neben der fehlgeschlagenen Phase wird ein Fehlerstatusindikator angezeigt.
es: Si se produce un error en cualquier momento durante el proceso de actualización, el panel Detalles se amplía y se muestran los detalles del error. Se muestra un indicador de estado del error junto a la fase en que ha ocurrido.
ja: 更新処理中にいずれかの時点でエラーが発生した場合は、「詳細」パネルが展開され、エラーの詳細が表示されます。失敗した段階の横に、エラー状態インジケータが表示されます。
ko: 업데이트 프로세스 중 오류가 발생하면 세부 정보 패널이 확장되고 오류 세부 정보가 표시됩니다. 실패한 단계 옆에 오류 상태 표시기가 나타납니다.
zh_hk: 如果在更新程序中的任何時間發生錯誤，即會展開 [詳細資訊] 面板，並顯示錯誤的詳細資訊。失敗的階段旁會顯示錯誤狀態指示器。

source: If the system created a new BE for the update, you can edit the default BE name. When you are satisfied with the BE name, click the <guibutton>Restart Now</guibutton> button to reboot your system immediately. Click the <guibutton>Restart Later</guibutton> button to restart your system at a later time. You must restart to boot into the new BE. The new BE will be your default boot choice. Your current BE will be available as an alternate boot choice.
de: Wenn auf dem System eine neue BU für das Update erstellt wurde, können Sie den Standard-BU-Namen bearbeiten. Wenn der gewünschte BU-Name eingegeben ist, klicken Sie auf die Schaltfläche <guibutton>Erneut starten</guibutton>, um das System sofort neu zu starten. Klicken Sie auf die Schaltfläche <guibutton>Später erneut starten</guibutton>, um das System später neu zu booten. Sie müssen einen Neustart ausführen, um die neue BU zu booten. Die neue BU ist die Standard-Boot-Option. Die aktuelle BU bleibt als alternative Boot-Option verfügbar.
es: Si el sistema creó un nuevo entorno de inicio para la actualización, puede editar el nombre del entorno de inicio predeterminado. Una vez que esté conforme con el nombre del entorno de inicio, haga clic en el botón <guibutton>Reiniciar ahora</guibutton> para reiniciar el sistema de inmediato. Haga clic en el botón <guibutton>Reiniciar más tarde</guibutton> para reiniciar el sistema en otro momento. Debe reiniciar el sistema para que se inicie en el nuevo entorno de inicio. El nuevo entorno de inicio será su opción de inicio predeterminada. Su entorno de inicio actual estará disponible como una opción de inicio alternativa.
ja: 更新用の新しい BE が作成されている場合は、デフォルトの BE 名を編集することができます。希望の BE 名に変更したあと、システムをただちにリブートする場合は<guibutton>「今すぐ再起動」</guibutton>ボタンをクリックします。システムをあとで再起動する場合は<guibutton>「あとで再起動」</guibutton>ボタンをクリックします。新しい BE からブートするには再起動が必要です。新しい BE がデフォルトのブート環境になります。現在の BE は代替ブート環境として使用可能です。
ko: 시스템이 업데이트를 위해 새 BE를 만든 경우 기본 BE 이름을 편집할 수 있습니다. 기본 BE 이름을 그대로 사용하려면 <guibutton>지금 재시작</guibutton> 버튼을 눌러 시스템을 즉시 재부트합니다. 시스템을 나중에 다시 시작하려면 <guibutton>다음에 재시작</guibutton> 버튼을 누릅니다. 새 BE로 부트하려면 다시 시작해야 합니다. 새 BE가 기본 부트 옵션으로 설정되고, 현재 BE가 대체 부트 옵션으로 제공됩니다.
zh_hk: 如果系統已建立一個用於更新的新 BE，您可以編輯預設的 BE 名稱。當您滿意 BE 名稱時，按一下 [<guibutton>立即重新啟動</guibutton>] 按鈕，立刻重新啟動系統。按一下 [<guibutton>稍後重新啟動</guibutton>] 按鈕，稍後再重新啟動系統。您必須重新啟動系統，以便在啟動後進入新 BE。新 BE 會是您預設的啟動選項。目前的 BE 可做為替代的啟動選項使用。

source: Using Update Manager
de: Verwenden von Update-Manager
es: Uso del Administrador de actualizaciones
ja: 更新マネージャーの使用
ko: 업데이트 관리자 사용
zh_hk: 使用更新管理員

source: You can open Update Manager from a system notification or from the desktop menu bar. Update Manager executes the same process as described above in <xref linkend="um_info"/>.
de: Sie können den Update-Manager über eine Systembenachrichtigung oder über die Desktop-Menüleiste öffnen. Der Update-Manager führt den gleichen Prozess durch (siehe Beschreibung oben unter <xref linkend="um_info"/>).
es: Puede abrir el Administrador de actualizaciones desde una notificación del sistema o desde la barra de menú del escritorio. El Administrador de actualizaciones ejecuta el mismo proceso que el descrito anteriormente en <xref linkend="um_info"/>.
ja: 更新マネージャーはシステム通知またはデスクトップメニューバーから開くことができます。更新マネージャーは、前述の<xref linkend="um_info"/>で説明されているものと同じ処理を実行します。
ko: 시스템 알림 또는 데스크탑 메뉴 표시줄에서 업데이트 관리자를 열 수 있습니다. 업데이트 관리자는 위의 <xref linkend="um_info"/>에 설명된 것과 동일한 프로세스를 실행합니다.
zh_hk: 您可以從系統通知或從桌面功能表列開啟更新管理員。更新管理員會執行上述 <xref linkend="um_info"/> 中的相同程序。

source: Software Updates Notification
de: Sofware-Updatebenachrichtigung
es: Notificación de actualizaciones de software
ja: ソフトウェア更新の通知
ko: 소프트웨어 업데이트 알림
zh_hk: 軟體更新通知

source: The system periodically checks whether updates are available for any of your installed packages. If the system detects that updates are available, an Updates Available notification icon and popup are displayed in the system notification tray. Click the notification icon to open Update Manager.
de: Das System überprüft regelmäßig, ob Updates für die installierten Pakete verfügbar sind. Wenn das System verfügbare Updates erkennt, werden das Benachrichtigungssymbol "Updates verfügbar" sowie eine Popup-Meldung im Benachrichtigungsbereich angezeigt. Klicken Sie auf das Benachrichtigungssymbol, um den Update-Manager zu öffnen.
es: El sistema comprueba de manera periódica si hay actualizaciones disponibles para cualquiera de sus paquetes instalados. Si el sistema detecta que hay actualizaciones disponibles, aparecen una ventana emergente y un icono de notificación de Actualizaciones disponibles en la bandeja de notificaciones del sistema. Haga clic en el icono de notificación para abrir el Administrador de actualizaciones.
ja: システムは、インストール済みパッケージのいずれかに使用可能な更新が存在するかどうかを定期的に確認します。使用可能な更新が存在することが検出されると、システム通知トレーに「更新が使用可能です」通知アイコンとポップアップが表示されます。この通知アイコンをクリックして更新マネージャーを開きます。
ko: 시스템은 설치된 패키지에 대한 업데이트를 사용할 수 있는지 여부를 주기적으로 확인합니다. 시스템이 업데이트를 사용할 수 있는 것으로 감지하면 업데이트를 사용할 수 있음 알림 아이콘과 팝업이 시스템 알림 트레이에 표시됩니다. 알림 아이콘을 누르면 업데이트 관리자가 열립니다.
zh_hk: 系統會定期檢查是否有適用於您已安裝的套裝軟體的可用更新。如果系統偵測到有可用更新，可用更新通知圖示和快顯功能表會顯示在系統通知匣中。按一下通知圖示即可開啟更新管理員。

source: Desktop System Menu
de: Menü "Desktop System"
es: Menú de Desktop System
ja: デスクトップのシステムメニュー
ko: 데스크탑 시스템 메뉴
zh_hk: Desktop System 功能表

source: Select <menuchoice><guimenu>System</guimenu><guisubmenu>Administration</guisubmenu><guimenuitem>Update Manager</guimenuitem></menuchoice> from the menu bar on the desktop to open Update Manager.
de: Wählen Sie in der Desktop-Menüleiste die Option <menuchoice><guimenu>System</guimenu><guisubmenu>Administration</guisubmenu><guimenuitem>Update-Manager</guimenuitem></menuchoice>, um den Update-Manager zu öffnen.
es: Seleccione <menuchoice><guimenu>Sistema</guimenu><guisubmenu>Administración</guisubmenu><guimenuitem>Administrador de actualizaciones</guimenuitem></menuchoice> desde la barra de menú en el escritorio para abrir el Administrador de actualizaciones.
ja: デスクトップのメニューバーから<menuchoice><guimenu>「システム」</guimenu><guisubmenu>「システム管理」</guisubmenu><guimenuitem>「更新マネージャー」</guimenuitem></menuchoice>を選択して更新マネージャーを開きます。
ko: 업데이트 관리자를 열려면 데스크탑 메뉴 표시줄에서<menuchoice><guimenu>시스템</guimenu><guisubmenu>관리</guisubmenu><guimenuitem>업데이트 관리자</guimenuitem></menuchoice>를 선택합니다.
zh_hk: 從桌面的功能表列上選取 <menuchoice>[<guimenu>系統</guimenu>] [<guisubmenu>管理</guisubmenu>] [<guimenuitem>更新管理員</guimenuitem>]</menuchoice>，以開啟更新管理員。

source: Managing Publishers
de: Verwalten von Herausgebern
es: Gestión de editores
ja: 発行元の管理
ko: 게시자 관리
zh_hk: 管理發佈者

source: You can add, modify, and remove IPS package publishers. You can change the priority of a publisher, change the enabled and sticky settings, change the publisher alias, add or remove a publisher origin, and add or remove a publisher mirror. You can manage keys, certificates, and signature policy.
de: Sie können IPS-Paketherausgeber hinzufügen, ändern und entfernen. Sie können die Priorität für einen Herausgeber, den aktivierten Status und Sticky-Einstellungen sowie den Herausgeber-Alias ändern. Außerdem können Sie einen Herausgeberursprung sowie einen Herausgeberspiegel hinzufügen oder entfernen. Sie haben auch die Möglichkeit, Schlüssel, Zertifikate und die Signaturrichtlinie zu verwalten.
es: Puede agregar, modificar y eliminar editores de paquetes IPS. Puede cambiar la prioridad de un editor, cambiar las configuraciones habilitadas y permanentes, cambiar el alias de editor, agregar o eliminar un origen de editor y agregar o eliminar un reflejo de editor. Puede gestionar claves, certificados y políticas de firmas.
ja: IPS パッケージ発行元の追加、変更、および削除を行うことができます。発行元の優先度の変更、有効設定と固定的設定の変更、発行元の別名の変更、発行元の起点の追加または削除、および発行元のミラーの追加または削除を行うことができます。キー、証明書、および署名ポリシーを管理できます。
ko: IPS 패키지 게시자를 추가, 수정 및 제거할 수 있습니다. 게시자의 우선 순위를 변경하고, 사용 및 고정 설정을 변경하고, 게시자 별칭을 변경하고, 게시자 원본을 추가 또는 제거하고, 게시자 미러를 추가 또는 제거할 수 있습니다. 키, 인증서 및 서명 정책을 관리할 수도 있습니다.
zh_hk: 您可以增加、修改和移除 IPS 套裝軟體發佈者。您可以變更發佈者的優先權、變更已啟用和固定設定、變更發佈者別名、增加或移除發佈者原始，以及增加或移除發佈者鏡像。您可以管理金鑰、憑證和簽名策略。

source: Note that system publishers are an exception. System publishers can only be viewed in the Manage Publishers window. System publishers cannot be removed or modified, and you cannot change their priority. See <xref linkend="glossary"/>. The Details pane indicates whether the selected publisher is a system publisher.
de: Beachten Sie, dass Systemherausgeber eine Ausnahme bilden. Systemherausgeber können nur im Fenster "Herausgeber verwalten" angezeigt werden. Sie können nicht entfernt oder geändert werden. Die Priorität für Systemherausgeber kann auch nicht geändert werden (siehe dazu <xref linkend="glossary"/>). Im Bereich "Details" wird angezeigt, ob der ausgewählte Herausgeber ein Systemherausgeber ist.
es: Tenga en cuenta que los editores del sistema son una excepción. Los editores del sistema sólo se pueden ver en la ventana Administrar editores. Los editores del sistema no se pueden eliminar ni modificar, ni se puede cambiar su prioridad. Consulte <xref linkend="glossary"/>. El panel Detalles indica si el editor seleccionado es un editor del sistema.
ja: システム発行元は例外です。システム発行元は「発行元の管理」ウィンドウにのみ表示されます。システム発行元は削除したり変更したりできず、優先度を変更することもできません。<xref linkend="glossary"/>を参照してください。選択した発行元がシステム発行元かどうかは、詳細区画に表示されます。
ko: 시스템 게시자는 예외입니다. 시스템 게시자는 게시자 관리 창에서만 확인할 수 있습니다. 시스템 게시자는 제거 또는 수정할 수 없으며 시스템 게시자의 우선 순위는 변경할 수 없습니다. <xref linkend="glossary"/>를 참조하십시오. 세부 정보 창에 선택된 게시자가 시스템 게시자인지 여부가 표시됩니다.
zh_hk: 請注意，系統發佈者為例外狀況。只能在「管理發佈者」視窗中檢視系統發佈者。您無法移除或修改系統發佈者，也不能變更其優先權。請參閱 <xref linkend="glossary"/>。[詳細資訊] 窗格會指出所選的發佈者是否為系統發佈者。

source: Adding Publishers
de: Hinzufügen von Herausgebern
es: Adición de editores
ja: 発行元の追加
ko: 게시자 추가
zh_hk: 增加發佈者

source: To add an IPS package publisher, use the Add Publisher window. To open the Add Publisher window, do one of the following actions:
de: Verwenden Sie zum Hinzufügen eines IPS-Paketherausgebers das Fenster "Herausgeber hinzufügen". Führen Sie zum Öffnen des Fensters "Herausgeber hinzufügen" eine der folgenden Aktionen aus:
es: Para agregar un editor de paquetes IPS, utilice la ventana Agregar editor. Para abrir la ventana Agregar editor, realice una de las siguientes acciones:
ja: IPS パッケージ発行元を追加するには、「発行元を追加」ウィンドウを使用します。「発行元を追加」ウィンドウを開くには、次のいずれかの操作を実行します。
ko: IPS 패키지 게시자를 추가하려면 게시자 추가 창을 사용합니다. 게시자 추가 창을 열려면 다음 작업 중 하나를 수행합니다.
zh_hk: 若要增加 IPS 套裝軟體發佈者，請使用 [增加發佈者] 視窗。若要開啟 [增加發佈者] 視窗，請執行下列其中一個動作：

source: Select the <guimenuitem>Add</guimenuitem> option from the <guimenu>Publisher</guimenu> drop-down menu.
de: Wählen Sie im Dropdown-Menü <guimenu>Herausgeber</guimenu> die Option <guimenuitem>Hinzufügen</guimenuitem>.
es: Seleccione la opción <guimenuitem>Agregar</guimenuitem> del menú desplegable <guimenu>Editor</guimenu>.
ja: <guimenu>「発行元」</guimenu>ドロップダウンメニューから<guimenuitem>「追加」</guimenuitem>オプションを選択します。
ko: <guimenu>게시자</guimenu> 드롭다운 메뉴에서 <guimenuitem>추가</guimenuitem> 옵션을 선택합니다.
zh_hk: 從 [<guimenu>發佈者</guimenu>] 下拉式功能表選取 [<guimenuitem>增加</guimenuitem>] 選項。

source: Select the <menuchoice><guimenu>File</guimenu><guimenuitem>Add Publisher</guimenuitem></menuchoice> menu option.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Datei</guimenu><guimenuitem>Herausgeber hinzufügen</guimenuitem></menuchoice>.
es: Seleccione la opción de menú <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Agregar editor</guimenuitem></menuchoice>.
ja: <menuchoice><guimenu>「ファイル」</guimenu><guimenuitem>「発行元を追加」</guimenuitem></menuchoice>メニューオプションを選択します。
ko: <menuchoice><guimenu>파일</guimenu><guimenuitem>게시자 추가</guimenuitem></menuchoice> 메뉴 옵션을 선택합니다.
zh_hk: 選取 <menuchoice>[<guimenu>檔案</guimenu>] [<guimenuitem>增加發佈者</guimenuitem>]</menuchoice> 功能表選項。

source: Select the <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Publishers</guimenuitem></menuchoice> menu option. In the Manage Publishers window, select the <guibutton>Add</guibutton> button.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Datei</guimenu><guimenuitem>Herausgeber verwalten</guimenuitem></menuchoice>. Wählen Sie im Fenster "Herausgeber verwalten" die Schaltfläche <guibutton>Hinzufügen</guibutton>.
es: Seleccione la opción de menú <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Administrar editores</guimenuitem></menuchoice>. En la ventana Administrar editores, seleccione el botón <guibutton>Agregar</guibutton>.
ja: <menuchoice><guimenu>「ファイル」</guimenu><guimenuitem>「発行元の管理」</guimenuitem></menuchoice>メニューオプションを選択します。「発行元の管理」ウィンドウで、<guibutton>「追加」</guibutton>ボタンをクリックします。
ko: <menuchoice><guimenu>파일</guimenu><guimenuitem>게시자 관리</guimenuitem></menuchoice> 메뉴 옵션을 선택합니다. 게시자 관리 창에서 <guibutton>추가</guibutton> 버튼을 선택합니다.
zh_hk: 選取 <menuchoice>[<guimenu>檔案</guimenu>] [<guimenuitem>管理發佈者</guimenuitem>]</menuchoice> 功能表選項。在 [管理發佈者] 視窗中，選取 [<guibutton>增加</guibutton>] 按鈕。

source: In the Add Publisher window, perform the following steps to add an IPS package publisher:
de: Führen Sie im Fenster "Herausgeber hinzufügen" die folgenden Schritte aus, um einen IPS-Paketherausgeber hinzuzufügen:
es: En la ventana Agregar editor, realice los siguientes pasos para agregar un editor de paquetes IPS:
ja: 「発行元を追加」ウィンドウで次の手順を実行して、ISP パッケージ発行元を追加します。
ko: 게시자 추가 창에서 다음 단계를 수행하여 IPS 패키지 게시자를 추가합니다.
zh_hk: 在 [增加發佈者] 視窗中，執行下列步驟以增加 IPS 套裝軟體發佈者：

source: In the URI field, enter the URI of the publisher. The URI is a network location such as <literal>http://pkg.oracle.com/solaris/release/</literal> or <literal>http://localhost:5555</literal>.
de: Geben Sie in das URI-Feld die URI des Herausgebers ein. Die URI ist eine Netzwerkadresse wie z. B. <literal>http://pkg.oracle.com/solaris/release/</literal> oder <literal>http://localhost:5555</literal>.
es: En el campo URI, introduzca el URI del editor. El URI es una ubicación de red, como <literal>http://pkg.oracle.com/solaris/release/</literal> o <literal>http://localhost:5555</literal>.
ja: 「URI」フィールドに発行元の URI を入力します。URI は、<literal>http://pkg.oracle.com/solaris/release/</literal> や <literal>http://localhost:5555</literal> といったネットワークの場所です。
ko: URI 필드에 게시자 URI를 입력합니다. URI는 네트워크 위치(예: <literal>http://pkg.oracle.com/solaris/release/</literal> 또는 <literal>http://localhost:5555</literal>)입니다.
zh_hk: 在 URI 欄位中，輸入發佈者的 URI。URI 是一個網路位置，例如 <literal>http://pkg.oracle.com/solaris/release/</literal> 或 <literal>http://localhost:5555</literal>。
