Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: A search that matched no packages does not appear in the recent searches list.
de: Ein Suchlauf, bei dem keine entsprechenden Pakete gefunden wurden, wird nicht in der Liste der letzten Suchläufe gespeichert.
es: Una búsqueda que no coincide con ningún paquete no aparece en la lista de búsquedas recientes.
ja: どのパッケージにも一致しなかった検索は最近の検索のリストに表示されません。
ko: 일치하는 패키지가 없는 검색은 최근 검색 목록에 나타나지 않습니다.
zh_hk: 最近的搜尋清單中不會顯示與套裝軟體不相符的搜尋。

source: Selecting the <guibutton>Refresh</guibutton> button or the <menuchoice><guimenu>Package</guimenu><guimenuitem>Refresh</guimenuitem></menuchoice> menu option deletes all recent searches results.
de: Wenn Sie die Schaltfläche <guibutton>Aktualisieren</guibutton> oder die Menüoption <menuchoice><guimenu>Paket</guimenu><guimenuitem>Aktualisieren</guimenuitem></menuchoice> wählen, werden alle Suchergebnisse der letzten Suchläufe gelöscht.
es: Si selecciona el botón <guibutton>Refrescar</guibutton> o la opción de menú <menuchoice><guimenu>Paquete</guimenu><guimenuitem>Refrescar</guimenuitem></menuchoice>, se suprimirán todos los resultados de búsquedas recientes.
ja: <guibutton>「更新」</guibutton>ボタンまたは<menuchoice><guimenu>「パッケージ」</guimenu><guimenuitem>「更新」</guimenuitem></menuchoice>メニューオプションを選択すると、最近の検索結果がすべて削除されます。
ko: <guibutton>새로 고침</guibutton> 버튼 또는 <menuchoice><guimenu>패키지</guimenu><guimenuitem>새로 고침</guimenuitem></menuchoice> 메뉴 옵션을 선택하면 최근 검색 결과가 모두 삭제됩니다.
zh_hk: 選取 [<guibutton>重新整理</guibutton>] 按鈕或 <menuchoice>[<guimenu>套裝軟體</guimenu>] [<guimenuitem>重新整理</guimenuitem>]</menuchoice> 功能表選項會刪除所有最近的搜尋結果。

source: Showing More Information
de: Anzeigen weiterer Informationen
es: Mostrar más información
ja: 詳細情報の表示
ko: 추가 정보 표시
zh_hk: 顯示更多資訊

source: See more information about a package in the package details pane or on the Package Version Info dialog.
de: Weitere Informationen zu einem Paket finden Sie im Paketinformationsbereich oder im Dialogfeld "Paket-Versionsinformationen".
es: Obtenga más información sobre un paquete en el panel de detalles del paquete o en el cuadro de diálogo Información de versión del paquete.
ja: パッケージに関する詳細情報をパッケージの詳細区画または「パッケージのバージョン情報」ダイアログで確認します。
ko: 패키지 세부 정보 창 또는 패키지 버전 정보 대화 상자에서 패키지에 대한 추가 정보를 확인합니다.
zh_hk: 在套裝軟體詳細資訊窗格或 [套裝軟體版本資訊] 對話方塊中查看更多有關套裝軟體的資訊。

source: Package Details Pane
de: Paketinformationsbereich
es: Panel de detalles del paquete
ja: パッケージの詳細区画
ko: 패키지 세부 정보 창
zh_hk: 套裝軟體詳細資訊窗格

source: To show more information about a package, click your left mouse button to highlight the package in the package list. The package details pane below the package list pane shows information such as the latest version available from this publisher, the size of the package, the files in the package, dependencies, and license terms.
de: Klicken Sie zum Anzeigen weiterer Informationen zu einem Paket mit der linken Maustaste auf ein Paket, um das Paket in der Paketliste zu markieren. Im Paketinformationsbereich unterhalb des Paketlistenbereichs werden Informationen wie die neueste verfügbare Version des Herausgebers, die Größe des Pakets, die Dateien im Paket sowie die Abhängigkeiten und Lizenzbestimmungen angezeigt.
es: Si desea mostrar más información sobre un paquete, haga clic con el botón izquierdo del mouse para resaltar el paquete en la lista de paquetes. El panel de detalles del paquete debajo del panel de la lista de paquetes muestra información, como la última versión disponible de este editor, el tamaño del paquete, los archivos del paquete, las dependencias y las cláusulas de la licencia.
ja: パッケージに関する詳細情報を表示するには、パッケージリストでそのパッケージをマウスの左ボタンでクリックして強調表示します。パッケージリスト区画の下にあるパッケージの詳細区画に、この発行元から利用できる最新のバージョン、パッケージのサイズ、パッケージ内のファイル、依存関係、ライセンス契約条件といった情報が表示されます。
ko: 패키지에 대한 추가 정보를 표시하려면 패키지 목록의 패키지를 마우스 왼쪽 버튼으로 눌러 강조 표시합니다. 패키지 목록 창 아래의 패키지 세부 정보 창에 해당 게시자로부터 사용 가능한 최신 버전, 패키지 크기, 패키지 파일, 종속성, 라이센스 조건 등의 정보가 표시됩니다.
zh_hk: 若要顯示更多套裝軟體的資訊，請按一下滑鼠左鍵以反白顯示套裝軟體清單中的套裝軟體。套裝軟體清單窗格下方的套裝軟體詳細資訊窗格會顯示相關資訊，例如此發佈者可供使用的最新版本、套裝軟體大小、套裝軟體中的檔案、相依性以及授權條款。

source: If a package has been renamed since it was installed, the Renamed To field on the General tab shows the new name of the package.
de: Wenn ein Paket nach der Installation umbenannt wurde, wird der neue Name des Pakets auf der Registerkarte "Allgemein" im Feld "Umbenannt in" angezeigt.
es: Si a un paquete se le cambia el nombre después de que se instaló, el campo Renombrado como en la ficha General muestra el nuevo nombre del paquete.
ja: パッケージのインストール後に名前が変更されている場合は、パッケージの新しい名前が「一般」タブの「変更後の名前」フィールドに表示されます。
ko: 패키지가 설치된 후 패키지의 이름이 바뀐 경우 일반 탭의 다음으로 이름 변경 필드에 패키지의 새 이름이 표시됩니다.
zh_hk: 如果套裝軟體已經在安裝之後重新命名，[一般] 標籤中的 [重新命名] 欄位就會顯示套裝軟體的新名稱。

source: The Versions tab shows a list of versions of this package that are available for you to install. Select a version from the list and click the <guibutton>Install/Update</guibutton> button to the right of the list to install that version. See <xref linkend="install-pkg"/>.
de: Auf der Registerkarte "Versionen" wird eine Liste aller Versionen des Pakets angezeigt, die für Ihre Installation verfügbar sind. Wählen Sie aus der Liste eine Version aus, und klicken Sie rechts neben der Liste auf die Schaltfläche <guibutton>Installation/Update</guibutton>, um die gewünschte Version zu installieren. Weitere Informationen finden Sie unter <xref linkend="install-pkg"/>.
es: La ficha Versiones muestra una lista de versiones de este paquete que están disponibles para que usted instale. Seleccione una versión de la lista y haga clic en el botón <guibutton>Instalar/Actualizar</guibutton> que aparece a la derecha de la lista para instalar esa versión. Consulte <xref linkend="install-pkg"/>.
ja: 「バージョン」タブには、インストールに使用できるこのパッケージのバージョンのリストが表示されます。リストからバージョンを選択し、リストの右にある<guibutton>「インストール/更新」</guibutton>ボタンをクリックすると、そのバージョンをインストールできます。<xref linkend="install-pkg"/>を参照してください。
ko: 버전 탭에는 설치할 수 있는 패키지 버전 목록이 표시됩니다. 버전을 설치하려면 목록에서 해당 버전을 선택하고 목록 오른쪽에 있는 <guibutton>설치/업데이트</guibutton> 버튼을 누릅니다. <xref linkend="install-pkg"/>를 참조하십시오.
zh_hk: [版本] 標籤顯示可供您安裝的套裝軟體版本清單。從清單選取版本並按一下清單右邊的 [<guibutton>安裝/更新</guibutton>] 按鈕，即可安裝該版本。請參閱 <xref linkend="install-pkg"/>。

source: The package details pane is not displayed if the package list pane contains an informational message.
de: Der Paketinformationsbereich wird nicht angezeigt, wenn der Paketlistenbereich eine Informationsmeldung enthält.
es: El panel de detalles del paquete no se muestra si el panel de la lista de paquetes contiene un mensaje informativo.
ja: パッケージリスト区画に情報メッセージが表示されている場合、パッケージの詳細区画は表示されません。
ko: 패키지 목록 창에 정보 메시지가 표시되는 경우 패키지 세부 정보 창이 표시되지 않습니다.
zh_hk: 如果套裝軟體清單窗格包含資訊訊息，就不會顯示套裝軟體詳細資訊窗格。

source: Package Version Info Dialog
de: Dialogfeld "Paket-Versionsinformationen"
es: Cuadro de diálogo Información de versión del paquete
ja: パッケージのバージョン情報ダイアログ
ko: 패키지 버전 정보 대화 상자
zh_hk: 套裝軟體版本資訊對話方塊

source: Click your right mouse button on a package in the package list to pop up the <guimenu>Package</guimenu> menu.
de: Klicken Sie mit der rechten Maustaste auf ein Paket in der Paketliste, um das Menü <guimenu>Paket</guimenu> anzuzeigen.
es: Haga clic con el botón derecho del mouse en un paquete de la lista de paquetes para mostrar el menú <guimenu>Paquete</guimenu>.
ja: パッケージリストでパッケージをマウスの右ボタンでクリックすると、<guimenu>「パッケージ」</guimenu>メニューがポップアップ表示されます。
ko: <guimenu>패키지</guimenu> 메뉴를 팝업하려면 패키지 목록의 패키지를 마우스 오른쪽 버튼으로 누릅니다.
zh_hk: 在套裝軟體清單中的套裝軟體上按一下滑鼠右鍵，就會出現 [<guimenu>套裝軟體</guimenu>] 快顯功能表。

source: Select the <menuchoice><guimenu>Package</guimenu><guimenuitem>Package Version Info</guimenuitem></menuchoice> menu option either from the pop-up menu or from the menu bar to display a separate window that shows the version of the package that is installed and the latest version that you can install or upgrade to if applicable.
de: Wählen Sie entweder im Popup-Menü oder in der Menüleiste die Menüoption <menuchoice><guimenu>Paket</guimenu><guimenuitem>Paket-Versionsinformationen</guimenuitem></menuchoice>, um ein separates Fenster anzuzeigen, in dem die Version des installierten Pakets sowie die neueste Version, die Sie installieren oder auf die Sie ggf. aktualisieren können, angezeigt werden.
es: Seleccione la opción de menú <menuchoice><guimenu>Paquete</guimenu><guimenuitem>Información de versión del paquete</guimenuitem></menuchoice> desde el menú emergente o desde la barra de menú para visualizar una ventana separada que muestra la versión del paquete instalado y la última versión que puede instalar o a la que puede actualizar si corresponde.
ja: ポップアップメニューまたはメニューバーから<menuchoice><guimenu>「パッケージ」</guimenu><guimenuitem>「パッケージのバージョン情報」</guimenuitem></menuchoice>メニューオプションを選択すると、別のウィンドウが開き、インストールされているパッケージのバージョンと、該当する場合はインストールまたはアップグレードできる最新のバージョンが表示されます。
ko: 설치된 패키지의 버전과 설치 또는 업그레이드할 수 있는 최신 버전(해당하는 경우)을 보여 주는 별도의 창을 표시하려면 팝업 메뉴 또는 메뉴 표시줄에서 <menuchoice><guimenu>패키지</guimenu><guimenuitem>패키지 버전 정보</guimenuitem></menuchoice> 메뉴 옵션을 선택합니다.
zh_hk: 從快顯功能表或功能表列選取 <menuchoice>[<guimenu>套裝軟體</guimenu>] [<guimenuitem>套裝軟體版本資訊</guimenuitem>]</menuchoice> 功能表選項，即可顯示個別視窗，其中會顯示已經安裝的套裝軟體版本，以及您可以安裝或升級的最新版本 (如果適用)。

source: Selecting Packages
de: Auswählen von Paketen
es: Selección de paquetes
ja: パッケージの選択
ko: 패키지 선택
zh_hk: 選取套裝軟體

source: Selected packages can be installed, updated, or removed. To select a package, use the package list pane or the <guimenu>Edit</guimenu> menu.
de: Ausgewählte Pakete können installiert, aktualisiert oder entfernt werden. Verwenden Sie zum Auswählen eines Pakets den Paketlistenbereich oder das Menü <guimenu>Bearbeiten</guimenu>.
es: Los paquetes seleccionados se pueden instalar, actualizar o eliminar. Para seleccionar un paquete, utilice el panel de la lista de paquetes o el menú <guimenu>Editar</guimenu>.
ja: 選択したパッケージをインストール、更新、または削除することができます。パッケージを選択するには、パッケージリスト区画または<guimenu>「編集」</guimenu>メニューを使用します。
ko: 선택된 패키지를 설치, 업데이트 또는 제거할 수 있습니다. 패키지를 선택하려면 패키지 목록 창 또는<guimenu>편집</guimenu> 메뉴를 사용합니다.
zh_hk: 您可以安裝、更新或移除選取的套裝軟體。若要選取套裝軟體，請使用套裝軟體清單窗格或 [<guimenu>編輯</guimenu>] 功能表。

source: In the package list pane, do one of the following actions to select a package. You can select multiple packages.
de: Führen Sie im Paketlistenbereich eine der folgenden Aktionen aus, um ein Paket auszuwählen. Sie können auch mehrere Pakete auswählen.
es: En el panel de de la lista de paquetes, realice una de las siguientes acciones para seleccionar un paquete. Puede seleccionar varios paquetes.
ja: パッケージリスト区画で、次のいずれかの操作を実行してパッケージを選択します。複数のパッケージを選択することができます。
ko: 패키지를 선택하려면 패키지 목록 창에서 다음 작업 중 하나를 수행합니다. 패키지를 여러 개 선택할 수 있습니다.
zh_hk: 在套裝軟體清單窗格中，執行下列其中一項動作可選取套裝軟體。您可以選取多個套裝軟體。

source: Click the box to the left of the package name. Click the box again to deselect the package.
de: Klicken Sie auf das Kontrollkästchen links neben dem Paketnamen. Klicken Sie erneut auf das Kontrollkästchen, um die Auswahl des Pakets aufzuheben.
es: Haga clic en el cuadro que se encuentra a la izquierda del nombre del paquete. Vuelva a hacer clic en el cuadro para anular la selección del paquete.
ja: パッケージ名の左にあるボックスをクリックします。パッケージの選択を解除するには、ボックスを再度クリックします。
ko: 패키지 이름 왼쪽에 있는 상자를 누릅니다. 상자를 다시 누르면 패키지의 선택이 해제됩니다.
zh_hk: 按一下套裝軟體名稱左邊的方塊。再按一下方塊即可取消選取套裝軟體。

source: Click the package name one time to highlight the package. Then double-click the highlighted package to select the package. Double-click again to deselect the package.
de: Klicken Sie einmal auf den Paketnamen, um das Paket zu markieren. Doppelklicken Sie anschließend auf das ausgewählte Paket, um es auszuwählen. Doppelklicken Sie erneut auf das Paket, um die Auswahl dieses Pakets aufzuheben.
es: Haga clic en el nombre del paquete una vez para resaltar el paquete. Luego, haga doble clic en el paquete resaltado para seleccionar el paquete. Vuelva a hacer doble clic para anular la selección del paquete.
ja: パッケージ名を 1 回クリックしてパッケージを強調表示します。次に、強調表示したパッケージをダブルクリックしてそのパッケージを選択します。パッケージの選択を解除するには、再度ダブルクリックします。
ko: 패키지 이름을 한 번 눌러 패키지를 강조 표시합니다. 그런 다음 강조 표시된 패키지를 두 번 눌러 패키지를 선택합니다. 패키지를 다시 두 번 누르면 패키지의 선택이 해제됩니다.
zh_hk: 按一下套裝軟體名稱可將套裝軟體反白顯示。然後按兩下反白顯示的套裝軟體即可選取套裝軟體。再按兩下可取消選取套裝軟體。

source: Click the checkbox icon in the column heading to select all packages that are currently listed in the package list pane. Click the checkbox icon again to deselect all packages currently listed in the package list pane.
de: Klicken Sie in der Spaltenüberschrift auf das Kontrollkästchensymbol, um alle Pakete auszuwählen, die im Paketlistenbereich derzeit aufgeführt sind. Klicken Sie erneut auf das Kontrollkästchensymbol, um die aktuelle Auswahl aller Pakete aufzuheben, die in diesem Paketlistenbereich aufgeführt sind.
es: Haga clic en el icono de la casilla de selección que aparece en el encabezado de la columna para seleccionar todos los paquetes actualmente mostrados en el panel de la lista de paquetes. Vuelva a hacer clic en el icono de la casilla de selección para anular la selección de todos los paquetes actualmente mostrados en el panel de la lista de paquetes.
ja: 列見出し内のチェックボックスアイコンをクリックして、パッケージリスト区画に現在表示されているすべてのパッケージを選択します。パッケージリスト区画に現在表示されているすべてのパッケージの選択を解除するには、チェックボックスアイコンを再度クリックします。
ko: 열 제목의 확인란 아이콘을 눌러 현재 패키지 목록 창에 나열된 모든 패키지를 선택합니다. 확인란 아이콘을 다시 누르면 현재 패키지 목록 창에 나열된 모든 패키지의 선택이 해제됩니다.
zh_hk: 按一下資料欄標題中的核取方塊圖示可選取套裝軟體清單窗格中目前列出的所有套裝軟體。再按一次核取方塊圖示即可取消選取套裝軟體清單窗格中目前列出的所有套裝軟體。

source: The <guimenu>Edit</guimenu> menu has the following options for selecting packages:
de: Das Menü <guimenu>Bearbeiten</guimenu> enthält folgende Optionen zum Auswählen von Paketen:
es: El menú <guimenu>Editar</guimenu> tiene las siguientes opciones para seleccionar paquetes:
ja: <guimenu>「編集」</guimenu>メニューには、パッケージを選択するための次のオプションがあります。
ko: <guimenu>편집</guimenu> 메뉴에는 다음과 같은 패키지 선택 옵션이 있습니다.
zh_hk: [<guimenu>編輯</guimenu>] 功能表包含下列可用來選取套裝軟體的選項：

source: <guimenuitem>Select All</guimenuitem> — Selects all packages that are currently listed in the package list pane.
de: <guimenuitem>Alle auswählen</guimenuitem> – Wählt alle Pakete aus, die derzeit im Paketlistenbereich aufgeführt sind.
es: <guimenuitem>Seleccionar todo</guimenuitem>: selecciona todos los paquetes actualmente mostrados en el panel de la lista de paquetes.
ja: <guimenuitem>「すべてを選択」</guimenuitem> — パッケージリスト区画に現在表示されているすべてのパッケージを選択します。
ko: <guimenuitem>모두 선택</guimenuitem> — 현재 패키지 목록 창에 나열된 모든 패키지를 선택합니다.
zh_hk: <guimenuitem>全選</guimenuitem> — 選取套裝軟體清單窗格中目前列出的所有套裝軟體。

source: <guimenuitem>Select Updates</guimenuitem> — Selects all packages that are currently listed in the package list pane that have updates available.
de: <guimenuitem>Updates auswählen</guimenuitem> – Wählt alle Pakete aus, die im aktuellen Paketlistenbereich aufgeführt sind und für die Updates verfügbar sind.
es: <guimenuitem>Seleccionar actualizaciones</guimenuitem>: selecciona todos los paquetes actualmente mostrados en el panel de la lista de paquetes que tienen actualizaciones disponibles.
ja: <guimenuitem>「更新を選択」</guimenuitem> — パッケージリスト区画に現在表示されているパッケージで、使用可能な更新が存在するものをすべて選択します。
ko: <guimenuitem>업데이트 선택</guimenuitem> — 현재 패키지 목록 창에 나열된 패키지 중 업데이트를 사용할 수 있는 모든 패키지를 선택합니다.
zh_hk: <guimenuitem>選取更新</guimenuitem> — 選取套裝軟體清單窗格中目前列出且已經有可用更新的所有套裝軟體。

source: <guimenuitem>Deselect All</guimenuitem> — Deselects all packages that are currently listed in the package list pane.
de: <guimenuitem>Auswahl für alle aufheben</guimenuitem> — Hebt die Auswahl für alle Pakete auf, die derzeit im Paketlistenbereich aufgeführt sind.
es: <guimenuitem>Anular la selección de todo</guimenuitem>: anula la selección de todos los paquetes actualmente mostrados en el panel de la lista de paquetes.
ja: <guimenuitem>「すべてを選択解除」</guimenuitem> — パッケージリスト区画に現在表示されているすべてのパッケージの選択を解除します。
ko: <guimenuitem>모두 선택 해제</guimenuitem> — 현재 패키지 목록 창에 나열된 모든 패키지의 선택을 해제합니다.
zh_hk: <guimenuitem>取消全選</guimenuitem> — 取消選取套裝軟體清單窗格中目前列出的所有套裝軟體。

source: In all cases when you select a package, packages that were previously selected are still selected.
de: Wenn Sie ein Paket auswählen, bleiben die zuvor ausgewählten Pakete stets ausgewählt.
es: Siempre que selecciona un paquete, los paquetes que estaban seleccionados anteriormente, siguen estándolo.
ja: どの場合でも、パッケージを 1 つ選択したとき、それまでに選択されていたパッケージは選択されたままになります。
ko: 패키지를 선택할 때는 항상 이전에 선택한 패키지가 선택된 상태로 표시됩니다.
zh_hk: 在所有情況下，當您選取套裝軟體時，之前選取的套裝軟體仍會在已選取狀態。

source: The number of packages currently listed in the package list pane and the number of those packages that are selected are shown on the left side of the status bar at the bottom of the Package Manager window.
de: Die Anzahl der derzeit im Paketlistenbereich aufgeführten Pakete und die Anzahl der Pakete, die ausgewählt sind, werden im unteren Bereich des Fensters "Package Manager" links in der Statusleiste angezeigt.
es: La cantidad de paquetes actualmente mostrados en el panel de la lista de paquetes y la cantidad de paquetes seleccionados se muestran en el margen izquierdo de la barra de estado que se encuentra en la parte inferior de la ventana de Package Manager.
ja: パッケージリスト区画に現在表示されているパッケージの数および選択されているパッケージの数が、パッケージマネージャーウィンドウ下部のステータスバーの左側に表示されます。
ko: 현재 패키지 목록 창에 나열된 패키지 수와 선택된 패키지 수가 패키지 관리자 창 아래쪽에 있는 상태 표시줄 왼쪽에 표시됩니다.
zh_hk: 套裝軟體清單窗格中目前列出的套裝軟體數目以及選取的套裝軟體數目，都會顯示在 [套裝軟體管理員] 視窗底部的狀態列左邊。

source: Select the <menuchoice><guimenu>Publisher</guimenu><guimenuitem>All Publishers</guimenuitem></menuchoice> option, the <guimenuitem>All Categories</guimenuitem> category, and the <menuchoice><guimenu>View</guimenu><guimenuitem>Selected Packages</guimenuitem></menuchoice> option to list all selected packages from all publishers in the package list pane.
de: Wählen Sie die Option <menuchoice><guimenu>Herausgeber</guimenu><guimenuitem>Alle Herausgeber</guimenuitem></menuchoice>, dann die Kategorie <guimenuitem>Alle Kategorien</guimenuitem> und schließlich die Option <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Ausgewählte Pakete</guimenuitem></menuchoice>, um alle Pakete von allen Herausgebern im Paketlistenbereich aufzuführen.
es: Seleccione la opción <menuchoice><guimenu>Editor</guimenu><guimenuitem>Todos los editores</guimenuitem></menuchoice> y, luego, la categoría <guimenuitem>Todas las categorías</guimenuitem> y la opción <menuchoice><guimenu>Ver</guimenu><guimenuitem>Paquetes seleccionados</guimenuitem></menuchoice> para mostrar todos los paquetes seleccionados de todos los editores en el panel de la lista de paquetes.
ja: <menuchoice><guimenu>「発行元」</guimenu><guimenuitem>「すべての発行元」</guimenuitem></menuchoice>オプション、<guimenuitem>「すべてのカテゴリ」</guimenuitem>カテゴリ、および<menuchoice><guimenu>「表示」</guimenu><guimenuitem>「選択したパッケージ」</guimenuitem></menuchoice>オプションを選択すると、すべての発行元のパッケージで、選択されているものがすべてパッケージリスト区画に表示されます。
ko: 패키지 목록 창의 모든 게시자로부터 선택된 패키지를 모두 나열하려면 <menuchoice><guimenu>게시자</guimenu><guimenuitem>모든 게시자</guimenuitem></menuchoice> 옵션을 선택하고 <guimenuitem>모든 범주</guimenuitem> 범주, <menuchoice><guimenu>보기</guimenu><guimenuitem>선택된 패키지</guimenuitem></menuchoice> 옵션을 선택합니다.
zh_hk: 選取 <menuchoice>[<guimenu>發佈者</guimenu>] [<guimenuitem>所有發佈者</guimenuitem>]</menuchoice> 選項、[<guimenuitem>所有類別</guimenuitem>] 類別，以及 <menuchoice>[<guimenu>檢視</guimenu>] [<guimenuitem>選取的套裝軟體</guimenuitem>]</menuchoice> 選項，即可在套裝軟體清單窗格中列出所有發佈者的所有選取的套裝軟體。

source: A package can be highlighted but not selected. When a package is highlighted, detailed information about that package is displayed in the package details pane below the package list pane. When a package is selected, a check mark displays in the box to the left of the package name. If you want to install, update, or delete a package, make sure a check mark appears in the selection box for that package.
de: Ein Paket kann markiert aber nicht ausgewählt werden. Wenn ein Paket markiert ist, werden Informationen zu diesem Paket im Paketinformationsbereich unterhalb des Paketlistenbereichs angezeigt. Wenn ein Paket ausgewählt ist, wird ein Häkchen im Kontrollkästchen links neben dem Paketnamen angezeigt. Wenn Sie ein Paket installieren, aktualisieren oder löschen möchten, muss das Kontrollkästchen für dieses Paket ein Häkchen enthalten.
es: Un paquete se puede resaltar pero no se puede seleccionar. Cuando se resalta un paquete, la información detallada sobre se paquete se muestra en el panel de detalles del paquete debajo del panel de la lista de paquetes. Cuando se selecciona un paquete, aparece una marca de verificación en el cuadro ubicado a la izquierda del nombre del paquete. Si desea instalar, actualizar o suprimir un paquete, asegúrese de que aparezca una marca de verificación en el cuadro de selección de ese paquete.
ja: パッケージは強調表示されていても、選択されていない場合があります。パッケージが強調表示されている場合、パッケージリスト区画の下にあるパッケージの詳細区画に、そのパッケージに関する詳細情報が表示されます。パッケージが選択されている場合、パッケージ名の左にあるボックスにチェックマークが表示されます。パッケージのインストール、更新、または削除を行う場合は、そのパッケージの選択ボックスにチェックマークが表示されていることを確認してください。
ko: 패키지가 강조 표시될 수 있지만 선택되지 않습니다. 패키지가 강조 표시되면 해당 패키지에 대한 세부 정보가 패키지 목록 창 아래의 패키지 세부 정보 창에 표시됩니다. 패키지가 선택되면 패키지 이름 왼쪽의 상자에 확인 표시가 나타납니다. 패키지를 설치, 업데이트 또는 삭제하려면 해당 패키지에 대한 선택 상자에 확인 표시가 나타나는지 확인합니다.
zh_hk: 您可以將套裝軟體反白顯示而非選取。將套裝軟體反白顯示時，套裝軟體清單窗格下方的套裝軟體詳細資訊窗格會顯示與該套裝軟體有關的詳細資訊。選取套裝軟體時，套裝軟體名稱左邊的方塊中會顯示一個核取標記。如果您想要安裝、更新或刪除套裝軟體，請確定該套裝軟體的選取方塊中有顯示核取標記。

source: Installing and Updating Packages
de: Installieren und Aktualisieren der Paketen
es: Instalación y actualización de paquetes
ja: パッケージのインストールと更新
ko: 패키지 설치 및 업데이트
zh_hk: 安裝及更新套裝軟體
