Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: Start the Package Manager from the command-line along with a path to the <filename>.p5i</filename> file. For example, type the following command at the command-line:
ca: Inicieu el Gestor de Paquets des de la línia de comandes juntament amb la ruta del fitxer <filename>.p5i</filename>. Per exemple, escriviu la següent comanda a l'intèrpret de comandes:
cs: Spusťe Správce Balíčků z příkazové řádky společně s cestou k <filename>.p5i</filename> souboru. Například, napište následující příkaz:
ru: Запустите диспетчер пакетов из командной строки вместе с путем к файлу <filename>.p5i</filename>. Например, введите в командной строке следующую команду:

source: path_to_p5i_file/file.p5i
ca: ruta_al_fitxer_p5i/fitxer.p5i
cs: cesta_k_p5i_souboru/file.p5i
ru: путь_к_файлу_p5i/файл.p5i

source: Click on a URL location that contains a link to <filename>.p5i</filename> file. If you are using this method to start WebInstall, the <filename>.p5i</filename> file <emphasis role="strong">must</emphasis> be located on a web server that has registered the new mime type. Only then, the web server can manage the <filename>.p5i</filename> automatically and start Package Manager in WebInstall mode.
ca: Cliqueu en la localització de la URL que conté l'enllaç al fitxer <filename>.p5i</filename>. Si esteu utilitzant aquest mètode per iniciar WebInstall, el fitxer <filename>.p5i</filename> <emphasis role="strong">obligatòriament</emphasis> ha d'estar localitzat en un servidor web que tingui registrat el nou tipus MIME. Únicament aleshores, el servidor web pot gestionar automàticament el fitxer <filename>.p5i</filename> i iniciar el Gestor de paquets en mode WebInstall.
cs: Klikněte na URL, které obsahuje odkaz na <filename>.p5i</filename> soubor. Pokud používáte tento způsob spuštění procesu WebInstalace, <filename>.p5i</filename> soubor <emphasis role="strong">musí</emphasis> být umístěn na webovém serveru, pro který je registrován nový mime typ. Pouze tehdy může webový server spravovat <filename>.p5i</filename> soubory automaticky a spouštět Správce Balíčků v módu WebInstalace.
ru: Щелкните адрес URL, содержащий ссылку на файл <filename>.p5i</filename>. Если для запуска веб-установки используется этот способ, файл <filename>.p5i</filename> <emphasis role="strong">непременно</emphasis> должен располагаться на веб-сервере, на котором зарегистрирован новый тип MIME. Только в этом случае возможна автоматическая обработка файла <filename>.p5i</filename> на стороне сервера и запуск диспетчера пакетов в режиме веб-установки.

source: If the <filename>.p5i</filename> is located on a web server that does not have the new mime type registered, save the <filename>.p5i</filename> file to your desktop and then click on it to launch Web Install.
ca: Si el <filename>.p5i</filename> està localitzat a un servidor web que no té registrat el nou tipus mime, deseu el fitxer <filename>.p5i</filename> al vostre escriptori i cliqueu-lo per a llançar la Instal·lació Web.
cs: Pokud je <filename>.p5i</filename> umístěn na webovém serveru, který nemá registrovaný nový mime typ, uložte <filename>.p5i</filename> soubor na Váš systém a klikněte na něj pro spuštění WebInstalace.
ru: Если файл <filename>.p5i</filename> расположен на веб-сервере, на котором не зарегистрирован новый тип MIME, файл <filename>.p5i</filename> следует сохранить на рабочем столе, а затем щелкнуть его для запуска веб-установки.

source: You will see a window similar to the example window shown below. The window shows a list of publishers that will be added and the packages that will be installed. Review the information.
ca: Veureu una finestra similar a la mostrada en la següent imatge. La finestra mostra el llistat dels publicadors que poden ser afegits, i els paquets que seran instal·lats. Reviseu la informació.
cs: Objeví se okno podobné jako je na příkladu uvedeném níže. Okno zobrazí seznam vydavatelů, kteří budou přidáni a seznam balíčků, které budou nainstalovány.
ru: Откроется окно, пример которого приведен ниже. В этом окне выводится список добавляемых издателей и устанавливаемых пакетов. Проверьте эти данные.

source: Confirm or cancel the WebInstall process.
ca: Confirmeu o cancel·leu el procés d'Instal·lador Web
cs: Potvrzení nebo Zrušení procesu WebInstalace.
ru: Подтверждение или отмена процесса веб-установки.

source: Click <guibutton>Proceed</guibutton> to add the new publishers and install the packages.
ca: Cliqueu a <guibutton>Procedir</guibutton> per a afegir els nous publicadors i instal·lar els paquets.
cs: Klikněte na <guibutton>Pokračovat</guibutton> pro přidání nového vydavatele a instalaci balíčků.
ru: Нажмите кнопку <guibutton>Продолжить</guibutton> для добавления новых издателей и установки пакетов.

source: The <emphasis role="strong">Add Publisher</emphasis> dialog is displayed. The name and URI of the publisher is already entered.
ca: Es mostra el diàleg <emphasis role="strong">Afegir publicador</emphasis>. El nom i la URI del publicador ja ha estat introduït.
cs: Zobrazí se dialog <emphasis role="strong">Přidat Vydavatele</emphasis>. Jméno a URI vydavatele je již vloženo.
ru: Откроется диалоговое окно <emphasis role="strong">Добавление издателя</emphasis>. Имя издателя и его идентификатор URI уже введены.

source: The <emphasis role="strong">Adding Publisher Complete</emphasis> dialog is displayed if the publisher has been added successfully.
ca: El diàleg <emphasis role="strong">Completat afegint publicador</emphasis> és mostrat si el publicador va ser afegit de forma correcta.
cs: Zobrazí se dialog <emphasis role="strong">Přidávání vydavatele dokončeno</emphasis>, pokud byl vydavatel přidán úspěšně.
ru: В случае успешного добавления издателя открывается диалоговое окно <emphasis role="strong">Добавление издателя завершено</emphasis>.

source: (Optional) If the publishers to be added are secure publishers, an SSL key and certificate is required. Browse to locate the SSL Key and SSL Certificate on your system.
ca: (Opcional) Si els publicadors a ser afegits són publicadors segurs, es necessita una clau i certificat SSL. Navegueu per a localitzar al vostre sistema la clau i el certificat SSL.
cs: (Volitelné) Pokud se jedná o zabezpečeného vydavatele, je vyžadován SSL klíč a certifikát. Klikněte na Procházet pro nalezení SSL klíče a SSL Certifikátu na Vašem systému.
ru: (Необязательно) Если добавляемые издатели являются защищенными, требуются ключ и сертификат SSL. Для поиска ключа и сертификата SSL в системе можно воспользоваться функцией обзора.

source: Click <guibutton>OK</guibutton> to proceed.
ca: Cliqueu <guibutton>D'acord</guibutton> per a procedir.
cs: Klikněte na <guibutton>OK</guibutton> pro pokračování.
ru: Для продолжения нажмите кнопку<guibutton>OK</guibutton>.

source: If packages are being installed, the <emphasis role="strong">Install/Update</emphasis> dialog is displayed.
ca: Si els paquets estan sent instal·lats, es mostra el diàleg <emphasis role="strong">Instal·lar/Actualitzar</emphasis>.
cs: Pokud se budou instalovat balíčky, zobrazí se dialog <emphasis role="strong">Instalovat/Aktualizovat</emphasis>
ru: Если выполняется установка пакетов, выводится диалоговое окно <emphasis role="strong">Установка/обновление</emphasis>.

source: The application will close when all packages are installed.
ca: L'aplicació es tancarà quan tots els paquets etiguin instal·lats.
cs: Aplikace se zavře po dokončení instalace balíčků.
ru: После установки всех пакетов приложение закрывается.

source: Using WebInstall With a Disabled Publisher
ca: Utilitzant WebInstall amb un publicador deshabilitat
cs: Použití WebInstalace se Zakázaným Vydavatelem
ru: Использование веб-установки при отключенном издателе

source: Sometimes a <filename>.p5i</filename> file may contain packages from a disabled publisher. In such cases WebInstall opens up an <emphasis role="strong">Enable Publisher</emphasis> dialog which allows the user to enable the publisher before installing packages.
ca: Alguns cops el fitxer <filename>.p5i</filename> pot contenir paquets des d'un publicador deshabilitat. En aquest cas WebInstall obre un diàleg <emphasis role="strong">Habilitar publicador</emphasis> el qual permet a l'usuari habilitar el publicador abans de la instal·lació dels paquets.
cs: Občas může <filename>.p5i</filename> soubor obsahovat balíčky ze zakázaného vydavatele. V tomto případě WebInstalace otevře dialog <emphasis role="strong">Povolit Vydavatele</emphasis>, který umožní uživateli povolit vydavatele před instalací balíčků.
ru: Иногда в файл <filename>.p5i</filename> могут быть включены пакеты от отключенного издателя. В таких случаях в ходе веб-установки открывается диалоговое окно <emphasis role="strong">Включить издателя</emphasis>, позволяющее пользователю включить издателя перед установкой пакетов.

source: Working With the Update Manager
ca: Treballant amb el Gestor d'Actualitzacions
cs: Pracujeme se Správcem Aktualizací
ru: Работа с диспетчером обновлений

source: About The Update Manager
ca: Quant al Gestor d'Actualitzacions
cs: O Správci Aktualizací
ru: О диспетчере обновлений

source: The Update Manager is a separate application that starts from the desktop when updates to the installed packages are available in the publisher.
ca: El Gestor d'actualitzacions és una aplicació separada que s'inicia des de l'escriptori quan hi han actualitzacions disponibles pels paquets en del publicador.
ru: Диспетчер обновлений является отдельным приложением, которое запускается с рабочего стола, когда в издателе доступны обновления для установленных пакетов.

source: Update Manager Main Window
ca: Finestra principal del Gestor d'Actualitzacions
cs: Hlavní okno Správce aktualizací
ru: Главное окно диспетчера обновлений

source: You can use the Update Manager application to update the installed packages in your image. The Update Manager uses the publisher that is currently set in the Package Manager to install the latest image.
ca: Podeu utilitzar l'aplicació del Gestor d'actualitzacions per a instal·lar els paquets de la vostra imatge. El gestor d'actualitzacions utilitza el publicador que actualment està establert en el Gestor de paquets per a actualitzar a l'última imatge.
ru: Диспетчер обновлений можно использовать для обновления пакетов, установленных в образе. Для установки последнего образа используется издатель, настроенный в диспетчере пакетов в текущий момент.

source: For the OpenSolaris 2010.03 release, the Update Manager updates <emphasis role="strong">all</emphasis> installed packages in the image. This action is equivalent to running the <command>pkg image-update</command> command from the command-line.
ca: Pel llançament d'OpenSolaris 2010.03, el Gestor d'actualitzacions, actualitza <emphasis role="strong">tots</emphasis> els paquets instal·lats en la imatge. Aquesta acció és equivalent a l'execució de la comanda <command>pkg image-update</command> des de la línia de comandes.
ru: В выпуске ОС OpenSolaris 2010.03 диспетчер обновлений используется для обновления <emphasis role="strong">всех</emphasis> пакетов, установленных в образе. Это действие эквивалентно запуску команды <command>pkg image-update</command> в командной строке.

source: Using the Update Manager
ca: Utilitzant el Gestor d'Actualitzacions
cs: Používáme Správce aktualizací
ru: Использование диспетчера обновлений

source: When updates are available to the installed packages, a notification icon is displayed in the notification panel on the OpenSolaris desktop.
ca: Quan hi han actualitzacions disponibles per als paquets instal·lats, una icona de notificació ésmostrada al panell de notificacions de l'escriptori d'OpenSolaris.
cs: Pokud jsou aktualizace dostupné pro nainstalované balíčky, zobrazí se upozorňující ikona v panelu na ploše OpenSolarisu.
ru: Когда для установленных пакетов появляются обновления, в панели уведомленийна рабочем столе OpenSolaris выводится значок уведомления.

source: You can also click <menuchoice><guimenu>System</guimenu><guisubmenu>Administration</guisubmenu><guimenuitem>Update Manager</guimenuitem></menuchoice> to manually launch the Update Manager.
ca: També podeu clicar a <menuchoice><guimenu>Sistema</guimenu><guisubmenu>Administratició</guisubmenu><guimenuitem>Gestor d'Actualitzacions</guimenuitem></menuchoice> per a llaçar manualment el Gestor d'Actualitzacions.
cs: Pro ruční spuštění Správce aktualizací můžete kliknout na <menuchoice><guimenu>Systém</guimenu><guisubmenu>Administrace</guisubmenu><guimenuitem>Správce aktualizací</guimenuitem></menuchoice>
ru: Можно также выбрать в меню пункты <menuchoice><guimenu>Система</guimenu><guisubmenu>Администрирование</guisubmenu><guimenuitem>Диспетчер обновлений</guimenuitem></menuchoice> для запуска диспетчера обновлений вручную.

source: When you are notified of a software update, perform the following steps to begin the process of updating your system:
ca: Quan sigueu notificat d'una actualització de programari, realitzeu els següents pasos per a començar el procés d'actualització del vostre sistema:
cs: Pokud jste upozorněni o aktualizaci softwaru, proveďte následující kroky pro začátek procesu aktualizace systému:
ru: В случае получения уведомления об обновлении программного обеспечения необходимо предпринять следующие действия для запуска процесса обновления системы:

source: Click the notification icon on the desktop to display the <emphasis role="strong">Update Manager</emphasis> window.
ca: Cliqueu a la icona de notificació de l'escriptori per a mostrar la finestra del <emphasis role="strong">Gestor d'actualitzacions</emphasis>.
ru: Щелкните значок уведомления на рабочем столе для открытия окна <literal>Диспетчер обновлений</literal>.

source: Click <guibutton>Update All</guibutton> in the <emphasis role="strong">Update Manager</emphasis> window.
ca: Cliqueu a <guibutton>Actualitzar tot</guibutton> en la finestra del <emphasis role="strong">Gestor de paquets</emphasis>.
ru: Нажмите кнопку <guibutton>Обновить все</guibutton> в окне <emphasis role="strong">Диспетчер обновлений</emphasis>.

source: Select a package and click the <guilabel>Details</guilabel> panel if you want to view more information about the package.
ca: Seleccioneu un paquet i cliqueu al panell <guilabel>Detalls</guilabel> si voleu visualitzar més informació quant al paquet.
cs: Vyberte balíček a klikněte na panel <guilabel>Podrobnosti</guilabel> pokud si přejete zobrazit informace o balíčku.
ru: Выберите пакет и нажмите панель <guilabel>Подробные данные</guilabel> для получения дополнительной информации о пакете.

source: The <emphasis role="strong">Update All</emphasis> dialog is displayed. Proceed with the Update All process or cancel the action.
ca: es mostra el diàleg <emphasis role="strong">Actualitzar tot</emphasis>. Procediu amb el procés d'actualització de tots els paquets, o bé cancel·leu l'acció.
ru: Откроется диалоговое окно <emphasis role="strong">Обновить все</emphasis>. Можно либо продолжить процесс обновления всех пакетов, либо отменить это действие.

source: Click <guibutton>Proceed</guibutton> to create a new boot environment and update all packages in the current image.
ca: Cliqueu <guibutton>Procedir</guibutton> per a crear un nou entorn d'arranc i actualitzar tots els paquets de la imatge actual.
cs: Klikněte na <guibutton>Pokračovat</guibutton> pro vytvoření nového bootovacího prostředí a aktualizujte všechny balíčky na Vašem systému.
ru: Нажмите кнопку <guibutton>Продолжить</guibutton> для создания новой среды загрузки и обновления всех пакетов в текущем образе.

source: During the Update All process, a clone of the active boot environment is created. This clone enables the user to boot into the boot environment state that existed before the Update All process was started.
ca: Durant el procés d'Actualitzar tot, un clon de l'actual entorn d'arranc és creat. Aquest clon permet a l'usuari arrancar amb l'estat d'entorn que existia abans que el procés d'Actualitzar tot fos iniciat.
cs: V průběhu procesu aktualizace se vytvoří klon aktivního bootovacího prostředí, který Vám umožní nabootovat do stavu systému, který existoval před aktualizací celého systému.
ru: Во время выполнения команды "Обновить все" создается клон активной загрузочной среды. Данный клон позволяет пользователю загрузится в состояние загрузочной среды, которая существовала до начала процесса "Обновить все".

source: If the Package Manager is unable to create a new boot environment, an error message will be displayed. See the <xref linkend="gileh"/> section on how to rectify the error and continue with updating your image.
ca: Si el Gestor de Paquets no pot crear el nou entorn d'arranc, es mostrarà un missatge d'error. Vegeu la <xref linkend="gileh"/> secció de com rectificar un error i continuar amb l'actualització de la vostra imatge.
cs: Pokud Správce balíčků nemůže vytvořit nové bootovací prostředí, zobrazí se chybová zpráva. Viz sekce <xref linkend="gileh"/> jak opravit chybu a pokračovat v aktualizaci obrazu.
ru: Если диспетчер пакетов не может создать новую загрузочную среду, выводится сообщение об ошибке. См. раздел <xref linkend="gileh"/> об исправлении ошибки и продолжении обновления образа.

source: A name for the new boot environment is automatically generated. You can accept the name generated by the system, or provide your own name for the boot environment.
ca: Automàticament és general el nom pel nou Entorn d'Arranc. Podeu acceptar el nom generat pel sistema, o proporcionar el vostre nom per a l'entorn d'arranc.
cs: Jméno nového bootovacího prostředí se vygeneruje automaticky. Můžete přijmout jméno vygenerované systémem nebo vložit vlastní jméno pro toto prostředí.
ru: Название для новой загрузочной среды создается автоматически. Можно либо принятьавтоматически сгенерированное название, либо указать собственное название для среды загрузки.

source: Click <guibutton>Cancel</guibutton> to cancel the process.
ca: Cliqueu <guibutton>Cancel·lar</guibutton> per a cancel·lar el procés.
cs: Klikněte na tlačítko <guibutton>Zrušit</guibutton> pro zrušení procesu.
ru: Нажмите кнопку <guibutton>Отмена</guibutton> для отмены процесса.

source: If you chose to proceed, the <emphasis role="strong">Installing Updates</emphasis> windows are displayed. The package installation process consists of four stages:
ca: Si seleccioneu procedir, es mostra la finestra <emphasis role="strong">Instal·lant actualitzacions</emphasis>. El procés d'instal·lació dels paquets consisteix de quatre etapes:
ru: В случае выбора продолжения работы открываются окна<emphasis role="strong">Установка обновлений</emphasis>. В процессе установки пакетов можно выделить четыре этапа:

source: Prepare
ca: Preparar
cs: Příprava
ru: Подготовка

source: Download.
ca: Descarregar.
cs: Stahování.
ru: Загрузка

source: Install.
ca: Instal·lar.
cs: Instalace.
ru: Установка

source: You can choose to cancel the process only during the <emphasis role="strong">Prepare</emphasis> and <emphasis role="strong">Download</emphasis> stages.
ca: Podeu cancel·lar el procés únicament durant les etapes de <emphasis role="strong">Preparació</emphsis> i de <emphasis role="strong">Descàrrega</emphasis>.
cs: Proces můžete zrušit během fáze <emphasis role="strong">Příprava</emphasis> a <emphasis role="strong">Stahování</emphasis>.
ru: Отмена процесса возможна только на этапах <emphasis role="strong">Подготовка</emphasis> и <emphasis role="strong">Загрузка</emphasis>.

source: Click the <guilabel>Details</guilabel> panel to view more information about each of the installation processes.
ca: Clique al panell de <guilabel>Detalls</guilabel> per a visualitzar més informació quant a cada procés de la instal·lació.
cs: Klikněte na panel <guilabel>Detaily</guilabel> pro zobrazení informací o instalačním procesu.
ru: Щелкните панель <guilabel>Подробные сведения</guilabel> для просмотра дополнительной информации о каждом из процессов установки.

source: If an error occurs during any of the stages, the <guilabel>Details</guilabel> panel is expanded and the details of the error are displayed. An error status indicator is shown next to the failed stage.
ca: Si es produeix un error durant qualsevol etapa, s'expandirà el panell de <guilabel>Detalls</guilabel> i es mostraran els detalls de l'error. Un indicador d'error d'estat es mostrat a prop de l'etapa que ha produït l'error.
cs: Pokud se v některé fázi vyskytne chyba, zobrazí se panel <guilabel>Podrobnosti</guilabel> s podrobnostmi o vzniklé chybě. Ukazatel stavu chyby se zobrazí vedle fáze, která selhala.
ru: В случае возникновения ошибки на любом из этапов открывается панель<guilabel>Подробные сведения</guilabel> и отображается подробная информация об ошибке. Индикатор статуса ошибки отображается рядом с неудачным этапом.

source: Read the <xref linkend="release_notes"/> before rebooting your system.
ca: Llegiu <xref linkend="release_notes"/> abans de reiniciar el vostre sistema.
cs: Přečtěte si <xref linkend="release_notes"/> před restartováním systému.
ru: До перезагрузки системы прочитайте документ <xref linkend="release_notes"/>.

source: You must reboot your system for the changes to take effect.
ca: Heu de reiniciar el vostre sistema per a que els canvis tinguin efecte.
cs: Aby se změny projevily, musíte restartovat Váš systém.
ru: Для вступления изменений в силу необходимо перезагрузить систему.

source: A new boot environment clone <emphasis role="strong">must</emphasis> be created for the Update All process to be completed. The following error message is displayed if a boot environment clone cannot be created due to space restrictions :
ca: És <emphasis role="strong">obligatori</emphasis> crear un nou entorn d'arranc clonat per a que es pugui completar el procés d'Actualitzar tot. El següent missatge d'error es mostrat si un clon de l'entorn d'arranc no pot crear-se degut a restriccions d'espai :
cs: <emphasis role="strong">Musí</emphasis> být vytvořen nový klon bootovacího prostředí pro dokončení procesu aktualizace všech balíčků. Zobrazí se následující chyba, pokud klon bootovacího prostředí nemůže být vytvořen kvůli nedostatku místa na disku:
ru: Для завершения процесса "Обновить все" <emphasis role="strong">необходимо </emphasis> создатьновый клон загрузочной среды. Если клон загрузочной среды создать невозможно из-за недостатка дискового пространства, отображается следующее сообщение об ошибке:

source: <literal>Not enough disk space, the Update All action cannot be performed. Choose Manage BE to manage your boot environments and free up disk space</literal>.
ru: <literal>Недостаточно дискового пространства, выполнение обновления невозможно. Выберите "Управление загрузочными средами" и примите меры к высвобождению дискового пространства посредством управления загрузочными средами.</literal>.

source: Click <guibutton>Manage BE</guibutton> in the error dialog to go to the <emphasis role="strong">Manage Boot Environments</emphasis> dialog.
ca: Cliqueu a <guibutton>Gestionar entorns d'arranc</guibutton> en el diàleg d'error per anar a diàleg <emphasis role="strong">Gestionar entons d'arranc</emphasis>.
cs: Klikněte na <guibutton>Správa BE</guibutton> v chybovém dialogu a přejděte do okna <emphasis role="strong">Správa Bootovacích Prostředí</emphasis>
ru: Нажмите кнопку <guibutton>Управление загрузочными средами</guibutton> в диалоговом окне с сообщением об ошибке и перейдите к диалоговому окну <emphasis role="strong">Управление загрузочными средами</emphasis>.
