Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: Click <menuchoice><guisubmenu>File</guisubmenu><guimenuitem>Export Selections</guimenuitem></menuchoice> to display the Export Selections Confirmation window.
de: Klicken Sie auf <menuchoice><guisubmenu>Datei</guisubmenu><guimenuitem>Auswahl exportieren</guimenuitem></menuchoice>, um das Fenster "Bestätigung des Exports der Auswahl" anzuzeigen.
es: Haga clic en <menuchoice><guisubmenu>Archivo</guisubmenu><guimenuitem>Exportar selecciones</guimenuitem></menuchoice> para mostrar la ventana Confirmación de Exportar selecciones.
ja: <menuchoice><guisubmenu>「ファイル」</guisubmenu><guimenuitem>「選択項目をエクスポート」</guimenuitem></menuchoice>をクリックして「エクスポート選択項目の確認」ウィンドウを表示します。
ko: <menuchoice><guisubmenu>파일</guisubmenu><guimenuitem>선택 항목 내보내기</guimenuitem></menuchoice>를 눌러 선택 항목 내보내기 확인 창을 표시합니다.
zh_hk: 按一下 <menuchoice>[<guisubmenu>檔案</guisubmenu>] [<guimenuitem>輸出選擇</guimenuitem>]</menuchoice>，顯示 [輸出選擇確認] 視窗。

source: Click the <guibutton>OK</guibutton> button to confirm the selections. The Export Selections window is displayed.
de: Klicken Sie auf die Schaltfläche <guibutton>OK</guibutton>, um die Auswahl zu bestätigen. Das Fenster "Auswahl exportieren" wird angezeigt.
es: Haga clic en el botón <guibutton>Aceptar</guibutton> para confirmar las selecciones. Aparece la ventana Exportar selecciones.
ja: <guibutton>「了解」</guibutton>ボタンをクリックして選択項目を確定します。「選択項目をエクスポート」ウィンドウが表示されます。
ko: <guibutton>확인</guibutton> 버튼을 눌러 선택 항목을 확인합니다. 선택 항목 내보내기 창이 표시됩니다.
zh_hk: 按一下 [<guibutton>確定</guibutton>] 按鈕以確認選項。會顯示 [輸出選擇] 視窗。

source: A default name for the <filename>p5i</filename> file with the extension <filename>.p5i</filename> is provided. You can change this file name, but do not change the extension.
de: Für die Datei <filename>p5i</filename> wird ein Standardname mit der Erweiterung <filename>.p5i</filename> vorgegeben. Sie können diesen Dateinamen ändern. Ändern Sie jedoch nicht die Erweiterung.
es: Se proporciona un nombre predeterminado para el archivo <filename>p5i</filename> con la extensión <filename>.p5i</filename>. Puede cambiar este nombre de archivo, pero no puede cambiar la extensión.
ja: <filename>p5i</filename> ファイルのデフォルト名が拡張子 <filename>.p5i</filename> を付けて提示されます。このファイル名は変更できますが、拡張子は変更しないでください。
ko: 확장자가 <filename>.p5i</filename>인 <filename>p5i</filename> 파일의 기본 이름이 제공됩니다. 이 이름은 변경할 수 있지만 확장자는 변경할 수 없습니다.
zh_hk: 系統會提供副檔名為 <filename>.p5i</filename> 的 <filename>p5i</filename> 檔案預設名稱。您可以變更此檔案名稱，但不可變更副檔名。

source: A default location for the <filename>p5i</filename> file is provided. You can change the location. If you use the <guibutton>Browse</guibutton> button, you can select the <filename>p5i Files</filename> option from the drop-down menu at the bottom right hand side of the Export Selections window to display only <filename>.p5i</filename> files in the file list.
de: Für die Datei <filename>p5i</filename> wird ein Standardspeicherort vorgegeben. Sie können diesen ändern. Klicken Sie auf die Schaltfläche <guibutton>Durchsuchen</guibutton>, um im Dropdown-Menü im unteren rechten Bereich des Fensters "Auswahl exportieren" die Option <filename>p5i-Dateien</filename> auszuwählen und so nur die <filename>.p5i</filename>-Dateien in der Dateiliste anzuzeigen.
es: Se proporciona una ubicación predeterminada para el archivo <filename>p5i</filename>. Puede cambiar la ubicación. Si utiliza el botón <guibutton>Buscar</guibutton>, puede seleccionar la opción <filename>Archivos p5i</filename> del menú desplegable que aparece en el margen inferior derecho de la ventana Exportar selecciones para que en la lista de archivos se muestren solamente los archivos <filename>.p5i</filename>.
ja: <filename>p5i</filename> ファイルのデフォルトの場所が提示されます。この場所は変更できます。<guibutton>「参照」</guibutton>ボタンを使用する場合は、「選択項目をエクスポート」ウィンドウの右下にあるドロップダウンメニューから<filename>「p5i ファイル」</filename>オプションを選択すると、ファイルリストに <filename>.p5i</filename> ファイルだけを表示できます。
ko: <filename>p5i</filename> 파일의 기본 위치가 제공됩니다. 위치를 변경할 수 있습니다. <guibutton>찾아보기</guibutton> 버튼을 사용할 경우 선택 항목 내보내기 창 오른쪽 아래에 있는 드롭다운 메뉴에서 <filename>p5i 파일</filename> 옵션을 선택하여 파일 목록에 <filename>.p5i</filename> 파일만 표시할 수 있습니다.
zh_hk: 系統會提供 <filename>p5i</filename> 檔案的預設位置。您可以變更該位置。如果使用 [<guibutton>瀏覽</guibutton>] 按鈕，您可以從 [輸出選擇] 視窗右下方的下拉式功能表選取 <filename>p5i Files</filename> 選項，僅在檔案清單中顯示 <filename>.p5i</filename> 檔案。

source: Click the <guibutton>Save</guibutton> button to save the file name and location.
de: Klicken Sie auf die Schaltfläche <guibutton>Speichern</guibutton>, um den Dateinamen und Speicherort zu speichern.
es: Haga clic en el botón <guibutton>Guardar</guibutton> para guardar el nombre y la ubicación del archivo.
ja: <guibutton>「保存」</guibutton>ボタンをクリックしてファイルの名前と場所を保存します。
ko: <guibutton>저장</guibutton> 버튼을 눌러 파일 이름 및 위치를 저장합니다.
zh_hk: 按一下 [<guibutton>儲存</guibutton>] 按鈕來儲存檔案名稱和位置。

source: Using WebInstall to Add Publishers and Install Packages
de: Verwenden von WebInstall zum Hinzufügen von Herausgebern und Installationspaketen
es: Uso de WebInstall para agregar editores e instalar paquetes
ja: WebInstall による発行元の追加とパッケージのインストール
ko: WebInstall을 사용하여 게시자 추가 및 패키지 설치
zh_hk: 使用 WebInstall 來增加發佈者及安裝套裝軟體

source: The WebInstall process enables you to install packages through a <filename>p5i</filename> file.
ca: El procés WebInstall us permet instal·lar paquets per mitjà del fitxer <filename>p5i</filename>.
cs: Proces WebInstalace Vám umožní instalovat balíčky skrz <filename>p5i</filename> soubor.
de: Mit dem WebInstall-Prozess können Sie Pakete mithilfe einer <filename>p5i</filename>-Datei installieren.
es: El proceso WebInstall le permite instalar paquetes mediante archivos <filename>p5i</filename>.
ja: WebInstall 処理を使用すると、<filename>p5i</filename> ファイルからパッケージをインストールすることができます。
ko: WebInstall 프로세스를 사용하면 <filename>p5i</filename> 파일을 통해 패키지를 설치할 수 있습니다.
ru: Процесс веб-установки позволяет устанавливать пакеты с помощью файла <filename>p5i</filename>.
zh_hk: WebInstall 程序可讓您透過 <filename>p5i</filename> 檔案來安裝套裝軟體。

source: Locate the <filename>.p5i</filename> file. This file might be on your desktop or on a web site.
de: Suchen Sie die <filename>.p5i</filename>-Datei. Diese Datei befindet sich u. U. auf Ihrem Desktop oder auf einer Website.
es: Ubique el archivo <filename>.p5i</filename>. El archivo puede estar en su escritorio o en un sitio web.
ja: <filename>.p5i</filename> ファイルを見つけます。このファイルは、デスクトップまたは Web サイト上に存在する場合があります。
ko: <filename>.p5i</filename> 파일을 찾습니다. 이 파일은 사용자의 데스크탑 또는 웹 사이트에 있을 수 있습니다.
zh_hk: 找出 <filename>.p5i</filename> 檔案。此檔案可能位於桌面或網站。

source: Use one of the following methods to start Package Manager in WebInstall mode:
de: Wenden Sie eine der folgenden Methoden an, um den Package Manager im WebInstall-Modus zu starten:
es: Utilice uno de los siguientes métodos para iniciar Package Manager en modo WebInstall:
ja: 次のいずれかの方法で、パッケージマネージャーを WebInstall モードで起動します。
ko: 다음 방법 중 하나로 패키지 관리자를 WebInstall 모드로 시작합니다.
zh_hk: 使用下列其中一個方法來啟動「WebInstall 模式的套裝軟體管理員」：

source: Click on a <filename>.p5i</filename> file on your desktop. The associated application (Package Manager Web Installer) is launched.
de: Klicken Sie auf Ihrem Desktop auf die <filename>.p5i</filename>-Datei. Die zugehörige Anwendung (Package Manager Web Installer) wird gestartet.
es: Haga clic en un archivo <filename>.p5i</filename> de su escritorio. Se iniciará la aplicación asociada (Instalador Web de Package Manager).
ja: デスクトップ上の <filename>.p5i</filename> ファイルをクリックします。関連付けられたアプリケーション (パッケージマネージャー Web インストーラ) が起動します。
ko: 데스크탑에서 <filename>.p5i</filename> 파일을 누릅니다. 그러면 연결된 응용 프로그램(패키지 관리자 웹 설치 프로그램)이 시작됩니다.
zh_hk: 按一下您桌面上的 <filename>.p5i</filename> 檔案，啟動關聯的應用程式 (套裝軟體管理員 Web 安裝程式)。

source: Start Package Manager from the command line along with a path to the <filename>.p5i</filename> file. For example, enter the following command:
de: Starten Sie den Package Manager über die Befehlszeile, und geben Sie den Pfad zur <filename>.p5i</filename>-Datei an. Geben Sie beispielsweise folgenden Befehl ein:
es: Inicie Package Manager desde la línea de comandos con una ruta al archivo <filename>.p5i</filename>. Por ejemplo, introduzca el siguiente comando:
ja: <filename>.p5i</filename> ファイルのパスを指定して、コマンド行からパッケージマネージャーを起動します。たとえば、次のコマンドを入力します。
ko: 명령줄에서 <filename>.p5i</filename> 파일에 대한 경로와 함께 패키지 관리자를 시작합니다. 예를 들어, 다음 명령을 입력합니다.
zh_hk: 從指令行啟動套裝軟體管理員，並附上 <filename>.p5i</filename> 檔案的路徑。例如，輸入下列指令：

source: Go to a URL location that contains a link to <filename>.p5i</filename> file. The <filename>.p5i</filename> file must be located on a web server that has registered this MIME type.
de: Rufen Sie eine URL auf, die eine Verknüpfung zu einer <filename>.p5i</filename>-Datei enthält. Die <filename>.p5i</filename>-Datei muss sich auf einem Webserver befinden, auf dem der MIME-Typ registriert ist.
es: Vaya a una ubicación URL que contenga un enlace al archivo <filename>.p5i</filename>. El archivo <filename>.p5i</filename> debe estar ubicado en un servidor web que tenga registrado este tipo MIME.
ja: <filename>.p5i</filename> ファイルへのリンクを含んでいる URL に移動します。<filename>.p5i</filename> ファイルは、この MIME タイプが登録されている Web サーバー上に存在する必要があります。
ko: <filename>.p5i</filename> 파일에 대한 링크가 있는 URL 위치로 이동합니다. <filename>.p5i</filename> 파일은 이 MIME 유형을 등록한 웹 서버에 있어야 합니다.
zh_hk: 移至包含 <filename>.p5i</filename> 檔案連結的 URL 位置。<filename>.p5i</filename> 檔案必須位於已註冊此 MIME 類型的 Web 伺服器。

source: If the <filename>.p5i</filename> is located on a web server that has not registered this MIME type, save the <filename>.p5i</filename> file to your desktop and then click on it to launch WebInstall.
de: Wenn sich die <filename>.p5i</filename>-Datei auf einem Webserver befindet, auf dem dieser MIME-Typ nicht registriert ist, speichern Sie die <filename>.p5i</filename>-Datei auf Ihrem Desktop, und klicken Sie auf sie, um WebInstall zu starten.
es: Si el archivo <filename>.p5i</filename> está ubicado en un servidor web que no tiene registrado este tipo MIME, guarde el archivo <filename>.p5i</filename> en su escritorio y luego haga clic en él para iniciar WebInstall.
ja: <filename>.p5i</filename> が、この MIME タイプが登録されていない Web サーバー上に存在する場合は、<filename>.p5i</filename> ファイルをデスクトップに保存してから、それをクリックして WebInstall を起動します。
ko: <filename>.p5i</filename>가 이 MIME 유형을 등록하지 않은 웹 서버에 있을 경우 <filename>.p5i</filename> 파일을 데스크탑에 저장한 다음 WebInstall을 눌러 시작합니다.
zh_hk: 如果 <filename>.p5i</filename> 所在的 Web 伺服器並未註冊此 MIME 類型的話，請將 <filename>.p5i</filename> 檔案儲存到您的桌面，然後按一下檔案以啟動 WebInstall。

source: The Install/Update window is displayed. The label at the top of the window is: “Package Manager Web Installer/The following will be added to your system:” Then the publishers and packages are listed. Click the <guibutton>Proceed</guibutton> button to continue with the installation.
de: Das Fenster "Installation/Update" wird angezeigt. Die Beschriftung des Fensters lautet "Package Manager Web Installer/Ihrem System wird Folgendes hinzugefügt:". Anschließend werden die Herausgeber und Pakete aufgeführt. Klicken Sie auf die Schaltfläche <guibutton>Fortfahren</guibutton>, um die Installation fortzusetzen.
es: Aparece la ventana Instalar/Actualizar. La etiqueta que se encuentra en la parte superior de la ventana es: "Instalador Web de Package Manager/Se agregará al sistema lo siguiente:" Luego, se muestran los editores y los paquetes. Haga clic en el botón <guibutton>Continuar</guibutton> para continuar con la instalación.
ja: 「インストール/更新」ウィンドウが表示されます。ウィンドウ上部のラベルは「パッケージマネージャー Web インストーラ/次のものがシステムに追加されます:」となります。次に、発行元とパッケージが一覧表示されます。<guibutton>「続行」</guibutton>ボタンをクリックしてインストールを続行します。
ko: 설치/업데이트 창이 표시됩니다. 창 위쪽에 "패키지 관리자 웹 설치 프로그램/다음의 내용들이 여러분의 시스템에 추가됩니다."라는 레이블이 표시됩니다. 그런 다음 게시자 및 패키지가 나열됩니다. <guibutton>진행</guibutton> 버튼을 눌러 설치를 계속합니다.
zh_hk: 會顯示 [安裝/更新] 視窗。視窗頂端的標籤為：[套裝軟體管理員 Web 安裝程式] / [以下所列將會增加入您的系統：]，發佈者和套裝軟體會列於其中。按一下 [<guibutton>繼續</guibutton>] 按鈕以繼續安裝。

source: If the package publisher is not already configured on your system, the Add Publisher window is displayed. The name and URI of the publisher are already entered.
de: Wenn der Paketherausgeber noch nicht auf Ihrem System konfiguriert ist, wird das Fenster "Herausgeber hinzufügen" angezeigt. Der Name und die URI des Herausgebers sind bereits eingegeben.
es: Si el editor del paquete todavía no está configurado en el sistema, aparece la ventana Agregar editor. El nombre y el URI del editor ya se introdujeron.
ja: パッケージ発行元がまだシステムに設定されていない場合は、「発行元を追加」ウィンドウが表示されます。発行元の名前と URI はすでに入力されています。
ko: 패키지 게시자가 시스템에 구성되지 않은 경우 게시자의 이름 및 URI가 이미 입력된 상태로 게시자 추가 창이 표시됩니다.
zh_hk: 如果您的系統尚未配置套裝軟體發佈者，則會顯示 [增加發佈者] 視窗。視窗中已輸入發佈者的名稱和 URI。

source: If the publishers to be added are secure publishers, an SSL key and certificate are required. Browse to locate the SSL Key and SSL Certificate on your system.
de: Wenn es sich bei den hinzuzufügenden Herausgebern um sichere Herausgeber handelt, sind ein SSL-Schlüssel sowie ein SSL-Zertifikat erforderlich. Durchsuchen Sie das System nach dem SSL-Schlüssel und SSL-Zertifikat.
es: Si los editores que se van a agregar son editores seguros, se necesita una clave y un certificado SSL. Búsquelos en el sistema.
ja: 追加した発行元がセキュリティー保護された発行元ならば、SSL キーと証明書が必要です。システム上にある SSL キーと SSL 証明書を参照してください。
ko: 추가할 게시자가 보안 게시자일 경우 SSL 키 및 인증서가 필요합니다. 찾아보기를 눌러 시스템에서 SSL 키 및 SSL 인증서를 찾습니다.
zh_hk: 如果要增加的發佈者是安全的發佈者，則必須提供 SSL 金鑰和憑證。請瀏覽至系統上 SSL 金鑰和 SSL 憑證所在的位置。

source: The Adding Publisher Complete dialog displays if the publisher is added successfully. Click the <guibutton>OK</guibutton> button to continue with the installation.
de: Das Dialogfeld "Hinzufügen des Herausgebers abgeschlossen" wird angezeigt, wenn der Herausgeber erfolgreich hinzugefügt wurde. Klicken Sie auf die Schaltfläche <guibutton>OK</guibutton>, um die Installation fortzusetzen.
es: Si el nuevo editor se ha agregado correctamente, aparecerá el cuadro de diálogo Agregar editor completado. Haga clic en el botón <guibutton>Aceptar</guibutton> para continuar con la instalación.
ja: 発行元が正常に追加されると、「発行元を追加しました」ダイアログが表示されます。<guibutton>「了解」</guibutton>ボタンをクリックしてインストールを続行します。
ko: 게시자가 성공적으로 추가된 경우 게시자 추가 완료 대화 상자가 표시됩니다. <guibutton>확인</guibutton> 버튼을 눌러 설치를 계속합니다.
zh_hk: [增加發佈者完成] 對話方塊顯示發佈者是否新增成功。按一下 [<guibutton>確定</guibutton>] 按鈕以繼續安裝。

source: If a <filename>.p5i</filename> file contains packages from a disabled publisher, WebInstall opens up an Enable Publisher dialog. Use this dialog to enable the publisher so that you can install the packages.
de: Wenn die Datei <filename>.p5i</filename> Pakete von einem deaktivierten Herausgeber enthält, öffnet WebInstall das Dialogfeld "Herausgeber aktivieren". Aktivieren Sie in diesem Dialogfeld den Herausgeber, um die Pakete installieren zu können.
es: Si un archivo <filename>.p5i</filename> contiene paquetes de un editor inhabilitado, WebInstall abre el cuadro de diálogo Habilitar editor. Utilice este cuadro de diálogo para habilitar al editor y usted pueda instalar los paquetes.
ja: <filename>.p5i</filename> ファイルが無効な発行元からのパッケージを含んでいる場合、WebInstall は「発行元の有効化」ダイアログを開きます。このダイアログを使用して、パッケージをインストールできるように発行元を有効にします。
ko: <filename>.p5i</filename> 파일에 사용 안함으로 설정된 게시자의 패키지가 있을 경우 WebInstall이 게시자 사용 대화 상자를 엽니다. 이 대화 상자에서 패키지를 설치할 수 있도록 게시자를 사용으로 설정할 수 있습니다.
zh_hk: 如果 <filename>.p5i</filename> 檔案包含來自停用發佈者的套裝軟體，WebInstall 會開啟 [啟用發佈者] 對話方塊。請使用此對話方塊來啟用發佈者，便能安裝套裝軟體。

source: The Install/Update window now looks the same as when you select <guibutton>Install/Update</guibutton> from within Package Manager.
de: Die Anzeige im Fenster "Installation/Update" stimmt nun mit der Anzeige überein, die zu sehen ist, wenn Sie das Fenster <guibutton>Installation/Update</guibutton> über den Package Manager öffnen.
es: Ahora, la ventana Instalar/Actualizar se verá igual que cuando selecciona <guibutton>Instalar/Actualizar</guibutton> desde Package Manager.
ja: この時点で「インストール/更新」ウィンドウの表示は、パッケージマネージャー内から<guibutton>「インストール/更新」</guibutton>を選択したときと同じになります。
ko: 패키지 관리자에서 <guibutton>설치/업데이트</guibutton>를 선택할 때와 동일하게 설치/업데이트 창이 표시됩니다.
zh_hk: [安裝/更新] 視窗現在的外觀與您選取套裝軟體管理員的 [<guibutton>安裝/更新</guibutton>] 時一樣。

source: Troubleshooting
de: Fehlerbehebung
es: Resolución de problemas
ja: トラブルシューティング
ko: 문제 해결
zh_hk: 疑難排解

source: Error, warning, and informational messages are saved to a log so that you can review them at any time.
de: Fehler-, Warn- und Informationsmeldungen werden in einem Protokoll gespeichert, das Sie jederzeit einsehen können.
es: Los mensajes informativos, de error y de advertencia se guardan en un registro para que pueda revisarlos en cualquier momento.
ja: エラー、警告、および情報メッセージは、いつでも確認できるようにログに保存されます。
ko: 언제든지 검토할 수 있도록 오류, 경고 및 정보 메시지가 로그에 저장됩니다.
zh_hk: 錯誤、警告及資訊訊息會儲存在記錄中，您可以隨時檢視。

source: Viewing Message Logs
de: Anzeigen von Meldungsprotokollen
es: Visualización de registros de mensajes
ja: メッセージログの表示
ko: 메시지 로그 보기
zh_hk: 檢視訊息記錄

source: Select the <menuchoice><guimenu>View</guimenu><guimenuitem>Logs</guimenuitem></menuchoice> menu option to open the Logs window. The Logs window displays error, warning, and informational messages from Package Manager and Update Manager.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Protokolle</guimenuitem></menuchoice>, um das Fenster "Protokolle" zu öffnen. Im Fenster "Protokolle" werden Fehler, Warn- und Informationsmeldungen des Package Manager und Update-Managers angezeigt.
es: Seleccione la opción de menú <menuchoice><guimenu>Ver</guimenu><guimenuitem>Logs</guimenuitem></menuchoice> para abrir la ventana Logs. La ventana Logs muestra mensajes informativos, de error y de advertencia de Package Manager y el Administrador de actualizaciones.
ja: <menuchoice><guimenu>「表示」</guimenu><guimenuitem>「ログ」</guimenuitem></menuchoice>メニューオプションを選択して「ログ」ウィンドウを開きます。「ログ」ウィンドウには、パッケージマネージャーと更新マネージャーからのエラー、警告、および情報メッセージが表示されます。
ko: <menuchoice><guimenu>보기</guimenu><guimenuitem>로그</guimenuitem></menuchoice> 메뉴 옵션을 선택하여 로그 창을 엽니다. 그러면 로그 창에 패키지 관리자 및 업데이트 관리자의 오류, 경고 및 정보 메시지가 표시됩니다.
zh_hk: 選取 <menuchoice>[<guimenu>檢視</guimenu>] [<guimenuitem>記錄</guimenuitem>]</menuchoice> 功能表選項來開啟 [記錄] 視窗。[記錄] 視窗會顯示來自套裝軟體管理員和更新管理員的錯誤、警告及資訊訊息。

source: Select the <guibutton>Clear</guibutton> button at the bottom of the Logs window to delete all the messages.
de: Wählen Sie im unteren Bereich des Fensters "Protokolle" die Schaltfläche <guibutton>Löschen</guibutton>, um alle Meldungen zu löschen.
es: Seleccione el botón <guibutton>Borrar</guibutton> que se encuentra en la parte inferior de la ventana Logs para suprimir todos los mensajes.
ja: すべてのメッセージを削除するには、「ログ」ウィンドウ下部の<guibutton>「消去」</guibutton>ボタンをクリックします。
ko: 로그 창 아래쪽에 있는 <guibutton>지우기</guibutton> 버튼을 선택하면 모든 메시지가 삭제됩니다.
zh_hk: 選取 [記錄] 視窗底部的 [<guibutton>清除</guibutton>] 按鈕，刪除所有訊息。

source: If an error or warning is logged, a yellow triangle is displayed on the left side of the status bar. Click the yellow triangle to display the Logs window.
de: Wenn ein Fehler oder eine Warnung protokolliert wird, wird ein gelbes Dreieck links in der Statusleiste angezeigt. Klicken Sie auf das gelbe Dreieck, um das Fenster "Protokolle" anzuzeigen.
es: Si se registra un error o una advertencia, aparece un triángulo amarillo en el margen izquierdo de la barra de estado. Haga clic en el triángulo amarillo para mostrar la ventana Logs.
ja: エラーまたは警告がログに記録されると、ステータスバーの左側に黄色の三角形が表示されます。黄色の三角形をクリックすると「ログ」ウィンドウが表示されます。
ko: 오류 또는 경고가 기록되면 상태 표시줄 왼쪽에 노란색 삼각형이 표시됩니다. 노란색 삼각형을 누르면 로그 창이 표시됩니다.
zh_hk: 如果已記錄錯誤或警告，便會在狀態列左側顯示黃色三角形。按一下黃色三角形即可顯示 [記錄] 視窗。

source: Setting Preferences
de: Festlegen von Einstellungen
es: Configuración de preferencias
ja: 設定
ko: 기본 설정
zh_hk: 設定喜好設定

source: Use the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> menu option to change some of the Package Manager user interface settings.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Einstellungen</guimenuitem></menuchoice>, um einige Package Manager-Benutzerschnittstelleneinstellungen zu ändern.
es: Utilice la opción de menú <menuchoice><guimenu>Editar</guimenu><guimenuitem>Preferencias</guimenuitem></menuchoice> para cambiar algunas de las configuraciones de la interfaz de usuario de Package Manager.
ja: パッケージマネージャーのユーザーインタフェースの設定を変更するには、<menuchoice><guimenu>「編集」</guimenu><guimenuitem>「設定」</guimenuitem></menuchoice>メニューオプションを使用します。
ko: <menuchoice><guimenu>편집</guimenu><guimenuitem>기본 설정</guimenuitem></menuchoice> 메뉴 옵션을 사용하여 패키지 관리자 사용자 인터페이스 설정 중 일부를 변경합니다.
zh_hk: 使用 <menuchoice>[<guimenu>編輯</guimenu>] [<guimenuitem>喜好設定</guimenuitem>]</menuchoice> 功能表選項，變更部分套裝軟體管理員使用者介面設定。

source: The Preferences window has three tabs:
de: Das Fenster "Einstellungen" enthält drei Registerkarten:
es: La ventana Preferencias tiene tres fichas:
ja: 「設定」ウィンドウには次の 3 つのタブがあります。
ko: 기본 설정] 창의 세 가지 탭은 다음과 같습니다.
zh_hk: [喜好設定] 視窗有三個標籤：

source: The General tab enables you to set exit preferences and confirmation dialog preferences.
de: Auf Registerkarte "Allgemein" können Sie Einstellungen zum Beenden und Einstellungen des Bestätigungs-Dialogfelds festlegen.
es: La ficha General le permite establecer las preferencias de salida y las preferencias del cuadro de diálogo de confirmación.
ja: 「一般」タブでは、終了設定と確認ダイアログ設定を指定できます。
ko: 일반 탭에서는 종료 기본 설정 및 확인 대화 상자 기본 설정을 구성할 수 있습니다.
zh_hk: [一般] 標籤可讓您設定結束喜好設定和確認對話方塊喜好設定。

source: The Optional Components tab enables you to set preferences for which optional package components to install when you install or update a package.
de: Auf Registerkarte "Optionale Komponenten" können Sie die Einstellungen zum Definieren der optionalen Paketkomponenten festlegen, die installiert werden sollen, wenn Sie ein Paket installieren oder aktualisieren.
es: La ficha Componentes opcionales le permite establecer las preferencias de instalación de componentes de paquete opcionales al instalar o actualizar un paquete.
ja: 「オプションのコンポーネント」タブでは、パッケージのインストール時または更新時にインストールするオプションのパッケージコンポーネントの設定を指定できます。
ko: 선택적 구성 요소 탭에서는 패키지를 설치 또는 업데이트할 때 설치할 선택적 패키지 구성 요소에 대한 기본 설정을 구성할 수 있습니다.
zh_hk: [選擇性元件] 標籤可讓您在安裝或更新套裝軟體時，針對要安裝的選擇性套裝軟體元件設定喜好設定。

source: The Signature Policy tab enables you to set signature policy for this image.
de: Auf Registerkarte "Signaturrichtlinie" können Sie die Signaturrichtlinie für dieses Abbild festlegen.
es: La ficha Política de firmas le permite establecer una política de firmas para esta imagen.
ja: 「署名ポリシー」タブでは、このイメージの署名ポリシーを設定できます。
ko: 서명 정책 탭에서는 이 이미지에 대한 서명 정책을 설정할 수 있습니다.
zh_hk: [簽名策略] 標籤可讓您設定此影像的簽名策略。

source: Exit Preferences
ca: Preferències de sortida
cs: Ukončit nastavení
de: Beenden der Einstellungen
es: Salir de las preferencias
ja: 設定を閉じる
ko: 종료 기본 설정
ru: Параметры настройки выхода
zh_hk: 結束喜好設定

source: Select the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> option and select the General tab.
de: Wählen Sie die Menüoption <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Einstellungen</guimenuitem></menuchoice> und öffnen Sie die Registerkarte "Allgemein".
es: Seleccione la opción <menuchoice><guimenu>Editar</guimenu><guimenuitem>Preferencias</guimenuitem></menuchoice> y seleccione la ficha General.
ja: <menuchoice><guimenu>「編集」</guimenu><guimenuitem>「設定」</guimenuitem></menuchoice>オプションを選択し、「一般」タブを選択します。
ko: <menuchoice><guimenu>편집</guimenu><guimenuitem>기본 설정</guimenuitem></menuchoice> 옵션을 선택하고 일반 탭을 선택합니다.
zh_hk: 選取 <menuchoice>[<guimenu>編輯</guimenu>] [<guimenuitem>喜好設定</guimenuitem>]</menuchoice> 選項，並選取 [一般] 標籤。
