Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: <emphasis role="strong">Installable Version</emphasis> – The version of a package that is available for installation or an update. This version may be older than the latest available version of the package due to package dependencies on the system. Hence you may not be able to install the latest available version of the package unless you update your system using the <emphasis role="strong">Updates</emphasis> icon on the toolbar.
ca: <emphasis role="strong">Versió instal·lable</emphasis> – La versió d'un paquet que està disponible per a la instal·lació o actualització. Aquesta versió pot ser més antiga que l'última versió disponible degut a les dependències del paquet en el sistema. En conseqüència no podreu ser capaços d'instal·lar l'última versió del paquet a menys que utilitzeu la icona <emphasis role="strong">Actualitzacions</emphasis> de la barra d'eines.
cs: <emphasis role="strong">Instalovatelná verze</emphasis> – Verze balíčku, která je dostupná pro instalaci nebo aktualizaci. Tato verze balíčku nemusí být nejnovější kvůli závislostem balíčku na systému. Tudíž nemusí být schopni nainstalovat nejnovější verzi balíčku, dokud neaktualizujete Váš systém pomocí ikony <emphasis role="strong">Aktualizovat</emphasis>na panelu nástrojů.
ru: <emphasis role="strong">Устанавливаемая версия</emphasis> – версия пакета, доступная для установки или обновления. Эта версия может быть не быть самой последней из-за зависимостей между пакетами в системе. Следовательно, установка последней версии пакета может оказаться невозможной без одновременного обновления всей системы с помощью значка <emphasis role="strong">Обновления</emphasis> на панели инструментов.

source: <emphasis role="strong">Installed Version</emphasis> – The version of the package installed on the system.
ca: <emphasis role="strong">Versió instal·lada</emphasis> – La versió del paquet instal·lada al sistema.
cs: <emphasis role="strong">Nainstalovaná verze</emphasis> – verze balíčku, která je nainstalovaná na systému.
ru: <emphasis role="strong">Установленная версия</emphasis> – версия пакета, установленная в системе.

source: <emphasis role="strong">Latest Version</emphasis> – This is the latest version of the package available for installation or update. The latest version can be installed if your system is up-to-date.
ca: <emphasis role="strong">Última versió</emphasis> – Aquesta és l'última versió del paquet per a l'instal·lació o actualització. L'última versió pot ser instal·lada si el vostre sistema està al dia.
cs: <emphasis role="strong">Nejnovější verze</emphasis> - Toto je nejnovější verze balíčku dostupná pro instalaci nebo aktualizaci. Nejnovější verze může nainstalovaná, pokud je Váš systém aktuální.
ru: <emphasis role="strong">Последняя версия</emphasis> – последняя версия пакета, доступная для установки или обновления. Установка последней версии возможна в полностью обновленной системе.

source: View Installed Packages From All Publishers
ca: Visualitzar els paquets instal·lats de tots els publicadors
cs: Zobrazit nainstalované balíčky od všech vydavatelů
ru: Просмотр установленных пакетов от всех издателей

source: Choose the <emphasis role="strong">All Publishers (Installed)</emphasis> from the <emphasis role="strong">Publisher</emphasis> drop-down menu filter to view a list of all packages that you have installed from all publishers.
ca: Seleccioneu <emphasis role="strong">Tots els publicadors (Instal·lats)</emphasis> des del menú desplegable de filtració <emphasis role="strong">Publicador</emphasis> per a visualitzar els paquets que teniu instal·lats de tots els publicadors.
cs: Z vysunovací nabídky <emphasis role="strong">Vydavatel</emphasis> vyberte <emphasis role="strong">Všichni vydavatelé (Nainstalované)</emphasis> pro zobrazení seznamu všech balíčků, které jste nainstalovali od všech vydavatelů.
ru: Для просмотра списка всех установленных пакетов от всех издателей выберите пункт <emphasis role="strong">Все издатели (установленные)</emphasis> в раскрывающемся меню <emphasis role="strong">Издатель</emphasis>.

source: You cannot search for a package from the <emphasis role="strong">All Publishers (Installed)</emphasis> option. Switch to <emphasis role="strong">All Publishers (Search)</emphasis> to search for a package.
ca: No podeu cercar un paquet des de l'opció <emphasis role="strong">Tots els publicadors (Instal·lats)</emphasis>. Canvieu a <emphasis role="strong">Tots els publicadors (Cerca)</emphasis> per a cercar un paquet.
cs: Nemůžete vyhledávat balíčky z možnosti <emphasis role="strong">Všichni Vydavatelé (Nainstalované)</emphasis>. Přepněte na <emphasis role="strong">Všichni Vydavatelé(Hledat)</emphasis> pro vyhledání balíčku.
ru: Поиск пакетов в режиме просмотра <emphasis role="strong">Все издатели (установленные)</emphasis> невозможен. Для поиска пакета перейдите в режим <emphasis role="strong">Все издатели (поиск)</emphasis>.

source: Introduction to Boot Environments
ca: Introducció als entorns d'arranc
cs: Úvod do Bootovacích Prostředí
ru: Введение в загрузочные среды

source: A boot environment is an image that is bootable. Upon an initial OpenSolaris installation, a boot environment is created.
ca: Un entorn d'arranc és una imatge que és arrancable. Després d'una instal·lació d'OpenSolaris, és creat un entorn d'arranc.
cs: Bootovací prostředí je obraz, který lze zavést. Toto prostředí je vytvořeno po počáteční instalaci OpenSolarisu.
ru: Среда загрузки представляет собой загружаемый образ. Среда загрузки создается после первоначальнойустановки ОС Solaris.

source: You can maintain multiple boot environments on your OpenSolaris 2010.03 system. Use the <command>beadm(1)</command> command from the command-line interface (CLI) to create, rename, mount or unmount, or destroy these boot environments.
ca: Podeu mantenir diversos entorns d'arranc al vostre sistema OpenSolaris 2010.03. Utilitzeu la comanda <command>beadm(1)</command> des de la interfície de línia de comandes (CLI) per a crear, reanomenar, muntar o desmuntar, o destruir aquests entorns d'arranc.
cs: Můžete spravovat více bootovacích prostředí na Vašem systému OpenSolaris 2010.03. Použijte příkaz <command>beadm(1)</command> z příkazové řádky (CLI) pro vytvoření, přejmenování, připojení nebo odpojení a odstranění těchto bootovacích prostředí
ru: В системе OpenSolaris 2010.03 можно организовать несколько сред загрузки. Для создания, переименования, монтирования и размонтирования, а также уничтожения этих сред загрузки используется команда <command>beadm(1)</command>, которая вводится в командной строке.

source: The Package Manager enables you to manage the boot environments created during the process of updating your image. For more information, see <xref linkend="manage-be"/> section.
ca: El gestor de paquets us permet gestionar els entorns d'arranc creats durant el procés d'actualització de la vostra imatge. Per a més informació, vegeu la secció <xref linkend="manage-be"/>.
cs: Správce balíčků umožňuje spravovat bootovací prostředí vytvořené během procesu aktualizace obrazu. Více informací, viz sekce <xref linkend="manage-be"/>.
ru: Диспетчер пакетов позволяет управлять средами загрузки, созданными в ходе обновления образа. Для получения дополнительной информации см. раздел <xref linkend="manage-be"/>.

source: Users can maintain multiple boot environments on their systems, and each boot environment can have different software versions installed.
ca: Els usuaris poden mantenir diversos entorns d'arranc en els seus sistemes, i cada entorn d'arranc pot tenir diferents versions de programari instal·lades.
cs: Uživatelé mohou spravovat více bootovacích prostředí na jejich systému a každé bootovací prostředí může obsahovat různé verze nainstalovaného softwaru.
ru: На одном компьютере можно организовать несколько сред загрузки, и в каждой такой среде могут быть установлены разные версии программного обеспечения.

source: When you use either the Package Manager or the <command>pkg image-update</command> command to update all the packages in your active OpenSolaris boot environment, a clone of that boot environment is automatically created. The packages are updated in the clone rather than in the original boot environment. After successfully completing the updates, the new clone is activated. Then, the clone will become the new default boot environment on system reboot. The original boot environment is also available as an alternate selection.
ca: Quant utilitzeu tant el Gestor de Paquets, com la comanda <command>pkg image-update</command> per a actualitzar tot el sistema al vostre entorn d'arranc actiu d'OpenSolaris, , es crea automàticament un clon de l'entorn d'arranc actualment actiu. Els paquet són actualitzats al clon més que al entorn d'arranc. Després de completar les actualitzacions, el nou clon és activat. Després, el clon es convertirà amb l'entorn d'arranc predeterminat quan el sistema reinicii. L'entorn d'arranc original també està disponible com una selecció alternativa.
cs: Pokud použijete Správce balíčků nebo příkaz <command>pkg image-update</command> pro aktualizaci všech balíčků ve Vašem aktivním bootovacím prostředí, vytvoří se automaticky klon tohoto prostředí. Balíčky jsou poté aktualizovány v tomto klonu a po úspěšném dokončení aktualizace, je tento nový klon aktivován a stane se novým výchozím bootovacím prostředím na Vašem systému. Původní bootovací prostředí je také dostupné jako alternativní výběr.
ru: При обновлении всех пакетов в активной среде загрузки OpenSolaris с помощью либо диспетчера пакетов, либо команды <command>pkg image-update</command>, автоматически создается клон этой среды загрузки. При этом пакеты обновляются не в исходной среде загрузки, а в клоне. После успешного выполнения обновления созданный клон активируется. После перезагрузки системы клон становится новой средой загрузки по умолчанию. Исходная среда загрузки остается доступной в качестве альтернативы.

source: See the beadm(1) man pages and the <ulink url="http://docs.sun.com/source/820-7679/index.html"><citetitle>Upgrading and Managing Boot Environments</citetitle></ulink> document to learn more about boot environments and the <command>beadm(1)</command> command.
ca: Vegeu les pàgines man beadm(1) i el document <ulink url="http://docs.sun.com/source/820-7679/index.html"><citetitle>Actualitzant i gestionant entorns d'arranc</citetitle></ulink> per aprendre més quant als entorns d'arranc i la comanda <command>beadm(1)</command>.
cs: Viz manuálové stránky beadm(1) a dokument <ulink url="http://docs.sun.com/source/820-7679/index.html"><citetitle>Aktualizace a správa bootovacích prostředí</citetitle></ulink>
ru: Для получения дополнительных сведений о средах загрузки и команде <command>beadm(820)</command> см. справочные страницы beadm(1) и документ <ulink url="http://docs.sun.com/source/820-7679/index.html"><citetitle>Обновление сред загрузки и управление ими</citetitle></ulink>.

source: Update All Packages (Update Your Image)
ca: Actualitzar tots el paquets (actualitzar la vostra imatge)
cs: Aktualizovat všechny balíčky (Aktualizovat Váš obraz)
ru: Обновление всех пакетов (обновление образа)

source: Perform the following steps to update all the packages in your image.
ca: Realitzeu els següents pasos per a actualitzar tots els paquets a la vostra image.
cs: Proveďte následující kroky pro aktualizaci Vašeho obrazu.
ru: Для обновления всех пакетов в своей системе выполните следующие действия.

source: Click <guibutton>Updates</guibutton> to start the process of updating <emphasis role="strong">all</emphasis> the packages installed in your image.
ca: Cliqueu a <guibutton>Actualitzacions</guibutton> per a iniciar el procés d'actualització de <emphasis role="strong">tots</emphasis> els paquets instal·lats en la vostra imatge.
cs: Klikněte na <guibutton>Aktualizovat</guibutton> pro start procesu aktualizace <emphasis role="strong">všech</emphasis> balíčků nainstalovaných na Vašem obrazu.
ru: Нажмите кнопку <guibutton>Обновления</guibutton> для запуска процесса обновления <emphasis role="strong">всех</emphasis> пакетов, установленных в образе.

source: You can also choose <menuchoice><guimenu>Package</guimenu><guisubmenu>Updates</guisubmenu></menuchoice> to start the process.
ca: també podeu seleccionar <menuchoice><guimenu>Paquet</guimenu><guisubmenu>Actualitzacions</guisubmenu></menuchoice> per a iniciar el procés.
cs: Můžete také vybrat <menuchoice><guimenu>Balíček</guimenu><guisubmenu>Aktualizovat</guisubmenu></menuchoice> pro start procesu.
ru: Для запуска обновления можно также выбрать в меню пункты <menuchoice><guimenu>Пакет</guimenu><guimenuitem>Обновления</guimenuitem></menuchoice>.

source: If no updates are available to your installed packages, a <emphasis role="strong">No Updates Available</emphasis> message is displayed after you click <guibutton>Updates</guibutton>.
ca: Si no hi han actualitzacions disponibles pels vostres paquets instal·lats, es mostra un missatge <emphasis role="strong">No hi han actualitzacions disponibles</emphasis> després que cliqueu a <guibutton>Actualitzacions</guibutton>.
cs: Pokud nejsou dostupné žádné aktualizace balíčků, zobrazí se zpráva <emphasis role="strong">Nejsou dostupné žádné aktualizace</emphasis> po kliknutí na <guibutton>Aktualizovat</guibutton>.
ru: Если для установленных пакетов отсутствуют доступные обновления, после нажатия кнопки <guibutton>Обновления</guibutton> выводится сообщение <emphasis role="strong">Обновления недоступны</emphasis>.

source: The process of updating all the packages installed on your system is completed in three phases:
ca: El procés d'actualització de tots els paquets instal·lats en el vostre sistema es completa en tres fases:
cs: Proces aktualizace všech balíčků nainstalovaných na Vašem systému je dokončen ve třech fázích:
ru: Процесс обновления всех пакетов, установленных в системе, осуществляется в три этапа:

source: Preparation
ca: Preparació
cs: Příprava
ru: Подготовка

source: Download
ca: Descarregar
cs: Stahování
ru: Загрузка

source: Install
ca: Instal·lar
cs: Instalace
ru: Установка

source: Click on the <emphasis>Details</emphasis> tab displayed in each of the phases to view more information.
ca: Cliqueu a la pestanya <emphasis>Details</emphasis> mostrada en cada una d'aquestes fases per a visualitzar més informació.
cs: Klikněte na záložku <emphasis>Podrobnosti</emphasis> pro zobrazení podrobností pro každou z fází.
ru: С дополнительной информацией можно ознакомиться на закладке <emphasis>Сведения</emphasis>, выводимой на каждом этапе.

source: After the update process is completed successfully, an <emphasis role="strong">Update All Complete</emphasis> dialog is displayed. A new boot environment is created which consists of the updated packages. The new boot environment is given a default name by the Package Manager, you can change the given boot environment name.
ca: Després que el procés d'actualització es complet correctament, es mostra un diàleg <emphasis role="strong">Completat actualitzar tot</emphasis>. Es crea un nou entorn d'arranc el qual consisteix de tots els paquets actualitzats. El gestor de paquet assigna un nom predeterminat pel nou entorn d'arranc, podeu canviar el nom assignat per l'entorn d'arranc.
cs: Po úspešném dokončení procesu aktualizace se zobrazí dialog <emphasis role="strong">Aktualizace Obrazu Dokončena</emphasis>. Je vytvořeno nové bootovací prostředí tvořené aktualizovanými balíčky. Nové bootovací prostředí získá výchozí název od Správce balíčků, tento název bootovacího prostředí je možno změnit.
ru: После успешного завершения процесса обновления выводится диалоговое окно <emphasis role="strong">Обновление всех пакетов завершено</emphasis>. Создается новая загрузочная среда, состоящая из обновленных пакетов. Новой загрузочной среде присваивается имя по умолчанию, однако его можно изменить.

source: If the Package Manager is unable to create a new boot environment, an error message is displayed. See the <xref linkend="gilfh"/> section on how to rectify the error and continue with updating your image.
ca: Si el Gestor de paquets és incapaç de crear un nou entorn d'arranc, es mostra un missatge d'error. Vegeu la secció <xref linkend="gilfh"/> per tal de rectificar l'error i continuar amb l'actualització de la imatge.
cs: Pokud Správce balíčků nedokáže vytvořit nové bootovací prostředí, je zobrazena chybová hláška. Viz sekce <xref linkend="gilfh"/> o způsobu napravení chyb a pokračování v aktualizaci obrazu.
ru: Если диспетчер пакетов не может создать новую загрузочную среду, выводится сообщение об ошибке. См. раздел <xref linkend="gilfh"/> об исправлении ошибки и продолжении обновления образа.

source: Click <guibutton>Restart Now</guibutton> to reboot your system immediately.
ca: Cliqueu a <guibutton>Reiniciar ara</guibutton> per a reiniciar immediatament el vostre sistema.
cs: Klikněte na <guibutton>Restartovat Nyní</guibutton> pro okamžité restartování systému.
ru: Для немедленной перезагрузки системы нажмите кнопку <guibutton>Перезагрузить сейчас</guibutton>.

source: Click <guibutton>Restart Later</guibutton> to restart your system at a later time. <emphasis role="strong">You must reboot your system for the changes to take effect.</emphasis>
ca: Cliqueu a <guibutton>Reiniciar més tard</guibutton> per a reiniciar el sistema un temps després. <emphasis role="strong">Heu de reiniciar el vostre sistema per a què els canvis tinguin efecte.</emphasis>
cs: Klikněte na <guibutton>Restartovat později</guibutton> pro restartování systému později. <emphasis role="strong">Je nutné systém restartovat, aby se změny projevily</emphasis>
ru: Для отложенной перезагрузки системы нажмите кнопку <guibutton>Перезагрузить позже</guibutton>. <emphasis role="strong">Изменения вступают в силу только после перезагрузки системы.</emphasis>

source: During the Update All process, a clone of the active boot environment is created. You can boot into the clone to return to the boot environment state that existed before the Update All process was started.
ca: Durant el procés d'Actualitzar tot, es crea un clon de l'actual entorn d'arranc. Podeu arrancar el clon o retornar a l'entorn d'arranc anterior a l'inici del procés d'actualitzar tot.
cs: Během procesu aktualizace obrazu je vytvořen klon aktivního bootovacího prostředí. Je možno se nabootovat do klonu pro navrácení stavu bootovacího prostředí existujícího před započetím procesu aktualizace obrazu.
ru: Во время выполнения команды "Обновить все" создается клон активной загрузочной среды. Такой клон позволяет пользователю вернуться к состоянию загрузочной среды, существовавшему до начала процесса "Обновить все".

source: Update All Errors
ca: Actualitzar Tots els Errors
cs: Chyby při aktualizaci obrazu
ru: Ошибки при выполнении команды "Обновить все"

source: A new boot environment clone must be created by the Package Manager for the Updates process to be completed. An error message is displayed if a boot environment clone cannot be created. You might see an error message such as the following :
ca: Per a que es completi el procés d'actualització el gestor de paquets ha de crear un clon de l'actual entorn d'arranc. es mostra un missatge d'error si el procés d'actualització no pot crear un clon de l'entorn d'arranc. Podeu visualitzar un missatge d'error com el següent :
cs: Nový klon bootovacího prostředí musí být vytvořen Správcem balíčků pro dokončení procesu Aktualizací. Pokud nelze vytvořit klon bootovacího prostředí, je zobrazena chybová hláška. Chybová hláška může vypadat například takto:
ru: Для завершения процесса "Обновить все" необходимо воспользоваться средствами диспетчера пакетов для создания нового клона загрузочной среды. Если клон загрузочной среды создать невозможно, выводится сообщение об ошибке. Пример сообщения об ошибке:

source: <literal>Not enough disk space, the Update All action cannot be performed. Choose Manage BE to manage your boot environments and free up disk space.</literal>.
ca: <literal>No hi ha prou espai de disc, L'acció d'actualitzar tor no pot ser realitzada. seleccioneu Gestiona entorns d'arranc per a gestionar els vostres entorns d'arran i així alliberar espai en el disc.</literal>.
cs: <literal>Nedostatek místa na disku, aktualizace obrazu nemůže být provedena. Zvolte Správa BE pro správu bootovacích prostředí a uvolnění místa na disku.
ru: <literal>Недостаточно дискового пространства, выполнение обновления невозможно. Выберите "Управление загрузочными средами" и примите меры к высвобождению дискового пространства путем управления загрузочными средами.</literal>.

source: Click <guibutton>Close</guibutton> to cancel the Update All process.
ca: Cliqueu a <guibutton>Tancar</guibutton> per a cancel·lar el procés d'actualitzar tot.
cs: Klikněte na <guibutton>Zavřít</guibutton> pro zrušení procesu Aktualizace Všeho.
ru: Нажмите кнопку <guibutton>Закрыть</guibutton> для отмены процесса "Обновить все".

source: Perform the following steps if you want to rectify the error and continue with the Update All process:
ca: Realitzeu els següents passos si voleu rectificar l'error i continuar amb el procés d'actualitzar tot:
cs: Proveďte následující kroky, pokud si přejete opravit chybu a pokračovat v aktualizaci obrazu:
ru: Для исправления ошибки и продолжения процесса "Обновить все"выполните следующие действия:

source: Click <guibutton>Manage BE</guibutton> to display the <emphasis role="strong">Manage Boot Environment</emphasis> dialog.
ca: Cliqueu a <guibutton>Gestionar entorns d'arranc</guibutton> per a mostrar el diàleg <emphasis role="strong">Gestionar l'entorn d'arranc</emphasis>.
cs: Klikněte na <guibutton>Správa BE</guibutton> pro zobrazení dialogu <emphasis role="strong">Správa Bootovacích prostředí</emphasis>
ru: Нажмите кнопку <guibutton>Управление загрузочными средами</guibutton> для открытия диалогового окна <emphasis role="strong">Управление загрузочными средами</emphasis>.

source: Select the boot environments that you want to delete.
ca: Seleccioneu l'entorn d'arranc que desitgeu eliminar.
cs: Vyberte bootovací prostředí, které chcete smazat.
ru: Выберите загрузочные среды, которые необходимо удалить.

source: You cannot delete the currently active boot environment.
ca: No es pot eliminar l'entorn d'arranc, actualment actiu.
cs: Nemůžete smazat právě aktivní bootovací prostředí.
ru: Активную в настоящий момент среду загрузки удалить невозможно.

source: You do not need to reboot your system if you are only deleting some of your boot environments.
ca: No necessiteu reiniciar el vostre sistema si solament heu eliminat alguns del vostres entorns d'arranc.
cs: Nemusíte restartovat systém, pokud pouze mažete některý z bootovacích prostředí.
ru: Если необходимо удалить только некоторые загрузочные среды, перезагружать систему нет необходимости.

source: Click <guibutton>OK</guibutton>.
ca: Cliqueu <guibutton>D'acord</guibutton>.
cs: Klikněte na <guibutton>OK</guibutton>.
ru: Нажмите кнопку <guibutton>OK</guibutton>.

source: The <emphasis role="strong">Boot Environment Confirmation</emphasis> dialog is shown. Review your changes and click OK to proceed.
ca: Es mostra el diàleg <emphasis role="strong">Confirmació entorn d'arranc</emphasis>. reviseu els vostres canvis i cliqueu a Acceptar per a procedir.
cs: Objeví se dialog <emphasis role="strong">Potvrzení Bootovacího Prostředí</emphasis>. Zkontrolujte své změny a klikněte na tlačítko OK.
ru: Откроется диалоговое окно <literal>Подтверждение загрузочной среды</literal>. Проверьте правильность изменений и нажмите кнопку "OK" для продолжения.
