Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: <trademark class="registered">Oracle</trademark> Solaris 11 Package Manager Online Help
de: <trademark class="registered">Oracle</trademark> Solaris 11 Package Manager-Onlinehilfe
es: <trademark class="registered">Oracle</trademark> Ayuda en pantalla de Solaris 11 Package Manager
ja: <trademark class="registered">Oracle</trademark> Solaris 11 パッケージマネージャーオンラインヘルプ
ko: <trademark class="registered">Oracle</trademark> Solaris 11 패키지 관리자 온라인 도움말
zh_hk: <trademark class="registered">Oracle</trademark> Solaris 11 套裝軟體管理員線上說明

source: June 2011
de: Juni 2011
es: Junio de 2011
ja: 2011 年 6 月
ko: 2011년 6월
zh_hk: 2011 年 6 月

source: This software and related documentation are provided under a license agreement containing restrictions on use and disclosure and are protected by intellectual property laws. Except as expressly permitted in your license agreement or allowed by law, you may not use, copy, reproduce, translate, broadcast, modify, license, transmit, distribute, exhibit, perform, publish, or display any part, in any form, or by any means. Reverse engineering, disassembly, or decompilation of this software, unless required by law for interoperability, is prohibited.
de: Diese Software und zugehörige Dokumentation werden im Rahmen eines Lizenzvertrages zur Verfügung gestellt, der Einschränkungen hinsichtlich Nutzung und Offenlegung enthält und durch Gesetze zum Schutz geistigen Eigentums geschützt ist. Sofern nicht ausdrücklich in Ihrem Lizenzvertrag vereinbart oder gesetzlich geregelt, darf diese Software weder ganz noch teilweise in irgendeiner Form oder durch irgendein Mittel zu irgendeinem Zweck kopiert, reproduziert, übersetzt, gesendet, verändert, lizenziert, übertragen, verteilt, ausgestellt, ausgeführt, veröffentlicht oder angezeigt werden. Reverse Engineering, Disassemblierung oder Dekompilierung der Software ist verboten, es sei denn, dies ist erforderlich, um die gesetzlich vorgesehene Interoperabilität mit anderer Software zu ermöglichen.
es: Este software y la documentación relacionada están sujetos a un contrato de licencia que incluye restricciones de uso y revelación, y se encuentran protegidos por la legislación sobre la propiedad intelectual. A menos que figure explícitamente en el contrato de licencia o esté permitido por la ley, no se podrá utilizar, copiar, reproducir, traducir, emitir, modificar, conceder licencias, transmitir, distribuir, exhibir, representar, publicar ni mostrar ninguna parte, de ninguna forma, por ningún medio. Queda prohibida la ingeniería inversa, desensamblaje o descompilación de este software, excepto en la medida en que sean necesarios para conseguir interoperabilidad según lo especificado por la legislación aplicable.
ja: このソフトウェアおよび関連ドキュメントの使用と開示は、ライセンス契約の制約条件に従うものとし、知的財産に関する法律により保護されています。ライセンス契約で明示的に許諾されている場合もしくは法律によって認められている場合を除き、形式、手段に関係なく、いかなる部分も使用、複写、複製、翻訳、放送、修正、ライセンス供与、送信、配布、発表、実行、公開または表示することはできません。このソフトウェアのリバース・エンジニアリング、逆アセンブル、逆コンパイルは互換性のために法律によって規定されている場合を除き、禁止されています。
ko: 본 소프트웨어와 관련 문서는 사용 제한 및 기밀 유지 규정을 포함하는 라이센스 계약서에 의거해 제공되며, 지적 재산법에 의해 보호됩니다. 라이센스 계약서 상에 명시적으로 허용되어 있는 경우나 법규에 의해 허용된 경우를 제외하고, 어떠한 부분도 복사, 재생, 번역, 방송, 수정, 라이센스, 전송, 배포, 진열, 실행, 발행, 또는 전시될 수 없습니다. 본 소프트웨어를 리버스 엔지니어링, 디스어셈블리 또는 디컴파일하는 것은 상호 운용에 대한 법규에 의해 명시된 경우를 제외하고는 금지되어 있습니다.
zh_hk: 本軟體與相關說明文件是依據含有用途及保密限制事項的授權合約所提供，且受智慧財產法的保護。除了授權合約中或法律明文允許的部份外，不得以任何形式或方法使用、複製、重製、翻譯、廣播、修改、授權、傳送、散佈、展示、演出、出版或陳列本軟體的任何部份。除非依法需要取得互通性操作 (interoperability)，否則嚴禁對本軟體進行還原工程 (reverse engineering)、反向組譯 (disassembly) 或解編 (decompilation)。

source: The information contained herein is subject to change without notice and is not warranted to be error-free. If you find any errors, please report them to us in writing.
de: Die hier angegebenen Informationen können jederzeit und ohne vorherige Ankündigung geändert werden. Wir übernehmen keine Gewähr für deren Richtigkeit. Sollten Sie Fehler oder Unstimmigkeiten finden, bitten wir Sie, uns diese schriftlich mitzuteilen.
es: La información contenida en este documento puede someterse a modificaciones sin previo aviso y no se garantiza que se encuentre exenta de errores. Si detecta algún error, le agradeceremos que nos lo comunique por escrito.
ja: ここに記載された情報は予告なしに変更される場合があります。また、誤りが無いことの保証はいたしかねます。誤りを見つけた場合は、オラクル社までご連絡ください。
ko: 이 안의 내용은 사전 공지 없이 변경될 수 있으며 오류가 존재하지 않음을 보증하지 않습니다. 만일 오류를 발견하면 서면으로 통지해 주기 바랍니다.
zh_hk: 本文件中的資訊如有變更恕不另行通知，且不保證沒有任何錯誤。如果您發現任何問題，請來函告知。

source: If this is software or related software documentation that is delivered to the U.S. Government or anyone licensing it on behalf of the U.S. Government, the following notice is applicable:
de: Wird diese Software oder zugehörige Dokumentation an die Regierung der Vereinigten Staaten von Amerika bzw. einen Lizenznehmer im Auftrag der Regierung der Vereinigten Staaten von Amerika geliefert, gilt Folgendes:
es: Si este software o la documentación relacionada se entrega al Gobierno de EE.UU. o a cualquier entidad que adquiera licencias en nombre del Gobierno de EE.UU. se aplicará la siguiente disposición:
ja: このソフトウェアまたは関連ドキュメントを、米国政府機関もしくは米国政府機関に代わってこのソフトウェアまたは関連ドキュメントをライセンスされた者に提供する場合は、次の通知が適用されます。
ko: 만일 본 소프트웨어나 관련 문서를 미국 정부나 또는 미국 정부를 대신하여 라이센스한 개인이나 법인에게 배송하는 경우, 다음 공지 사항이 적용됩니다.
zh_hk: 如果本軟體或相關說明文件是提供給美國政府或代表美國政府授權使用本軟體者，適用下列條例：

source: U.S. GOVERNMENT RIGHTS Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are “commercial computer software” or “commercial technical data” pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065.
de: U.S. GOVERNMENT RIGHTS Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are "commercial computer software" or "commercial technical data" pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065, USA.

source: This software or hardware is developed for general use in a variety of information management applications. It is not developed or intended for use in any inherently dangerous applications, including applications which may create a risk of personal injury. If you use this software or hardware in dangerous applications, then you shall be responsible to take all appropriate fail-safe, backup, redundancy, and other measures to ensure its safe use. Oracle Corporation and its affiliates disclaim any liability for any damages caused by use of this software or hardware in dangerous applications.
de: Diese Software oder Hardware ist für die allgemeine Anwendung in verschiedenen Informationsmanagementanwendungen konzipiert. Sie ist nicht für den Einsatz in potenziell gefährlichen Anwendungen bzw. Anwendungen mit einem potenziellen Risiko von Personenschäden geeignet. Falls die Software oder Hardware für solche Zwecke verwendet wird, verpflichtet sich der Lizenznehmer, sämtliche erforderlichen Maßnahmen wie Fail Safe, Backups und Redundancy zu ergreifen, um den sicheren Einsatz dieser Software oder Hardware zu gewährleisten. Oracle Corporation und ihre verbundenen Unternehmen übernehmen keinerlei Haftung für Schäden, die beim Einsatz dieser Software oder Hardware in gefährlichen Anwendungen entstehen.
es: Este software o hardware se ha desarrollado para uso general en diversas aplicaciones de gestión de la información. No se ha diseñado ni está destinado para utilizarse en aplicaciones de riesgo inherente, incluidas las aplicaciones que pueden causar daños personales. Si utiliza este software o hardware en aplicaciones de riesgo, usted será responsable de tomar todas las medidas apropiadas de prevención de fallos, copia de seguridad, redundancia o de cualquier otro tipo para garantizar la seguridad en el uso de este software o hardware. Oracle Corporation y sus subsidiarias declinan toda responsabilidad derivada de los daños causados por el uso de este software o hardware en aplicaciones de riesgo.
ja: このソフトウェアもしくはハードウェアは様々な情報管理アプリケーションでの一般的な使用のために開発されたものです。このソフトウェアもしくはハードウェアは、危険が伴うアプリケーション （人的傷害を発生させる可能性があるアプリケーションを含む） への用途を目的として開発されていません。このソフトウェアもしくはハードウェアを危険が伴うアプリケーションで使用する際、安全に使用するために、適切な安全装置、バックアップ、冗長性 （redundancy）、その他の対策を講じることは使用者の責任となります。このソフトウェアもしくはハードウェアを危険が伴うアプリケーションで使用したことに起因して損害が発生しても、オラクル社およびその関連会社は一切の責任を負いかねます。
ko: 본 소프트웨어 혹은 하드웨어는 다양한 정보 관리 애플리케이션의 일반적인 사용을 목적으로 개발되었습니다. 본 소프트웨어 혹은 하드웨어는 개인적인 상해를 초래할 수 있는 애플리케이션을 포함한 본질적으로 위험한 애플리케이션에서 사용할 목적으로 개발되거나 그 용도로 사용될 수 없습니다. 만일 본 소프트웨어 혹은 하드웨어를 위험한 애플리케이션에서 사용할 경우, 라이센스 사용자는 해당 애플리케이션의 안전한 사용을 위해 모든 적절한 비상-안전, 백업, 대비 및 기타 조치를 반드시 취해야 합니다. Oracle Corporation과 그 자회사는 본 소프트웨어 혹은 하드웨어를 위험한 애플리케이션에서의 사용으로 인해 발생하는 어떠한 손해에 대해서도 책임지지 않습니다.
zh_hk: 本軟體或硬體是針對各類資訊管理應用程式的一般使用所開發。不適用任何原本就具危險性的應用上，包含會造成人身傷害風險的應用。如果您將本軟體或硬體應用於危險用途，則應採取適當的防範措施，包括保全、備份、儲備和其他措施以確保使用安全。Oracle Corporation 和其關係機構聲明對將本軟體或硬體應用於危險用途所造成之損害概不負任何責任。

source: Oracle and Java are registered trademarks of Oracle and/or its affiliates. Other names may be trademarks of their respective owners.
de: Oracle und Java sind eingetragene Marken von Oracle und/oder ihren verbundenen Unternehmen. Andere Namen und Bezeichnungen können Marken ihrer jeweiligen Inhaber sein.
es: Oracle y Java son marcas comerciales registradas de Oracle y/o sus subsidiarias. Todos los demás nombres pueden ser marcas comerciales de sus respectivos propietarios.
ja: Oracle と Java は Oracle Corporation およびその関連企業の登録商標です。その他の名称は、それぞれの所有者の商標または登録商標です。
ko: Oracle과 Java는 Oracle Corporation 및/또는 그 자회사의 등록 상표입니다. 기타의 명칭들은 각 해당 명칭을 소유한 회사의 상표일 수 있습니다.
zh_hk: Oracle 和 Java 是 Oracle 和 (或) 其關係公司的註冊商標。其他名稱為各商標持有人所擁有之商標。

source: AMD, Opteron, the AMD logo, and the AMD Opteron logo are trademarks or registered trademarks of Advanced Micro Devices. Intel and Intel Xeon are trademarks or registered trademarks of Intel Corporation. All SPARC trademarks are used under license and are trademarks or registered trademarks of SPARC International, Inc. UNIX is a registered trademark licensed through X/Open Company, Ltd.
de: AMD, Opteron, das AMD-Logo und das AMD-Opteron-Logo sind Marken oder eingetragene Marken von Advanced Micro Devices. Intel und Intel Xeon sind Marken oder eingetragene Marken der Intel Corporation. Alle SPARC-Marken werden in Lizenz verwendet und sind Marken oder eingetragene Marken der SPARC International, Inc. UNIX ist eine durch X/Open Company, Ltd lizenzierte, eingetragene Marke.
es: AMD, Opteron, el logotipo de AMD y el logotipo de AMD Opteron son marcas comerciales o marcas comerciales registradas de Advanced Micro Devices. Intel e Intel Xeon son marcas comerciales o marcas comerciales registradas de Intel Corporation. Todas las marcas comerciales de SPARC se utilizan con licencia y son marcas comerciales o marcas comerciales registradas de SPARC International, Inc. UNIX es una marca comercial registrada con acuerdo de licencia de X/Open Company, Ltd.
ja: AMD、Opteron、AMD ロゴ、AMD Opteron ロゴは、Advanced Micro Devices, Inc. の商標または登録商標です。Intel、Intel Xeon は、Intel Corporation の商標または登録商標です。すべての SPARC の商標はライセンスをもとに使用し、SPARC International, Inc. の商標または登録商標です。UNIX は X/Open Company, Ltd. からライセンスされている登録商標です。
ko: AMD, Opteron, AMD 로고, 및AMD Opteron 로고는 Advanced Micro Devices의 상표 내지는 등록 상표입니다. Intel 및 Intel Xeon Intel Corporation의 등록 상표입니다. SPARC 상표 일체는 라이센스에 의거하여 사용되며SPARC International, Inc.의 상표 내지는 등록 상표입니다. UNIX는 X/Open Company, Ltd.를 통해 라이센스된 등록상표입니다.
zh_hk: AMD、Opteron、AMD 標誌與 AMD Opteron 標誌是 Advanced Micro Devices 的商標或註冊商標。Intel 和 Intel Xeon 是 Intel Corporation 的商標或註冊商標。所有 SPARC 商標的使用皆經過授權，且是 SPARC International, Inc. 的商標或註冊商標。UNIX 是經過 X/Open Company, Ltd. 授權使用的註冊商標。

source: This software or hardware and documentation may provide access to or information on content, products, and services from third parties. Oracle Corporation and its affiliates are not responsible for and expressly disclaim all warranties of any kind with respect to third-party content, products, and services. Oracle Corporation and its affiliates will not be responsible for any loss, costs, or damages incurred due to your access to or use of third-party content, products, or services.
de: Diese Software oder Hardware und die zugehörige Dokumentation können Zugriffsmöglichkeiten auf Inhalte, Produkte und Serviceleistungen von Dritten enthalten. Oracle Corporation und ihre verbundenen Unternehmen übernehmen keine Verantwortung für Inhalte, Produkte und Serviceleistungen von Dritten und lehnen ausdrücklich jegliche Art von Gewährleistung diesbezüglich ab. Oracle Corporation und ihre verbundenen Unternehmen übernehmen keine Verantwortung für Verluste, Kosten oder Schäden, die aufgrund des Zugriffs oder der Verwendung von Inhalten, Produkten und Serviceleistungen von Dritten entstehen.
es: Este software o hardware y la documentación pueden ofrecer acceso a contenidos, productos o servicios de terceros o información sobre los mismos. Ni Oracle Corporation ni sus subsidiarias serán responsables de ofrecer cualquier tipo de garantía sobre el contenido, los productos o los servicios de terceros y renuncian explícitamente a ello. Oracle Corporation y sus subsidiarias no se harán responsables de las pérdidas, los costos o los daños en los que se incurra como consecuencia del acceso o el uso de contenidos, productos o servicios de terceros.
ja: このソフトウェアまたはハードウェア、そしてドキュメントは、第三者のコンテンツ、製品、サービスへのアクセス、あるいはそれらに関する情報を提供することがあります。オラクル社およびその関連会社は、第三者のコンテンツ、製品、サービスに関して一切の責任を負わず、いかなる保証もいたしません。オラクル社およびその関連会社は、第三者のコンテンツ、製品、サービスへのアクセスまたは使用によって損失、費用、あるいは損害が発生しても一切の責任を負いかねます。
ko: 본 소프트웨어 혹은 하드웨어와 관련문서(설명서)는 제 3자로부터 제공되는 컨텐츠, 제품 및 서비스에 접속할 수 있거나 정보를 제공합니다. Oracle Corporation과 그 자회사는 제 3자의 컨텐츠, 제품 및 서비스와 관련하여 어떠한 책임도 지지 않으며 명시적으로 모든 보증에 대해서도 책임을 지지 않습니다. Oracle Corporation과 그 자회사는 제 3자의 컨텐츠, 제품 및 서비스에 접속하거나 사용으로 인해 초래되는 어떠한 손실, 비용 또는 손해에 대해 어떠한 책임도 지지 않습니다.
zh_hk: 本軟體或硬體與說明文件可能提供第三方內容、產品和服務的存取途徑與資訊。Oracle Corporation 和其關係公司明文聲明對第三方網站所提供的內容、產品與服務不做保證，且不負任何責任。Oracle Corporation 和其關係機構對於您存取或使用第三方的內容、產品或服務所引起的任何損失、費用或損害亦不負任何責任。

source: About Package Manager
de: Allgemeine Informationen zu Package Manager
es: Acerca de Package Manager
ja: パッケージマネージャーについて
ko: 패키지 관리자 정보
zh_hk: 關於套裝軟體管理員

source: Package Manager is a graphical user interface (GUI) for the Oracle Solaris Image Packaging System (IPS).
de: Der Package Manager ist eine grafische Benutzeroberfläche (GUI) für Oracle Solaris Image Packaging System (IPS).
es: Package Manager es una interfaz gráfica de usuario (GUI) para Oracle Solaris Image Packaging System (IPS).
ja: パッケージマネージャーは、Oracle Solaris Image Packaging System (IPS) のグラフィカルユーザーインタフェース (GUI) です。
ko: 패키지 관리자는 Oracle Solaris IPS(이미지 패키징 시스템)용 GUI(그래픽 사용자 인터페이스)입니다.
zh_hk: 套裝軟體管理員是 Oracle Solaris 影像封裝系統 (IPS) 的圖形化使用者介面 (GUI)。

source: See the <xref linkend="glossary"/> for definitions of terms used in this document.
de: Im <xref linkend="glossary-"/> finden Sie Definitionen der Begriffe, die in diesem Dokument verwendet werden.
es: Consulte el <xref linkend="glossary"/> para conocer las definiciones de los términos que se emplean en este documento.
ja: このマニュアルで使用されている用語の定義については、<xref linkend="glossary"/> を参照してください。
ko: 이 문서에서 사용되는 용어의 정의는 <xref linkend="glossary"/>를 참조하십시오.
zh_hk: 如需本文件所用字詞的定義，請參閱 <xref linkend="glossary"/>。

source: Oracle Solaris Image Packaging System (IPS) is a software delivery system that interacts with a package repository on a network. IPS is a framework that provides software lifecycle management capabilities, including software installation, upgrade, and removal.
de: Oracle Solaris Image Packaging System (IPS) ist ein Softwarebereitstellungssystem, das mit einem Paket-Repository in einem Netzwerk interagiert. IPS ist eine Grundstruktur mit Funktionen zur Verwaltung des Softwarelebenszyklus einschließlich Softwareinstallation, Upgrade und Deinstallation.
es: Oracle Solaris Image Packaging System (IPS) es un sistema de entrega de software que interacciona con un depósito de paquetes en una red. IPS es un marco que proporciona capacidades de gestión del ciclo de vida del software, lo que incluye la instalación, la actualización y la supresión del software.
ja: Oracle Solaris Image Packaging System (IPS) は、ネットワーク上のパッケージリポジトリと対話するソフトウェア配布システムです。IPS は、ソフトウェアのインストール、アップグレード、削除といったソフトウェアのライフサイクル管理機能を提供するフレームワークです。
ko: Oracle Solaris IPS(이미지 패키징 시스템)는 네트워크의 패키지 저장소와 상호 작용하는 소프트웨어 전달 시스템입니다. IPS는 소프트웨어 설치, 업그레이드 및 제거를 비롯하여 소프트웨어 수명 주기 관리 기능을 제공하는 프레임워크입니다.
zh_hk: Oracle Solaris 影像封裝系統 (IPS) 是一套軟體提供系統，可和網路上的套裝軟體儲存庫互動。IPS 是提供軟體安裝、升級及移除等軟體生命週期管理功能的架構。

source: After you install the Oracle Solaris operating system, you might find that some of the software you want to use is not available. This software probably is available in an IPS package repository. You can use Package Manager or the <literal>pkg</literal>(1M) command to download and install packages from a package repository.
de: Nach der Installation des Oracle Solaris-Betriebssystems werden Sie möglicherweise feststellen, dass manche Software, die Sie verwenden möchten, nicht verfügbar ist. Diese Software ist wahrscheinlich in einem IPS-Paket-Repository enthalten. Verwenden Sie den Package Manager oder den Befehl <literal>pkg</literal>(1M), um Pakete von einem Paket-Repository herunterzuladen und zu installieren.
es: Después de instalar el sistema operativo Oracle Solaris, verá que algunos de los software que desea utilizar no están disponibles. Es probable que los software estén disponibles en un depósito de paquetes IPS. Puede utilizar Package Manager o el comando <literal>pkg</literal>(1M) para descargar e instalar paquetes de un depósito de paquetes.
ja: Oracle Solaris オペレーティングシステムのインストールのあと、使用したいソフトウェアのいくつかが使用可能ではない場合があります。このソフトウェアは、IPS パッケージリポジトリに用意されている可能性があります。パッケージマネージャーまたは <literal>pkg</literal>(1M) コマンドを使用して、パッケージリポジトリからパッケージをダウンロードしてインストールすることができます。
ko: Oracle Solaris 운영 체제를 설치한 후 사용하려는 일부 소프트웨어를 사용하지 못할 수 있습니다. 대개는 IPS 패키지 저장소에서 이 소프트웨어를 사용할 수 있습니다. 패키지 관리자 또는 <literal>pkg</literal>(1M) 명령을 사용하여 패키지 저장소에서 패키지를 다운로드하여 설치할 수 있습니다.
zh_hk: 安裝 Oracle Solaris 作業系統之後，您可能發現無法使用某些您想要的軟體。此軟體可能可從 IPS 套裝軟體儲存庫取得。您可以使用套裝軟體管理員或 <literal>pkg</literal>(1M) 指令，從套裝軟體儲存庫下載並安裝套裝軟體。

source: IPS also enables you to create a copy of an existing IPS package repository, create your own IPS package repository, and publish your own IPS packages. For more information about IPS, see the Oracle Solaris 11 Information Library. Go to <literal>download.oracle.com</literal>, select Documentation Index on the left, select Systems Software, select Oracle Solaris 11, and select View Library. See especially <citetitle>Adding and Updating Oracle Solaris 11 Software Packages</citetitle>.
de: Mit IPS können Sie außerdem eine Kopie eines vorhandenen IPS-Paket-Repository erstellen, Ihr eigenes IPS-Paket-Repository erstellen und Ihre eigenen IPS-Pakete veröffentlichen. Weitere Informationen zu IPS finden Sie in der Informationsbibliothek zu Oracle Solaris 11. Rufen Sie <literal>download.oracle.com</literal> auf, wählen Sie links Documentation Index. Wählen Sie dann Systems Software, Oracle Solaris 11 und schließlich View Library. Lesen Sie dazu insbesondere <citetitle>Adding and Updating Oracle Solaris 11 Software Packages</citetitle>.
es: IPS también le permite crear una copia de un depósito de paquetes IPS existente, crear su propio depósito de paquetes IPS y publicar sus propios paquetes IPS. Si desea obtener más información sobre IPS, consulte Oracle Solaris 11 Information Library. Vaya a <literal>download.oracle.com</literal>, seleccione Documentation Index (índice de documentación) a la izquierda, Systems Software (software de sistemas), Oracle Solaris 11 y View Library (ver biblioteca). En especial, consulte <citetitle>Agregar y actualizar paquetes de software Oracle Solaris 11</citetitle>.
ja: IPS では、既存の IPS パッケージリポジトリのコピーを作成すること、ユーザー独自の IPS パッケージリポジトリを作成すること、およびユーザー独自の IPS パッケージを発行することもできます。IPS の詳細については、Oracle Solaris 11 Information Library を参照してください。<literal>download.oracle.com</literal> にアクセスして、左側の「Documentation Index」を選択し、「Systems Software」、「Oracle Solaris 11」、「View Library」の順に選択します。特に、『<citetitle>Adding and Updating Oracle Solaris 11 Software Packages</citetitle>』を参照してください。
ko: IPS를 통해 기존 IPS 패키지 저장소의 복사본을 만들고, 고유의 IPS 패키지 저장소를 만들고, 고유의 IPS 패키지를 게시할 수도 있습니다. IPS에 대한 자세한 내용은 Oracle Solaris 11 Information Library를 참조하십시오. <literal>download.oracle.com</literal>으로 이동하여 왼쪽에 있는 Documentation Index를 선택하고 Systems Software, Oracle Solaris 11, View Library를 차례로 선택하십시오. 특히 <citetitle>Adding and Updating Oracle Solaris 11 Software Packages</citetitle>를 참조하십시오.
zh_hk: IPS 也可以讓您建立現有 IPS 套裝軟體儲存庫的副本、建立您自己的 IPS 套裝軟體儲存庫以及發佈您自己的 IPS 套裝軟體。如需有關 IPS 的更多資訊，請參閱 Oracle Solaris 11 資訊庫。移至 <literal>download.oracle.com</literal>，選取左方的 [Documentation Index] (文件索引)，再依序選取 [Systems Software] (系統軟體)、[Oracle Solaris 11] 和 [View Library] (檢視文件庫)。請參閱「<citetitle>Adding and Updating Oracle Solaris 11 Software Packages</citetitle>」。

source: Package Manager provides a subset of the functionality offered by the IPS command-line interface.
de: Der Package Manager bietet einen Teil der Funktion, die über die IPS-Befehlszeilenschnittstelle bereitgestellt wird.
es: Package Manager proporciona un subconjunto de las funciones que ofrece la interfaz de la línea de comandos IPS.
ja: パッケージマネージャーでは、IPS コマンド行インタフェースで提供されている機能の一部を実行できます。
ko: 패키지 관리자는 IPS 명령줄 인터페이스에서 제공하는 기능 중 일부를 제공합니다.
zh_hk: 套裝軟體管理員提供由 IPS 指令行介面所提供的功能子集。

source: Package Manager enables you to perform the following tasks:
de: Mit dem Package Manager können Sie die folgenden Aufgaben ausführen:
es: Package Manager permite efectuar las siguientes tareas:
ja: パッケージマネージャーを使用すると、次の作業を実行できます。
ko: 패키지 관리자를 사용하면 다음 작업을 수행할 수 있습니다.
zh_hk: 套裝軟體管理員可讓您執行下列作業：

source: Find, install, update, and remove IPS packages. See <xref linkend="manage-pkg"/>.
de: Suchen, Installieren, Aktualisieren oder Entfernen von IPS-Paketen: weitere Informationen unter <xref linkend="manage-pkg"/>.
es: Encontrar, instalar, actualizar y eliminar paquetes IPS. Consulte <xref linkend="manage-pkg"/>.
ja: IPS パッケージの検索、インストール、更新、および削除。<xref linkend="manage-pkg"/>を参照してください。
ko: IPS 패키지 검색, 설치, 업데이트 및 제거. <xref linkend="manage-pkg"/> 참조
zh_hk: 尋找、安裝、更新及移除 IPS 套裝軟體。請參閱 <xref linkend="manage-pkg"/>。

source: Update your system (update all the packages on your system). See <xref linkend="update_all"/>.
de: Aktualisieren des Systems (Updates für alle Pakete auf Ihrem System): weitere Informationen unter <xref linkend="update_all"/>.
es: Actualizar el sistema (actualizar todos los paquetes del sistema). Consulte <xref linkend="update_all"/>.
ja: システムの更新 (システム上にあるすべてのパッケージの更新)。<xref linkend="update_all"/>を参照してください。
ko: 시스템 업데이트(시스템의 모든 패키지를 업데이트). <xref linkend="update_all"/> 참조하
zh_hk: 更新您的系統 (更新系統中的所有套裝軟體)。請參閱 <xref linkend="update_all"/>。
