Repository: oracle/solaris-ips
Catalog: src/gui/help/*/*.po
Languages: ca, cs, de, es, ja, ko, ru, zh_hk

source: <emphasis role="strong">Remove</emphasis> – Select a package and click <emphasis role="strong">Remove</emphasis> to remove a package.
ca: <emphasis role="strong">Treure</emphasis> – Seleccioneu un paquet i cliqueu a <emphasis role="strong">Treure</emphasis> per a treure un paquet.
cs: <emphasis role="strong">Odstranit</emphasis> - Zvolte balíček a klikněte na <emphasis role="strong">Odstranit</emphasis> pro odebrání balíčku.
ru: <emphasis role="strong">Удаление</emphasis> – для удаления пакета выберите его и нажмите кнопку <emphasis role="strong">Удалить</emphasis>.

source: <emphasis role="strong">Search for a Package</emphasis> – Type the name or description of a package in the <emphasis role="strong">Search</emphasis> field to search for a package. See the <xref linkend="search-pkg"/> section for examples on how to search for a package.
ca: <emphasis role="strong">Cercar un paquet</emphasis> – Escriviu el nom o la descripció d'un paquet al camp de <emphasis role="strong">Cerca</emphasis> per a cercar un paquet. Vegeu la secció <xref linkend="search-pkg"/> per a exemples de com cercar un paquet.
cs: <emphasis role="strong">Vyhledat balíček</emphasis> - Uveďte název balíčku nebo popis balíčku do políčka <emphasis role="strong">Hledat</emphasis> pro vyhledání balíčku. Viz sekce <xref linkend="search-pkg"/> ukázky, jak vyhledat balíček.
ru: <emphasis role="strong">Поиск пакета</emphasis> – для поиска пакета введите имя или описание пакета в поле <emphasis role="strong">Поиск</emphasis>. Примеры поиска пакета см. в разделе <xref linkend="search-pkg"/>.

source: Publisher Drop-Down Menu
ca: Menú desplegable del publicador
cs: Rozbalovací menu Vydavatel
ru: Раскрывающееся меню "Издатель"

source: The list of available publishers is shown in the <emphasis role="strong">Publisher</emphasis> drop-down menu. Users can perform the following tasks from the publisher drop-down menu :
ca: El llistat de publicadors disponibles es mostra en el menú desplegable del <emphasis role="strong">Publicador</emphasis>. Els usuaris poden realitzar les següents tasques des del menú desplegable del publicador :
cs: Seznam dostupných vydavatelů je zobrazen v rozbalovacím menu <emphasis role="strong">Vydavatel</emphasis>. Uživatelé mohou z rozbalovacího menu Vydavatel provádět následující úkony:
ru: В раскрывающемся меню <emphasis role="strong">Издатель</emphasis> выводится список доступных издателей. Это меню позволяет выполнять следующие задачи:

source: Select a publisher
ca: Seleccionar un publicador
cs: Zvolit vydavatele
ru: выбор издателя;

source: View the list of packages installed from all publishers
ca: Visualitza el llistat de paquets instal·lar des de tots els publicadors
cs: Zobrazit seznam balíčků nainstalovaných od všech vydavatelů
ru: просмотр списка установленных пакетов от всех издателей;

source: Search for package across all publishers
ca: Cerca paquets a través de tots els publicadors
cs: Vyhledávat balíček u všech vydavatelů
ru: поиск пакета по всем издателям;

source: Add a publisher
ca: Afegir un publicador
cs: Přidat vydavatele
ru: добавление издателей;

source: List of Packages by Category
ca: Llistat dels paquets per categoria
cs: Seznam balíčků podle kategorie
ru: Список пакетов по категориям

source: You can browse the available packages by category in the left hand side panel. Click on a category to see the sub-categories of packages available. There are six main categories that are displayed in the Package Manager:
ca: Podeu navegar els paquets disponibles per categoria en el cantó esquerra del panell. Cliqueu en una categoria per visualitzar les sub-categories disponibles pels paquets. Hi han sis categories principals, que es mostren en el gestor de paquets:
cs: Můžete procházet dostupné balíčky po kategoriích v levém postranním panelu. Klikněte na kategorii pro zobrazení podkategorií dostupných balíčků. Ve Správci balíčků je zobrazeno šest hlavních kategorií.
ru: Доступные пакеты можно просматривать по категориям на боковой панели слева. Щелкните категорию для отображения доступных подкатегорий пакетов. В диспетчере пакетов предусмотрено шесть главных категорий.

source: Applications
ca: Aplicacions
cs: Aplikace
ru: Приложения

source: Desktop (GNOME)
ca: Escriptori (GNOME)
ru: Рабочий стол (GNOME)

source: Development
ca: Desenvolupament
cs: Vývoj
ru: Разработка

source: Drivers
ca: Controladors
cs: Ovladače
ru: Драйверы

source: System
ca: Sistema
cs: Systém
ru: Система

source: Web Services
ca: Serveis Web
cs: Webové Služby
ru: Веб-службы

source: Recent Searches
ca: Cerques recents
cs: Nedávná vyhledávání
ru: Недавние результаты поиска

source: The Package Manager saves your recent package searches. Click the Recent Searches in the left hand side panel to view the packages you searched for recently.
ca: El Gestor de paquets desa les vostres cerques recents. Cliqueu a Cerques recents, en el cantó esquerra del panell, per a visualitzar els paquets que heu cercat recentment.
cs: Správce balíčků ukládá vaše nedávná vyhledávání balíčků. Klikněte na Nedávná vyhledávání v levém postranním panelu pro zobrazení Vámi nedávno vyhledáváných balíčků.
ru: В диспетчере пакетов сохраняется несколько последних результатов поиска пакетов. Для просмотра списка пакетов, поиск которых выполнялся за последнее время, нажмите кнопку "Недавние результаты поиска" на левой боковой панели.

source: List of Packages by Status
ca: Llistat de paquets per estat
cs: Seznam balíčků podle stavu
ru: Список пакетов по статусу

source: The <emphasis role="strong">View</emphasis> drop-down menu enables you to view package status with the following options :
ca: El menú desplegable de <emphasis role="strong">Vista</emphasis> us permet visualitzar l'estat del paquet amb les següents opcions :
cs: Rozbalovací nabídka <emphasis role="strong">Náhled</emphasis> umožňuje zobrazení stavu balíčků s následujícími možnostmi:
ru: Раскрывающееся меню <emphasis role="strong">Вид</emphasis> позволяет просматривать статус пакета в одном из следующих режимов:

source: <emphasis role="strong">All Packages</emphasis> – Shows the list of all packages available within the current publisher.
ca: <emphasis role="strong">Tots els paquets</emphasis> – Mostra el llistat de tots els paquets disponibles l'actual publicador.
cs: <emphasis role="strong">Všechny balíčky</emphasis> - Zobrazí seznam všech balíčků dostupných v rámci daného vydavatele.
ru: <emphasis role="strong">Все пакеты</emphasis> – отображается список всех пакетов, доступных для текущего издателя.

source: <emphasis role="strong">Installed Packages</emphasis> – Shows the list of packages installed within the current publisher on your system.
ca: <emphasis role="strong">Paquets instal·lats</emphasis> – Mostra el llistat de tots els paquets instal·lats al vostre sistema del publicador actual.
cs: <emphasis role="strong">Nainstalované balíčky</emphasis> - Zobrazí seznam balíčků v rámci daného vydavatele nainstalovaných na vašem systému.
ru: <emphasis role="strong">Установленные пакеты</emphasis> – отображается список установленных в системе пакетов от текущего издателя.

source: <emphasis role="strong">Updates</emphasis> — Shows the list of packages that have newer versions available within the current publisher.
ca: <emphasis role="strong">Actualitzacions</emphasis> — Mostra el llistat de paquets que tenen noves versions dins del publicador actual.
cs: <emphasis role="strong">Aktualizace</emphasis> - Zobrazí seznam balíčků s dostupnými novějšími verzemi v rámci daného vydavatele.
ru: <emphasis role="strong">Обновления</emphasis> – отображается список пакетов, для которых у текущего издателя доступны более новые версии.

source: <emphasis role="strong">Not Installed Packages</emphasis> – Shows the list of packages that are not installed, but are available in the currently selected publisher.
ca: <emphasis role="strong">Paquets no instal·lats</emphasis> – Mostra el llistat dels paquets que no estan instal·lats, però estan disponibles en l'actual publicador.
cs: <emphasis role="strong">Nenainsatlované balíčky</emphasis> - Zobrazí seznam balíčků, které nejsou nainstalovány, ale jsou dostupné v rámci daného vydavatele.
ru: <emphasis role="strong">Неустановленные пакеты</emphasis> – отображается список пакетов, которые не установлены, но доступны у текущего выбранного издателя.

source: <emphasis role="strong">Selected Packages</emphasis> – Shows the list of packages that you have selected.
ca: <emphasis role="strong">Paquets seleccionats</emphasis> – Mostra un llistat dels paquets que heu seleccionat.
cs: <emphasis role="strong">Vybrané balíčky</emphasis> – Zobrazí seznam balíčků, které jse vybrali.
ru: <emphasis role="strong">Выбранные пакеты</emphasis> – отображается список выбранных пакетов.

source: Package Name, Status, and Description
ca: Nom, estat i descripció del paquet
cs: Jméno, Stav a Popis balíčku
ru: Название пакета, его состояние и описание

source: The list of packages in the selected category, a brief description, and their status are displayed in here.
ca: Aquí es mostra el llistat de paquets en la categoria seleccionada, una descripció breu, i el seu estat.
cs: Zde je zobrazen seznam balíčků ve zvolené kategorii, stručný popis a jejich stav.
ru: Выводится список пакетов из выбранной категории, их краткое описание и статус.

source: The Publisher name is also displayed here in the following instances :
ca: Aquí també es mostra el nom del publicador en les següents instàncies :
cs: V následujících případech je zobrazen i vydavatel:
ru: В некоторых случаях здесь также выводится название издателя:

source: When the <emphasis role="strong">Pubisher</emphasis> drop-down menu is set to All Publishers (Installed)
ca: Quant el menú desplegable del <emphasis role="strong">Pubicador</emphasis> està establert a Tots els publicadors (Instal·lats)
cs: Rozbalovací menu <emphasis role="strong">Vydavatel</emphasis> je nastaveno na Všichni vydavatelé (Nainstalováno)
ru: если в раскрывающемся меню <emphasis role="strong">Издатель</emphasis> выбрано значение "Все издатели (установленные)";

source: When search results are displayed for the All Publishers (Search) option
ca: Quant es mostren els resultats la cerca per a l'opció de cerca Tots els publicadors (Cerca)
cs: Jsou zobrazeny výsledky vyhledávání pro Všechny vydavatele
ru: если выводятся результаты поиска по всем издателям в режиме "Все издатели (поиск)";

source: When a recent search result is displayed
ca: Quant es mostren els resultats recents de cerca
cs: Je zobrazen výsledek nedávného vyhledávání
ru: если выводится результат недавнего поиска.

source: Package Details
ca: Detalls del paquet
cs: Podrobnosti o balíčku
ru: Подробные сведения о пакете

source: Click a package name to select it. Details of the selected package, such as name, version, file dependencies, and license are displayed in this window.
ca: Cliqueu al nom del paquet per a seleccionar-lo. Detalls del paquet seleccionat, com nom, versió, dependències de fitxers, i llicència són mostrats en aquesta finestra.
cs: Klikněte na jméno balíčku a zobrazí se informace o vybraném balíčku jako je jméno, verze, souborové závislosti a licence.
ru: Для выбора пакета щелкните мышью его название. В данном окне отображаются подробные сведения об этом пакете, например название, версия, зависимости файлов и лицензия.

source: Package Manager Settings
ca: Preferències del Gestor de paquets
cs: Nastavení Správce balíčku
ru: Параметры настройки диспетчера пакетов

source: Use the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> to change the Package Manager settings. The following sections discuss the preferences that can be changed by the user.
ca: Utilitzeu <menuchoice><guimenu>Edició</guimenu><guimenuitem>Referències</guimenuitem></menuchoice> per canviar les preferències del Gestor de paquets. Les següents seccions mostren les preferències poden ser canviades per l'usuari.
cs: Ke změně nastavení Správce balíčků, použijte <menuchoice><guimenu>Upravit</guimenu><guimenuitem>Nastavení</guimenuitem></menuchoice>. Následující sekce se zabývají nastaveními, která může uživatel měnit.
ru: Для изменения параметров настройки диспетчера пакетов используется меню <menuchoice><guimenu>Правка</guimenu><guimenuitem>Параметры</guimenuitem></menuchoice>. В следующих разделах рассматриваются параметры настройки, доступные пользователю для изменения.

source: Start Page Preferences
ca: Preferències de la pàgina d'inici
cs: Nastavení úvodní stránky
ru: Параметры начальной страницы

source: A Start Page is displayed in the main window of the Package Manager when the application is started. The Start Page provides links to <ulink url="http://opensolaris.com">opensolaris.com</ulink> page where you can get more information about OpenSolaris, subscribe to newsletters and join the OpenSolaris community.
ca: Una Pàgina d'inici es mostrada a la pàgina principal del Gestor de Paquets quan l'aplicació es iniciada. La pàgina d'inici proporciona enllaços a la pàgina <ulink url="http://opensolaris.com">opensolaris.com</ulink> on podeu obtenir més informació quant a OpenSolaris, subscriure's a butlletins i unir-se a la comunitat d'OpenSolaris.
cs: Úvodní stránka je zobrazena v hlavním okně Správce Balíčků při spuštění aplikace. Úvodní stránka poskytuje odkazy na <ulink url="http://opensolaris.com">opensolaris.com</ulink>, dále odkaz na přihlášení se do odebírání e-mailů s novinkami a připojení se k OpenSolaris komunitě.
ru: При запуске приложения в главном меню диспетчера пакетов выводится начальная страница. На начальной странице содержатся ссылки на страницу <ulink url="http://opensolaris.com">opensolaris.com</ulink>, где приведена дополнительная информация об ОС OpenSolaris, можно подписаться на списки рассылки или вступить в сообщество OpenSolaris.

source: You can choose to turn off this setting so this page is not displayed when Package Manager starts.
ca: Podeu seleccionar apagar aquesta preferència, aleshores la pàgina no és mostrada quan comença el Gestor de Paquets.
cs: Můžete zvolit vypnout toto nastavení tak, že úvodní stránka nebude zobrazena při startu Správce balíčků.
ru: Этот параметр настройки можно отключить; в результате эта страница не будет выводиться при запуске диспетчера пакетов.

source: Select <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> from the main menu and uncheck the <emphasis role="strong">Show Start Page on Startup</emphasis> to disable the Start Page. This dialog is checked by default.
ca: Seleccioneu <menuchoice><guimenu>Edició</guimenu><guimenuitem>Preferències</guimenuitem></menuchoice> des del menú principal i desmarqueu <emphasis role="strong">Mostrar la pàgina d'inici a l'iniciar</emphasis> per a deshabilitar la Pàgina d'inici. Aquesta opció està marcada per defecte.
cs: V hlavní nabídce zvolte<menuchoice><guimenu>Upravit</guimenu><guimenuitem>Nastavení</guimenuitem></menuchoice> a odškrtněte <emphasis role="strong">Zobrazit Úvodní stránku při spuštění</emphasis>. Tento dialog je standartně zaškrtnutý.
ru: Выберите в меню пункт <menuchoice><guimenu>Правка</guimenu><guimenuitem>Параметры</guimenuitem></menuchoice> и снимите флажок <emphasis role="strong">Показывать начальную страницу при запуске</emphasis> для отключения начальной страницы. По умолчанию этот флажок установлен.

source: Select <menuchoice><guimenu>View</guimenu><guimenuitem>Start Page</guimenuitem></menuchoice> from the main menu to go to the Start Page at anytime.
ca: Seleccioneu <menuchoice><guimenu>Visualitzar</guimenu><guimenuitem>Pàgina d'inici</guimenuitem></menuchoice> des del menú principal per anar a la pàgina s'inici en qualsevol moment.
cs: V hlavní nabídce zvolte <menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Úvodní stránka</guimenuitem></menuchoice> kdykoli pro zobrazení Úvodní stránky.
ru: На начальную страницу всегда можно перейти с помощью пункта меню <menuchoice><guimenu>Вид</guimenu><guimenuitem>Начальная страница</guimenuitem></menuchoice>.

source: The Package Manager application can remember some of its current settings if the <emphasis role="strong">Remember current state on exit</emphasis> option in the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> is checked.
ca: L'aplicació del Gestor de paquets pot recordar algunes de les seves preferències actuals s l'opció <emphasis role="strong">Recordar l'estat actual al sortir</emphasis> en <menuchoice><guimenu>Edició</guimenu><guimenuitem>Preferències</guimenuitem></menuchoice> està marcada.
cs: Aplikace Správce balíčků je schopna si zapamatovat některá její současná nastavení, pokud je zaškrtnuta možnost <emphasis role="strong">Pamatovat si současný stav při ukončení</emphasis> v nabídce <menuchoice><guimenu>Upravit</guimenu><guimenuitem>Nastavení</guimenuitem></menuchoice>
ru: В приложении диспетчера пакетов реализована возможность сохранения части текущих параметров настройки, если установлен флажок <emphasis role="strong">Запомнить текущее состояние при выходе</emphasis> в меню <menuchoice><guimenu>Правка</guimenu><guimenuitem>Параметры</guimenuitem></menuchoice>.

source: The following settings are saved:
ca: Les següents preferències estan desades:
cs: Následující nastavení jsou uložena:
ru: Сохраняются следующие параметры настройки:

source: <emphasis role="strong">Vertical separators</emphasis> – The size of the columns in the main window the Package Manager
ca: <emphasis role="strong">Separadors verticals</emphasis> – La mida de les columnes en la finestra principal del Gestor de paquets
cs: </emphasis role="strong">Vertikální oddělovače</emphasis> - Velikost sloupců v hlavním okně Správce balíčků.
ru: <emphasis role="strong">Вертикальные разделители</emphasis> – размер столбцов в главном окне диспетчера пакетов.

source: <emphasis role="strong">Window size</emphasis> – The size of the Package Manager window
ca: <emphasis role="strong">Mida finestra</emphasis> – La mida de la finestra del Gestor de paquets
cs: <emphasis role="strong">Velikost okna</emphasis> - Velikost okna Správce balíčků
ru: <emphasis role="strong">Размер окна</emphasis> – размер окна диспетчера пакетов.

source: <emphasis role="strong">Current publisher</emphasis> – The publisher that is selected when the Package Manager is closed
ca: <emphasis role="strong">Publicador actual</emphasis> – El publicador que és seleccionat quant el gestor de paquets és tancat
cs: <emphasis role="strong">Současný vydavatel</emphasis> - Vydavatel, který je momentálně zvolen, když je Správce balíčků ukončen.
ru: <emphasis role="strong">Текущий издатель</emphasis> – издатель, выбранный на момент закрытия диспетчера пакетов.

source: When a package is selected for installation, update, or removal, a confirmation dialog is displayed that displays the list of packages and the action to be performed. Under the <emphasis role="strong">Show Confirmation Dialog</emphasis> uncheck <emphasis role="strong">On Updates</emphasis>, <emphasis role="strong">On Package Install/Update</emphasis>, and <emphasis role="strong">On Package Remove</emphasis> to turn these settings off.
ca: Quant un paquer és seleccionar per a instal·lar, actualitzar o eliminar, es mostra un diàleg de confirmació el qual mostra el llistat de paquets i les accions a ser realitzades. Sota el <emphasis role="strong">Diàleg de mostra de confirmació</emphasis> desmarqueu <emphasis role="strong">en Actalitzacions</emphasis>, <emphasis role="strong">en Instal·lar/Actualitzar paquets</emphasis>, i <emphasis role="strong">en Eliminació de aquets</emphasis> per desactivar aquestes preferències.
cs: Pokud je balíček vybrán k instalaci, aktualizaci nebo odebrání, je zobrazen potvrzovací dialog zobrazující seznam balíčků a operací, které budou provedeny. V okně <emphasis role="strong">Ukázat Potvrzovací Dialog</emphasis> odškrtněte<emphasis role="strong">Při aktualizacích</emphasis>, <emphasis role="strong">Při Instalaci/Aktualizaci Balíčků</emphasis> a <emphasis role="strong">Při Odebírání Balíčků</emphasis> pro vypnutí těchto nastavení.
ru: При выборе пакета для установки, обновления или удаления выводится диалоговое окно подтверждения, содержащее список пакетов и выполняемые действия. Для отключения этих параметров настройки снимите флажки <emphasis role="strong">При обновлении</emphasis>, <emphasis role="strong">При установке/обновлении пакета</emphasis> и <emphasis role="strong">При удалении пакета</emphasis> в разделе <emphasis role="strong">Вывод диалогового окна подтверждения</emphasis>.

source: Working With Packages
ca: Treballant amb paquets
cs: Pracujeme s balíčky
ru: Работа с пакетами

source: Install a Package
ca: Instal·lar un paquet
cs: Instalace balíčku
ru: Установка пакета

source: The list of packages and their status is displayed in the main window of the Package Manager. Perform the following steps to install a package:
ca: El llistat dels paquets i els seues estats es mostra en la finestra principal del Gestor de paquets. Realitzeu els següents passos per a instal·lar un paquet:
cs: Seznam balíčků a jejich stavu je zobrazen v hlavním okně Správce balíčků. Pro instalaci balíčku proveďte následující kroky.
ru: Список пакетов и их состояний выводится в главном окне диспетчера пакетов. Для установки пакета необходимо выполнить следующие действия:

source: Check the box next to the package or packages to select it. Double-clicking the package also selects the package.
ca: Maqueu la casella que està a la vora del paquet per a selecciona'l. Clicar dues vegades damunt del paquet també el selecciona.
cs: Označte políčko vedle balíčku k jeho vybrání. Dvojklikem také balíček vybere.
ru: Для выбора пакета или пакетов установите расположенный рядом с ним флажок. Пакет также можно выбрать двойным щелчком.

source: Click <guibutton>Install/Update</guibutton> to start the package installation process.
ca: Cliqueu a <guibutton>Instal·lar/Actualitzar</guibutton> per a iniciar el procés d'intal·lació.
cs: Klikněte na <guibutton>Instalovat/Aktualizovat</guibutton> pro start procesu instalace balíčku.
ru: Для запуска процесса установки пакетов нажмите кнопку <guibutton>Установка/обновление</guibutton>.

source: You can also choose <menuchoice><guimenu>Package</guimenu><guimenuitem>Install/Update</guimenuitem></menuchoice> to start the package installation process.
ca: També podeu seleccionar <menuchoice><guimenu>Paquet</guimenu><guimenuitem>Instal·lar/Actualitzar</guimenuitem></menuchoice> per a iniciar el procés d'instal·lació de paquets.
cs: Instalaci můžete také začít vybráním <menuchoice><guimenu>Balíček</guimenu><guimenuitem>Instalovat/Aktualizovat</guimenuitem></menuchoice>.
ru: Для начала процесса установки пакета можно также выбрать в меню пункты <menuchoice><guimenu>Пакет</guimenu><guimenuitem>Установка/обновление</guimenuitem></menuchoice>.

source: Click <guilabel>Details</guilabel> to view the installation details or <guibutton>Cancel</guibutton> to cancel the package installation.
ca: Cliqueu a <guilabel>Detalls</guilabel> per a visualitzar els detalls de la instal·lació, o bé <guibutton>Cancel·lar</guibutton> per a cancel·lar la instal·lació.
cs: Klikněte na <guilabel>Podrobnosti</guilabel> pro zobrazení podrobností o instalaci nebo na <guibutton>Zrušit</guibutton> pro zrušení instalace balíčku.
ru: Для просмотра подробных данных об установке нажмите кнопку <guilabel>Подробности</guilabel>; для отмены установки пакетов нажмите кнопку <guilabel>Отмена</guilabel>.

source: After the installation has completed, click <guibutton>Close</guibutton>.
ca: Després que es completi la instal·lació, cliqueu a <guibutton>Tancar</guibutton>.
cs: Po dokončení instalace klikněte na tlačítko <guibutton>Zavřít</guibutton>.
ru: По завершении установки нажмите кнопку <guibutton>Закрыть</guibutton>.
